[
  {
    "epic": {
      "key": "VZI-69349",
      "released_in_current_rc": false,
      "summary": "Configuration management using config server",
      "description": "Setup a config server which will serve the property files to different micro services.",
      "status": "In Design",
      "assignee": "Qazi Asad Ullah",
      "created": "2021-08-01T07:51:25.580-0700"
    },
    "issues": [
      {
        "key": "VZI-108895",
        "summary": "Convert Shopper Api from Spring to Spring boot",
        "description": "Convert Shopper API to spring boot",
        "status": "Investigation Done",
        "assignee": "Muhammad Hamza",
        "created": "2025-03-11T02:19:46.072-0700",
        "issue_type": "Spike",
        "parent_id": "VZI-69349"
      }
    ]
  },
  {
    "epic": {
      "key": "No Epic",
      "released_in_current_rc": false
    },
    "issues": [
      {
        "key": "VZI-101072",
        "summary": "Regression Testing purchase Team RC-2024-6",
        "description": "RC Tickets:  Test Cases Status: https://vroozi.testrail.net/index.php?/milestones/view/952",
        "status": "Done",
        "assignee": "Ayesha Waseem",
        "created": "2024-07-03T23:22:01.936-0700",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-100768",
        "summary": "accounts_payable_revision_history is not updating properly the documentUpdatedDate",
        "description": "TODO   please see commet   and add the steps here url:   https://go.vroozi.com/#/login username:   asma.latif+APM@vroozi.com password:  Redangel1! Preconditions: AP User should have logged into the Application. Steps to Reproduce: Click to Create an Invoice/Memo/PRQ. Add Details and submit the Invoice to trigger either of the (Exception Handling/Coding/Pending) Event. Resolve the (Exception Handling/Coding/Pending)Status issues. Access DB>Vroozi>accounts_payable_revision_history Collection. Run the Find query against the document id and check the DocumentUpdatedDate Its not logging in some cases. Actual result: documentUpdatedDate is not updating correctly in some cases. Expected Result: documentUpdatedDate is always newer than the createdDate Thanks, Asma",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-06-26T07:45:40.393-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100758",
        "summary": "Apply to All- Purchasing Organisation is being picked from Master data default when user selects cost centre",
        "description": "Server : stage Credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req:    Master Data > Organisations > set default Purchasing Organisation Dictate via Company code should be ON Steps to Reproduce: Login with above employee credentials Open a draft PR Select a line item and click on Apply to All button Select Accounting category as “Cost centre” Search a cost centre and select a value Actual : Purchasing Org value saved is being picked from defaults and being set  Expected : Purchasing Org value should not be populated",
        "status": "Released",
        "assignee": "Zain Mehmood",
        "created": "2024-06-26T05:40:10.463-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100612",
        "summary": "Stage - Accounts Payable - PO Status is not changing to Invoiced in case its Invoice gets Posted.",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   asma.latif+EMP2405@vroozi.com password:  Blueangel1@ Preconditions: AP User should have logged into the Application. Received PO should already exist.  2000030012 Posting of AP Documents without a Connector should be either ON/OFF via Admin>Accounts Payable>Settings>Preferences>Posting of AP Documents Section. Steps to Reproduce: Click to Create Invoice and reference the fully received PO.  9000030274 Approve and then Post the Invoice. Invoice Status shows Invoiced. Access the PO. Please see PO status is “Received”. Drag open the Side Panel and Change History Icon. Please see audit has been logged of “ Purchase Order invoiced “. Actual result: PO Order status is not changing to Invoiced. Expected Result: PO against the Posted Invoice should have its status changed to Invoiced. Screen Cast: Thanks, Asma",
        "status": "Abandoned",
        "assignee": "Ahmed Habib",
        "created": "2024-06-24T00:13:01.120-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100244",
        "summary": "PROD - PMAN - Company - Workflow - Approval Rule - Export causes issue when Approval Rules contain a deactivated/deleted Approver.",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   notifyvroozi@gmail.com password:  Welcome1 Preconditions: Admin User should have logged into the Application. “ACCOUNTS_PAYABLE_WORKFLOW__ENHANCED_WORKFLOW” feature toggle is enabled. Approval Rule/s should exist certain Approvers been deactivated or deleted. Steps to Reproduce: Access Company>Workflow>Approval Rules Grid. Click to  Export Approval Rules  button on top right side of the grid. A File is being processed overlay appear for a sec and then disappears. The Button’s spinning continues for infinite amount of time. Error generates in Logs too. Actual result: Export Spinning continues forever and errors out in logs, Expected Result: Export should be successful even for the Approval Rule/s which have deactivated or deleted Approval Chain/s. Screen Shot/Exception in Logs: ==> /usr/share/tomcat9/logs/vroozi.err <== 2024-06-10 08:25:38,656 c.v.u.SecurityContextHolderAwareThreadPoolTaskExecutor [SecurityContextHolderAwareThreadPoolTaskExecutor.java:32] - Error In Executing the Runnable Task. Authentication : UsernamePasswordAuthenticationToken [Principal={\"unitId\":\"2\",\"type\":\"USER\",\"user\":{\"id\":\"50c94202e4b04539e8277550\",\"username\":\"notifyvroozi@gmail.com\",\"email\":\"notifyvroozi@gmail.com\",\"userId\":\"2\"},\"systemUser\":null}, Credentials=[PROTECTED], Authenticated=true, Details=null, Granted Authorities=[ROLE_ADMINISTRATOR]] ----------------------------------------------------------------------------------- com.vroozi.api.requests.exception.InvalidDataException: null         at java.base/java.util.Optional.orElseThrow(Optional.java:403) ~[na:na]         at com.vroozi.api.user.service.UserService.findById(UserService.java:146) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.setApproverAndApprovalLimitInColumns(CompanyWorkflowExportServiceImpl.java:528) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.buildRowData(CompanyWorkflowExportServiceImpl.java:266) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.lambda$buildAndWriteRowsData$1(CompanyWorkflowExportServiceImpl.java:200) ~[classes/:na]         at java.base/java.util.ArrayList.forEach(ArrayList.java:1511) ~[na:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.buildAndWriteRowsData(CompanyWorkflowExportServiceImpl.java:199) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.exportWorkflows(CompanyWorkflowExportServiceImpl.java:181) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowExportServiceImpl.exportWorkflows(CompanyWorkflowExportServiceImpl.java:168) ~[classes/:na]         at com.vroozi.api.companyworkflow.service.impl.CompanyWorkflowBulkUploadServiceImpl.lambda$downloadWorkflow$1(CompanyWorkflowBulkUploadServiceImpl.java:395) ~[classes/:na]         at org.springframework.security.concurrent.DelegatingSecurityContextRunnable.run(DelegatingSecurityContextRunnable.java:82) ~[spring-security-core-5.7.3.jar:5.7.3]         at com.vroozi.util.SecurityContextHolderAwareThreadPoolTaskExecutor.lambda$execute$0(SecurityContextHolderAwareThreadPoolTaskExecutor.java:30) ~[classes/:na]         at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1136) ~[na:na]         at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:635) ~[na:na]         at java.base/java.lang.Thread.run(Thread.java:833) ~[na:na] Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-06-10T01:50:19.932-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100195",
        "summary": "PROD - Accounts Payable - Company - Workflow - Approval Rule Bulk Upload - Rule is being added skipping the Conditions which donot exist in the system.",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   notifyvroozi@gmail.com password:  Welcome1@ Preconditions: MAERSK FT should be enabled in the DB. Admin User should have logged into the Application. Steps to Reproduce: Access Company>Workflow>Approval Rules Section. Click to Upload Rule. Upload the attached file. (It contains Accounting data which is not available in the system) Please see the Rule is added successfully hence skipping the non existing accounting data. Actual result: Rule is being added skipping the Conditions which donot exist in the system. Expected Result: Error Report should be generated for Invalid Accounting Data and rule should not uploaded. Screenshot: Thanks, Asma",
        "status": "Released",
        "assignee": "Ahmed Habib",
        "created": "2024-06-06T00:35:40.115-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100189",
        "summary": "Apply to all- Manage Preset - System selects unit id Default Purchasing Organization on apply to manage Preset screen. ",
        "description": "server : stage credentials : Admin:   notifyvroozi14@gmail.com  / Welcome1 Employee:  javaid.sattar+emp24-5@vroozi.com  / Welcome1@ Pre-conditions: In Master data one purchasing organization should be selected as unitId default PO. Steps to Reproduce: Login with above requester user  Create catalog PR in draft. select all items and click on apply to all model.  go to manage preset screen. Actual Result: On Manage preset screen purchasing organization is auto selected. Expected Result: on line item model and on Apply to all manage preset screen should be blank no value should be preselected.",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-06-05T22:30:46.171-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100158",
        "summary": "Stage - Accounts Payable - Address Normalization Job needs to be fixed against Mongo Migration.",
        "description": "Steps to Reproduce: Please run the following job by accessing Rundeck>jobs. https://rundeck.vroozi.com/execution/show/235181#output Actual: it succeeds but shows not found errors and address is not normalized hence. Expected: Address should be normalized. Screen-shot: Thanks, Asma",
        "status": "Released",
        "assignee": "Jimena Pose",
        "created": "2024-06-04T12:20:54.977-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100140",
        "summary": "PMAN: On Stage unit ID 2, PR is not going to the Financial Approver although the data is correct.",
        "description": "Credentials for PMAN: Server: Stage Username:  notifyvroozi@gmail.com ,  iqtidar.arshad+employee@vroozi.com  / Welcome1! Pre Conditions: Financial and Sourcing Workflows should be configured. Spend limit financial workflow should be configured. Employee user limit should be defined and next approver should be configured in the employee user profile. Steps to Reproduce: Login from Employee user and create a PR having value more than the spend limit of employee.  Click on the “Approval Status” blue button on right top of PR. Actual Result: PR is getting auto approved. Expected Result: Sourcing and Financial Approvers should be displayed in the list of potential approvers. Screenshot:",
        "status": "Abandoned",
        "assignee": "Iqtidar Arshad",
        "created": "2024-06-04T01:36:18.029-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100129",
        "summary": "Stage - Accounts Payable - Keyboard shortcuts - Double Keyboard shortcut help dialog showing while creating invoice",
        "description": "url:   https://stage-purchase.vroozi.com username:  aqsa.rani+processor@vroozi.com password:  Qwerty@1 Steps to Reproduce: Click on create Invoice Press [shift+?] on keyboard Please see double dialog box showing Actual Result: Double dialogs showing for keyboard shortcut Expected Result: Only one dialog box should show Screenshots: Create Invoice screen: Closed first dialog: With an attachment: Closing first dialog:",
        "status": "Released",
        "assignee": "majid.akram",
        "created": "2024-06-04T00:02:03.035-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100128",
        "summary": "T&Cs - Buyer role new  user sub- permissions shouldn't be available, if new feature flag is OFF.",
        "description": "server : stage credentials :  notifyvroozi14@gmail.com  / Welcome1 Pre-conditions: Feature Toggle “ PURCHASE_TERMS_AND_CONDITIONS ” must be disabled for the unit Id. Steps to Reproduce: Login with above user  Navigate to Master data-> Users click on Create New user  Go to Vroozi Source and check buyer user role  Actual Result: New sub-Permissions related to T&Cs are displayed against buyer user role. Expected Result: New buyer user sub-Permissions related to T&Cs should be behind feature flag and should not be available if “ PURCHASE_TERMS_AND_CONDITIONS “ feature toggle is disabled.",
        "status": "Released",
        "assignee": "Sajid Akram",
        "created": "2024-06-04T00:01:02.006-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100102",
        "summary": "ASN Cancel Email - When a user cancel an ASN through cXML, the system doesn't generate an email",
        "description": "Issue: ASN Cancel Email - When a user cancel an ASN through cXML, the system doesn't generate an email Server:   Stage Pre-Condition: 1. Supplier Portal and ASN feature toggles are enabled in database 2. Create Purchase Request and Purchase Order 3. ASN has been created Step to Reproduce: 1. Send ASN cXML request for cancellation 2. Verify the emails Actual Result: The system doesn’t send email related to ASN cancellation Expected Result: The system should send an email about the ASN cancellation, as we do in the UI flow",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-06-03T03:13:48.841-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100100",
        "summary": "ASN Email - When a user creates an ASN with the full quantity through cXML, the system doesn't generate an email related to the PO status update to 'Shipped'",
        "description": "Issue: ASN Email - When a user creates an ASN with the full quantity through cXML, the system doesn't generate an email related to the PO status update to 'Shipped' Server:   Stage Pre-Condition: 1. Supplier Portal and ASN feature toggles are enabled in database 2. Create Purchase Request and Purchase Order Step to Reproduce: 1. Send ASN cXML request with full quantity 2. Verify the emails Actual Result: The system sends only email related to ASN submission and receiving but not PO status update Expected Result: The system should send an email to the Requester and Buyer about the PO status update, as we do in the UI flow",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-06-03T02:39:19.442-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100098",
        "summary": "Profile: Logout: Add one space between Profile, Logout and image ",
        "description": "Pre-Condition: Login with Admin Server:  Stage UnitId:  78 URL:  https://stage-purchase.vroozi.com/   Admin: Username:   notifyvroozi2@gmail.com Password:  Welcome1 Reported Steps: Login with Admin user Click on User Image No space between Profile and image No space between Logout and image See attached files Actual result: No space between Profile, Logout and image Expected Result: There should be space between Profile, Logout and Image button",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2024-06-03T01:10:34.974-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100085",
        "summary": "Regression Testing Platform Team RC-2024-5",
        "description": "RC Tickets:",
        "status": "Done",
        "assignee": "Abdullah iqbal",
        "created": "2024-06-02T22:43:20.739-0700",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-100060",
        "summary": "Stage- Accounts Payable - Submit Invoice - Dropdown does not show Exception Handling Groups in the Destination box",
        "description": "url:  https://stage-go.vroozi.com/#/login username:  aqsa.rani+processor@vroozi.com password:  Qwerty@1 Pre Condition: Send an invoice to through Inbox Must be assigned to AP processors Group Steps to Reproduce: Login through given user Assign Invoice to itself  e.g Invoice# 9000030089 Click to submit for Exception Handling Click on the the dropdown to see EH groups Actual Result: Please see EH groups are not showing Expected Result: User should be able to see the EH groups in the dropdown list Screenshot:",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-31T05:23:28.132-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-100022",
        "summary": "ACC VAL : PO OutPut Enhancement: System is showing approve Button as \"Validating Data\" till any Decision is pending on PO Enhancement open Dialogue. ",
        "description": "Environment:  Stage Unit ID 10 User:   masood.safi+employee+stage10@vroozi.com Password :  Welcome1! Pre Conditions: Login as admin, Enable following toggles: 1. Allow PR submission without supplier output method 2. Allow creation of auto-generated POs in the PENDING OUTPUT state Disable BuyRoute Login as employee, generate  over-sourcing PR , associate  supplier that have any output method  provided and submit the PR Steps to Reproduce: Create a PR Our Sourcing approver. Login with Sourcing approver EDIT the PR and  change Supplier having no output  Method associated with supplier. Save the changes and click on Done. Now Click on approve button. Actual Result: Approve Button changed to  “Validating data”  whereas accounting strings are valid ( See screenshot). Its keep on Showing as unless User does not choose any option on open Dialogue having option to Create PO in Ordered State OR Create PO in Pending OutPut state. Expected Results: Upon Clicking Approve Button Caption of Button should not be shown as  “Validating data” Testcase Link: • https://vroozi.testrail.net/index.php?/cases/view/6955815",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-05-30T07:31:46.153-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99977",
        "summary": "Stage - Accounts Payable - Inbox - Viewing a Hopper Email shows error in Console.",
        "description": "url:  https://stage-go.vroozi.com/#/login username:  asma.latif+APM@vroozi.com password:  Blueangel1! / Blueangel1@ Pre requisite: OCR Feature Toggle should be switched ON. OCR PDF should have been sent at the hopper email address. AP User should have logged into the PMAN Application.  Steps to Reproduce: Access Inbox > Document Inbox. Select the OCR Email. Please see Error in Console. Actual Result: Error shows in Console while viewing a hopper email. Expected Result: No Error should generate in Console. Screenshots: Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-29T22:51:07.379-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99920",
        "summary": "PMAN- In document settings when we add custom fields  in PO change request settings to edit custom fields on CR screen. system display N/A against selected CF when we navigate back to document setting screen.",
        "description": "Server: URL:  stage-go.vroozi.com Username:  notifyvroozi14@gmail.com   Password: Welcome1 Pre-Condition: Step to Reproduce: Login with above user. navigate to Document → Settings → Purchase Orders select custom fields  Go to some other page. Actual Result : When user navigate back to document settings purchase order screen then system is displaying N/A in selected CF  value. Expected Result : CF value should be displayed.",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-05-28T23:35:09.668-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99910",
        "summary": "PMAN: Label missing for Line Item field configuration.",
        "description": "Environment:  Stage Unit ID 2 User:  notifyvroozi@gmail.com Pre Conditions: Above mentioned user is logged into PMAN application.   Steps to Reproduce: Navigate to Documents → Settings → All Documents. Scroll down to “Line Item Field Configuration” section and notice that label is missing for the last option of General Information section. Actual Result: Label is missing for the newly added option under General Information section of Line Item Field configuration. Expected Results: Label should be displayed or this newly added option should be removed. Screenshot:",
        "status": "Released",
        "assignee": "Ahmer Ijaz",
        "created": "2024-05-28T06:02:49.740-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99884",
        "summary": "AccVal: After validation compeletes if user closes PO enhancement modal system gives error",
        "description": "Server stage unit id 10 Steps to Reproduce: login from buyer Create PO having supplier without output method Submit PO  After validation process Verify PO enhancement modal display Click on x icon on the modal Expected Result: System will close the PO enhancement modal and let the user back to PO screen Actual Result: System is giving error while closing the modal",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-05-28T01:07:05.029-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99862",
        "summary": "Regression Testing purchase Team RC-2024-5",
        "description": "RC Tickets:  Test Cases Status: https://vroozi.testrail.net/index.php?/milestones/view/935",
        "status": "Done",
        "assignee": "Ayesha Waseem",
        "created": "2024-05-27T04:38:43.849-0700",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-99849",
        "summary": "Stage - PMAN - Approver User Profile - Success Noty shows even nothing is updated against the Alternate Approver field.",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   aqsa.rani+approver@vroozi.com password:  Qwerty@1 Preconditions: Approver User should have logged int the Application with No Alternate Approver User selected against it. OoO FT should be enabled via Admin>Company>Workflow>Request/Financial & Invoice Approval WF Section. Steps to Reproduce: Access Profile of the Approver User. Alternate Approver field shows at the right side. Drag open it and close by moving the focus somewhere else on the screen. Please see success noty shows “Alternative Approver updated successfully“. Actual result: Success Noty shows even nothing is updated Expected Result: Noty shouldn’t show until a change is made. Screen-Cast: Screenshot: Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-27T02:46:38.200-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99836",
        "summary": "Regression Testing Integration Team RC-2024-5",
        "description": "RC progress by Team member and Issue status: https://smartoci.atlassian.net/jira/dashboards/11576   RC Tickets:  Test Cases Status: https://vroozi.testrail.net/index.php?/milestones/view/936 Regressions Areas Testing",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-26T23:56:15.698-0700",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-99768",
        "summary": "On draft state PR submit button is display instead of approval status",
        "description": "Server devqa2 Steps to Reproduce: From admin enable financial workflow From employee create PR  Verify approval status button Expected Result: Approval status button should be displayed on PR to verify approval details Actual Result: Approve button displaying instead of approval status",
        "status": "Resolved",
        "assignee": "Abdullah iqbal",
        "created": "2024-05-23T01:12:06.054-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99704",
        "summary": "AccVal: System giving error when financial approver try to edit PR having ACV errors",
        "description": "Server devqa2 Steps to Reproduce: Login from employee create PR and submit it to financial approval From admin, deactivate the string used in that PR Login from financial approval open the PR and click approve System will display error message on PR  Click on edit button Expected Result: System will open edit PR screen Actual Result: System giving error when clicking on edit button Concern: Same issue is reproducing from sourcing approver side",
        "status": "Resolved",
        "assignee": "Sahar Habiba",
        "created": "2024-05-22T04:12:08.283-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99683",
        "summary": "Devqa5 - PMAN - Master Data - Users - Alternate Approver/Buyer/Sourcing Approver Settings - User is able to set itself as an Alternate Approver/Buyer/Sourcing Approver ",
        "description": "url:   https://devqa5-go.vroozi.com/#/login username:   aqsa.rani+admin+devqa5@vroozi.com password:  Qwerty@1 Steps to Reproduce: Login through given user Navigate to Master Data → Users  Search for any Approver/Buyer/Sourcing Approver Go to Approver settings in user modal Click on Alternate Approver/Buyer/Sourcing Approver to see the dropdown options Please see user can set itself as Alternate Approver/Buyer/Sourcing Approver Actual result: Approver/Buyer/Sourcing Approver is able to set itself as Alternate Approver/Buyer/Sourcing Approver Expected Result: User should not see itself in dropdown list and should not able to set itself  Screen Recording: Issue # 2 :  User is able to set same user as Next approver and Alternate Approver when enhanced workflow is off",
        "status": "Resolved",
        "assignee": "Aqsa Rani",
        "created": "2024-05-22T00:27:39.303-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99637",
        "summary": "DEVQA5 - Integration - PMAN - Master Data - Users - Create a New User - Delegation Tab - OoO toggle shows auto enabled.",
        "description": "url:   https://devqa5-go.vroozi.com/#/login username:   notifyvroozi83@gmail.com password:  Payable001@ Steps to Reproduce: Login through given user. Navigate to Master Data → Users → Create new user Add required fields and select an Approver Role. Click the Delegation Tab, its enabled. Please see it has OoO Toggle showing enabled by default. Actual Result: OoO Toggle is showing ON by default. Expected Result: It should be Off by default. ScreenCast:",
        "status": "Resolved",
        "assignee": "Asma Latif",
        "created": "2024-05-20T23:49:45.194-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99602",
        "summary": "Integration - PMAN - Master Data - Create New User - Save Button is enabled but not working while creating new user",
        "description": "url:   https://devqa5-go.vroozi.com/#/login username:   aqsa.rani+admin+devqa5@vroozi.com password:  Qwerty@1 Steps to Reproduce: Login through given user Navigate to Master Data → Users → Create new user Add required fields and select any single role Click on the save user button Please see that “Save user” is not working  Actual Result: Save button is enabled but not working Expected Result: Save button should be working and user should be created Screenshot:",
        "status": "Resolved",
        "assignee": "Aqsa Rani",
        "created": "2024-05-20T05:57:01.718-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99578",
        "summary": "PROD PMAN: Bulk Upload Line Item - Data Error: Cannot invoke \"String.equals(Object)\" appears when uploading the attached Bulk upload file from Upload Line Items on PR.",
        "description": "Environment:  Devqa21 unitId 2 / Stage UnitId: 2 User:   iqtidar.arshad+employee2_devqa21@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Turn  “OFF”  the toggle “ Dictate Accounting Via Company Code ” from Master Data → Organization. In User Profile set Employee user Company Code to “CC MIA 015 - Iqtidar Company 015” and Cost Center to “CC_MIA_015 - CC MIA Iqtidar 015“. Restrict the user access in User profile. Steps to Reproduce: Navigate to Create → Non Catalog Request. Click “Upload Line Item(s)” button. Select the attached bulk upload file and click “Create Purchase Request” button. Actual Result: Error appears over line item grid, “Data Error: Cannot invoke \"String.equals(Object)\" because the return value of \"com.vroozi.api.requests.model.DataError.getCode()\" is null”. Expected Results: PR line items should be successfully uploaded having no errors. Screenshot:",
        "status": "Released",
        "assignee": "Iqtidar Arshad",
        "created": "2024-05-17T05:05:52.151-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99512",
        "summary": "PMAN: Financial Approver - Accounting Validation should run before Financial Approver can Add Approval Notes.",
        "description": "Business Case: The system should run accounting validation before financial approver can “Add Approval Notes” when they click to Approve button. When a Financial Approver open a PR/CR document and click Approve button: Existing Implementation: When Financial Approver clicks the Approve button on PR/CR document, “Add Approval Notes” modal is displayed. User adds (optional) note and clicks Approve button, “Add Approval Notes” modal is closed and Approve button changes its label to “Validating Data”. Once the accounting validation is successful, the user is redirected to “Approve Purchase Requests” grid. Alternate flow if the accounting validation fails, “View Error” label is displayed on the Approve button. On clicking “View Error” button, screen focus moves to top of the line item grid where errors are displayed. General Rule for Running the Accounting Validation at Document Approval: Currently, the system is executing accounting validation after Financial Approver Add Approval Notes and click Approve button. After this change, the system will run accounting validation before the “Add Approval Notes” modal is displayed. Impacted Users: All the mentioned above requirements should be implemented for the following users who can take action on the PR/CR: Financial Approver Financial+Sourcing Approver Note: Refer to   for similar changes requested.",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-05-15T23:37:59.718-0700",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-99477",
        "summary": "PMAN- Bulk upload: In bulk upload error report error message is broken when company code restriction is applied on requester.",
        "description": "nvironment : devqa6 url:  https://devqa6-go.vroozi.com/#/login username:  notifyvroozi@gmail.com Password: Welcome1 username:  javaid.sattar+Pmemployee@vroozi.com Password: Welcome1@ Pre-conditions: Company code (A) restriction is applied on user.  Steps to Reproduce: Login to PMAN with above employee user. click on bulk upload request.  select file having company code (  B ) information with all valid combination.  Upload file. file should uploaded successfully.  Click on error report to generate error reports.  Actual Result: Error message related to GL is broken in error report.  Expected Result: Correct error message should be displayed . error message should be as  “Line Item 1: The specified GL Account [356_GL] is not associated with user.“",
        "status": "Resolved",
        "assignee": "Javaid Sattar",
        "created": "2024-05-15T03:01:45.394-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99427",
        "summary": "PMAN: Bulk Upload || Location is not being picked from User Profile , if not provided in BULK upload file.",
        "description": "Environment:  Devqa2 unitId 2 User:   masood.safi+employee1@vroozi.com  / Welcome1! Pre Conditions: Company code, Cost Centre, Location is set as default in user Profile. Above mentioned user is logged into PMAN application. Steps to Reproduce: Create a file having no Accounting objects value provided. Navigate to Create → Bulk Upload Request. OR: Open a Draft PR. Click on the button “Upload Line Item(s)”.   Select a bulk upload file and click “Create Purchase Request” button. File is being uploaded. Actual Result: File is being uploaded but no Location value is picked from user Profile. Expected Results: File uploaded/Processed should be successful and Company, Cost Centre, Location should be picked from user profile.",
        "status": "Resolved",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-05-14T03:49:34.210-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99421",
        "summary": "PMAN-Bulk File Upload || Split line item upload via upload file is not working",
        "description": "Environment:  Devqa2 unitId 2 User:   masood.safi+employee@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Steps to Reproduce: Create a file having split line item available. Navigate to Create → Bulk Upload Request. OR: Open a Draft PR. Click on the button “Upload Line Item(s)”. Select a bulk upload file and click “Create Purchase Request” button. File is being uploaded but no split has been shown on UI. Actual Result: File is being uploaded but no split has been shown on UI. Expected Results: File uploaded/Processed should be successful and Split should be available as mentioned in File.",
        "status": "Resolved",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-05-14T02:24:22.932-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99420",
        "summary": "PMAN: Cost Center, GL and Location Type are not picked when Dictate Accounting Via Company Code toggle is set to On.",
        "description": "Environment:  Devqa21 unitId 2 User:   iqtidar.arshad+employee_devqa21@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Turn On the toggle “ Dictate Accounting Via Company Code ” from Master Data → Organization. Steps to Reproduce: Navigate to Create → Bulk Upload Request. Select a bulk upload file and click “Create Purchase Request” button. OR: Open a Draft PR. Click on the button “Upload Line Item(s)”. Actual Result: Error appears that Cost Center, GL and Location Type is missing. Although the valid values for these fields exist in the BOM file. Expected Results: PR line items should be successfully uploaded having no errors. Screenshot:",
        "status": "Resolved",
        "assignee": "Iqtidar Arshad",
        "created": "2024-05-14T02:17:55.433-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99402",
        "summary": "PMAN: Company Code and Cost Center are not picked when Dictate Accounting Via Company Code toggle is set to Off.",
        "description": "Environment:  Devqa21 unitId 2 User:   iqtidar.arshad+employee_devqa21@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Turn Off the toggle “ Dictate Accounting Via Company Code ” from Master Data → Organization. Steps to Reproduce: Navigate to Create → Bulk Upload Request. Select a bulk upload file and click “Create Purchase Request” button. OR: Open a Draft PR. Click on the button “Upload Line Item(s)”. Actual Result: Error appears that company code is not valid. Expected Results: PR line items should be successfully uploaded having company code. Screenshots of missing modal:",
        "status": "Resolved",
        "assignee": "Iqtidar Arshad",
        "created": "2024-05-13T06:29:33.746-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99351",
        "summary": "Stage - MAERSK - PMAN - Admin - Company - Workflow - Approval Rule - PORG Value goes missing from the Approval Rule if its Deleted or Deactivated.",
        "description": "URL: https://stage-purchase.vroozi.com Username:  notifyvroozi@gmail.com Password: Welcome1@ PreCondition: User should be logged into Application as Admin. Access Company>Workflow>Approval Rule Grid. Steps: Add An Approval Rule with PORG Accounting Element and save it. Access Master Data>Organisation Page. Select the same PORG from its grid. Deactivate or Delete it. Access the same Approval rule via Company>Workflow>Approval Rule Grid. Please see PORG value field is empty. Actual Results: PORG Value goes missing from the Approval Rule if its Deleted or Deactivated. Expected Results: Value shouldn’t go missing and should show intact. ScreenCast: Thanks, Asma",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-05-10T04:11:41.888-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99340",
        "summary": "PMAN: Errors and File uploading modal not displayed for Bulk uploading.",
        "description": "Environment:  Devqa2 unitId 2 User:   iqtidar.arshad+employee_devqa2@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Steps to Reproduce: Navigate to Create → Bulk Upload Request. Select a bulk upload file and click “Create Purchase Request” button. OR: Open a Draft PR. Click on the button “Upload Line Item(s)”. Actual Result: File uploaded/Processed modal does not appear. Expected Results: File uploaded/Processed modal should appear. Screenshots of missing modal:",
        "status": "Resolved",
        "assignee": "Iqtidar Arshad",
        "created": "2024-05-10T01:19:37.333-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99202",
        "summary": "AccVal: Issues related to VZI-96829",
        "description": "Server devqa2 Issue 1: Error message on line item modal says  split 1  when there is no split is used Steps to Reproduce: Login from employee, create PR Add line item and on line item modal provide invalid sting data Verify the error message  Expected Result: System will display error message as Actual Result: System displaying message as  however there is no split used Issue No.2 When location is marked as required from db configs system still consider it as optional and run validation when other required values are provided Steps to Reproduce: From DB configs mark location required with other ACV fields Login from employee create PR Add line item provide invalid string verify without providing location system still run validation on PR Expected Result: System will not run validation until all the required fields are given Actual Result: System runs validation without getting location field also that validation gives wrong result as user provided invalid string still it says validation passed Issue No.3 ACV validation on line item modal are not running on Central receiver role Steps to Reproduce: Login from central receiver  Open PO and run POCR on it Edit/Add line item on POCR screen and on line item modal provide invalid string Verify system validation on line item modal Expected Result: System will run validation on POCR line item modal Actual Result: System is not running validation for central receiver on line item modal",
        "status": "Resolved",
        "assignee": "Sahar Habiba",
        "created": "2024-05-08T00:20:22.244-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99195",
        "summary": "Smart Chat: BOM upload is currently not being displayed; enabling overlays upload indicator",
        "description": "Environment Devqa15. User:  notifyvroozi@gmail.com  / Welcome1 Start BOM Upload via Create → Bulk Upload Request After enabling it: Unrelated issue - happens also for ASN:",
        "status": "Released",
        "assignee": "Shujaat Rahim",
        "created": "2024-05-07T20:48:26.219-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99191",
        "summary": "Review method parseAddressByText which is throwing errors in prod",
        "description": "parseAddressByText is throwing repeated errors (See attached file)",
        "status": "Released",
        "assignee": "Jimena Pose",
        "created": "2024-05-07T11:41:17.710-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99187",
        "summary": "Delete collection invoice_revision_history",
        "description": "Collection invoice_revision_history was migrated to accounts_payable_revision_history. Given the importance of this data we decided to keep invoice_revision_history in the DB till we were sure that the changes were working properly on prod. Now we are able to delete it, given that the changes are working properly and we don’t need this data any more. Note to QA We would only need to test a happy path, of an invoice being posted and all it’s history being logged properly. (Any kind of invoice is fine). Please make sure the script is executed before you test, I executed it on devqa5 and devqa26. We will execute the script on the rest of the servers once we confirm everything is working as expected.",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-07T09:51:57.775-0700",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-99184",
        "summary": "Acc Val : In case only one split item exists in line item modal and ASV error displayed Split # should not be mentioned in error message. ",
        "description": "Server Devqa2 Steps to Reproduce: Login with employee user Create new PR, add new line Item Give all mandatory data in line item  While Choose Accounting objects Select Combination which does not exists in system or deactivated  Expected Result: System should not show Split # in ASV error message as its only one Split available, Split # should be displayed in case of more then one Splits available  Actual Result: System Showing Split # with single Split line item as well. see screenshot",
        "status": "Resolved",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-05-07T08:06:14.631-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99183",
        "summary": "Acc Val : Accounting string validation failed to pick defined Accounting String in Master Data with only Company object as Mandatory",
        "description": "scription Server Devqa2 Steps to Reproduce: Open Accounting Configuration from DB Make only Company, as mandatory GL,COST CENTER and LOCATION all as optional Clear cache of server and accounting Services Go to admin, All documents Line item Configuration Leave set GL Account, Cost Centre, Location as optional Go to Master data -->Accounting Strings Define New Accounting Combo having Company Code only. Create New PR on line item Modal select Company code value as defined in above step. Validation success message will appear now save line item and Submit the PR. Expected Result: System should allow to submit PR as Accounting combo is defined with company only as mandatory. Actual Result: System is not allowing to submitting PR and showing message Accounting String Not defined. see screenshot",
        "status": "Resolved",
        "assignee": "Ahmer Ijaz",
        "created": "2024-05-07T07:53:54.498-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99182",
        "summary": "Acc Val : Unexpected error displayed on Accounting Strings Screen once Company code is Set as mandatory in Config DB",
        "description": "Katalon Manual Tests (BETA) Description Server Devqa2 Steps to Reproduce: Open Accounting Configuration from DB Make Company, as mandatory GL,COST CENTER and LOCATION all as optional Clear cache of server and accounting Services Go to admin, All documents Line item Configuration Leave set GL Account, Cost Centre, Location   as optional  Go to Master data -->Accounting Strings Add New Accounting Combo choosing company code as accounting string object and click on save.  Expected Result: System should allow to save Accounting Combo as per DB configuration Actual Result: System is not allowing to save accounting combos , showing error on screen. see screenshot",
        "status": "Resolved",
        "assignee": "qasim.riaz",
        "created": "2024-05-07T07:11:34.038-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99162",
        "summary": "PMAN- The user is unable to edit or create new GL accounts in the system. An exception was logged in the console.",
        "description": "Server : devqa6 Credentials : Admin :  notifyvroozi@gmail.com  / Welcome1 Employee :  javaid.sattar+20emp@vroozi.com  / Welcome1@ Pre-req: GL should already created  in system. Steps to reproduce: Login into the PMan using given credentials Navigate to Master data → Accounting  Click on any GL to open it in edit mode. exception is logged  now click on create new Gl button to create new GL. exception logged and system do nothing. Actual Result : The user is unable to edit or create new GL accounts in the system. An exception was logged in the console. Expected : User should be able to edit or create new GL accounts in system.",
        "status": "Resolved",
        "assignee": "Ghulam Mustafa",
        "created": "2024-05-07T01:16:17.328-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99160",
        "summary": "AccVal: When user update only one error message that is on PR system updates all other messages as well",
        "description": "Server devqa2 Steps to Reproduce: Login from employee Create PR having  multiple line items using different ACV stings From admin deactivate those strings Click on submit button System gives error message Select any line item and use valid sting and click save Verify messages on PR Expected Result: System only update that line item message Actual Result: System updates all the messages of line items that aren’t fixed",
        "status": "Resolved",
        "assignee": "Sahar Habiba",
        "created": "2024-05-07T01:01:11.108-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99159",
        "summary": "PMAN - Acc Val : Unable to EDIT or Create accounting combo once GL is removed from DB config and set as optional on admin Line item configuration",
        "description": "Server Devqa2 Steps to Reproduce: Open Accounting Configuration from DB Make Company, Cost Centre as mandatory location as optional with no GL account  Clear cache of server and accounting Services Go to admin, All documents Line item Configuration Leave GL Account as optional and Company , Cost Centre as mandatory Go to Master data -->Accounting Strings Open any existing string or Add any New Accounting Combo and save Expected Result: System should allow to save Accounting Combo Actual Result: System is not allowing to save  accounting combos , showing GL Account ref Could not be null.",
        "status": "Resolved",
        "assignee": "Masood Safi",
        "created": "2024-05-07T01:00:25.905-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-99139",
        "summary": "Smart Chat: Chat Bot Icon is partially hidden by the side panel for certain mobile resolutions",
        "description": "Environment Devqa15. User:  notifyvroozi@gmail.com  / Welcome1 Navigate to the PO: Example PO #  2000002632 Actual Result: Chat bot icon is hidden partially by the side panel Expected Result:  Needs to be decided",
        "status": "Released",
        "assignee": "Shujaat Rahim",
        "created": "2024-05-06T21:30:50.780-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99138",
        "summary": "Smart Chat: Chat Bot Icon is hidden by PO actions button",
        "description": "Environment Devqa15. User:  notifyvroozi@gmail.com  / Welcome1 Navigate to PO in Ordered Status:: Example PO #  2000003198 Navigate to PO in Invoiced Status:: Example PO #  2000003198 Expected Result: Needs to be decided",
        "status": "Released",
        "assignee": "Shujaat Rahim",
        "created": "2024-05-06T21:26:44.064-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-99096",
        "summary": "Apply to All- Purchasing Organisation is not being retrieved when Preset is saved with only Purchasing Organisation ",
        "description": "Server : Production Credentials :  ayesha.waseem+prod+emp@vroozi.com  / Welcome1@ Steps to Reproduce: Login with above employee credentials Open a draft PR Select a line item and click on Apply to All button Click on Manage Preset tab Search a Purchasing Org and save the Pre-set Now re-open the Apply to All modal Select the Preset Actual : Purchasing Org value saved is not being populated Expected : Purchasing Org value saved in preset should be populated",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-05-03T04:19:40.327-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98955",
        "summary": "The requester (with an admin role) is able to see the Accept/Reject button after submitting resolutions during exception handling.",
        "description": "Issue : The requester (with an admin role) is able to see the Accept/Reject button after submitting resolutions during exception handling. Investigation results :      The reason why the requester (Collin) in the above VZI was able to see the invoice in his queue for accepting/rejecting the resolution was that the system assigned this admin user as the processor for this invoice. This occurs for invoices that are created by the system, such as through cXML or OCR. Solution : If the invoice is automatically created by the system using cXML or OCR, then the system should check - Are there any WF matches? If yes, then use that WF group. If no, then use the AP Processor / Manager group. FYI -   /   /   /   /",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-26T12:45:51.680-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98912",
        "summary": "PROD - MAERSK - PMAN - Company - Worflow - Add Approval Rule - Conditions - Need to show full pill information or a tooltip for the values in the multi select drop down.",
        "description": "url:  https://stage-go.vroozi.com/#/login username:   notifyvroozi@gmail.com password:  Qwerty@1 Steps to Preproduce: Access Company-> Workflow-> Approval Rules Grid. Click to Add Approval Rule. Click + to Add Condition/s Select for instance Company Code. Add multiple company codes with lengthy names. Please see these aren’t fully readable. Actual Result: The values can’t be read fully. Expected Result: Need to show full pill information or a tooltip for the values in the multi select drop down. Screenshot: Thanks, Asma Dev Notes The issue should be resolved for all Angular multiselect controls in PMAN. Ideally, the resolution should enable the control to fully utilize the width of the container when necessary, but refrain from doing so when the text is short. Moreover, the optimal solution would increase the height to allow text to wrap into a new line. Using a tooltip as a solution should be a last resort if we need to show an ellipsis",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-25T11:37:20.382-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98836",
        "summary": "PROD - Accounts Payable - Create Invoice/Memo - Apply to ALL Modal - Both Tabs have its Account Category showing couple of Empty Indexes.",
        "description": "url:  https://go.vroozi.com/#/login username:  asma.latif+APM@vroozi.com password:  Redangel1! Pre requisite: AP User should have logged into the PMAN Application.  Steps to Reproduce: Click to Create Invoice.  Invoice Screen shows. 9000009392 Add a couple of Items and select them. Click to Apply to ALL Button. Apply to ALL Modal shows. Drag open the  Account Category  field. Please see two empty indexes in it. Actual Result: Account Category is showing couple of Empty Indexes. Expected Result: These should be removed (only one empty index should be displayed) Screenshots: Thanks, Asma",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-24T10:31:56.088-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98835",
        "summary": "PROD - Accounts Payable - OCR Invoice - OCR icons go missing when Invoice is viewed.",
        "description": "url:  https://go.vroozi.com/#/login username:  asma.latif+APM@vroozi.com password:  Redangel1! Pre requisite: OCR Feature Toggle should be switched ON. OCR PDF should have been sent at the hopper email address. AP User should have logged into the PMAN Application.  Steps to Reproduce: Access Inbox > Document Inbox. Select the OCR Email and Click to Create Invoice.  Invoice is created successfully. 9000009392 Ensure the OCR Icons against the Header fields are available. View this Invoice. Please see OCR Icons are now missing. Actual Result: OCR icons go missing when Invoice is viewed. Expected Result: OCR Icons should be displayed against the relevant fields correctly. Screenshots: Thanks, Asma",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-24T10:30:36.393-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98810",
        "summary": "PROD: Acc Val : System is not executing Accounting Validation while doing Copy PR line item , once Sourcing/Financial approver Rejects the PR and Requestor is resubmitting",
        "description": "Issue identified on Stage while Testing Copy Line Item” Server Stage  Unit ID  10 Credentials :  Admin :  notifyvroozi10@gmail.com  , Welcome1 Requestor :  Masood.safi+employee+Stage10@vroozi.com  , Welcome1! Sourcing Approver :  Masood.safi+sourcing+Stage10@vroozi.com ,Welcome1! Steps to Reproduce: Login from admin, deactivate accounting string Login from employee create PR over sourcing Review. Edit PR with sourcing approver and change Accounting string as invalid/doesn’t exist. Copy Line Item should display appropriate error message above line items. Reject the PR from Sourcing Approver Login again to Requestor (who submitted the PR) Add or Change line item to PR using the deactivate accounting string Copy the line item having deactivated accounting string attached. Expected Result System should display correct warning message on copied and source Line item Actual Result: System does not show any validation Message while Copying PR line Item. Note:   Same Scenario is working for BUDGET approval Workflow i.e even rejected by Budget approver once Requestor is re-submitting the rejected PR and provide invalid Accounting string and copy it, Accounting Validation runs and display error message as expected . Note:  As Copy Line item Change is not yet rolled out to Production, Issue persist on Production with Submit button action as well. As Issue on staging identified testing copy Line Item functionality is not cause of following production issue , its glitch in system already exists and missed in this edge case. Server Production  Unit ID  2 Credentials :  Admin :  qa.admin@vroozi.com  , @Welcome299 Requestor :  masood.safi+employee+Production@vroozi.com  , Welcome1! Sourcing Approver :  masood.safi+sourcing+prod@vroozi.com ,Welcome1! Steps to Reproduce: Login from admin, deactivate accounting string Login from employee create PR over sourcing Review. Edit PR with sourcing approver and change Accounting string as invalid/doesn’t exist. Reject the PR from Sourcing Approver Login again to Requestor (who submitted the PR) Add or Change line item to PR using the deactivate accounting string Click on Submit Button. Expected Result System should display correct warning message on  Line items having deactivated accounting strings Actual Result: System does not show any warning Message while Copying PR line Item.",
        "status": "Released",
        "assignee": "Masood Safi",
        "created": "2024-04-24T03:00:53.955-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98751",
        "summary": "Budget - When a user cancels the Purchase Order, the system does not release the Budget amount",
        "description": "Issue: Budget - When a user cancels the Purchase Order, the system does not release the Budget amount Server: URL:  https://stage.vroozi.com/#/login Username:  zulkiful.bajwa+StageEmployeeUnitId100@vroozi.com Password: @Welcome1 Pre-Condition: 1. Budget has been created 2. Purchase Request (1000001156) has been created & submitted against which Purchase Order (2000003999) has been generated 3. Make sure above Budget has been selected on the Purchase Request Step to Reproduce: 1. Login to PMAN as an Employee user 2. Load above Purchase Order (2000003999) and cancel that Purchase Order 3. Create a new Purchase Request (1000001157) by adding item in which make sure above Budget has been selected 4. Verify the budget information on the Purchase Request (1000001157) header level Actual Result: The system doesn’t release the amount of the canceled Purchase Order, and it still shows that amount as consumed on new transactional document Expected Result: If a Purchase Order has been canceled, the budget amount should be released and made available for consumption by another transactional document",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-04-23T10:31:09.036-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98591",
        "summary": "PROD- Accounts Payable - Approval Rules Grid- Search Filter container floating issue.",
        "description": "url:   https://devqa5-go.vroozi.com/#/login username:   aqsa.rani+admin83@vroozi.com password:  Qwerty@1 Steps to Reproduce: Login through given credentials Navigate to Company->Workflow->Approval Rules In search bar apply Purchasing Organization/Class filter Enter Value for Purchasing Organization e.g ACSV. Search results are filtered. Click the Filter Name like 'Purchasing Organization' please see the filter data container has positioned to the left corner. Scroll up or down , the data container, moves along. Actual result: Search Filter container floating issue. Expected Result: Filter data container should remain intact. Screenshot: Thanks, Asma",
        "status": "Abandoned",
        "assignee": "Adnan Khalid Shah",
        "created": "2024-04-19T14:09:01.000-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98554",
        "summary": "Invoice line item search is not case insensitive while using the magnifying glass.",
        "description": "Issue : Invoice line item search is not case insensitive while using the magnifying glass. Normal view : Exact match : Case Insensitive : Expected Result : User should be able search for a line item by using case insensitive letters. Actual Result : Users are not able to search for a line item by using case insensitive letters.",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-18T20:14:19.310-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98553",
        "summary": "Apply to all throws error message when no company code for Non-PO Invoice.",
        "description": "UpperCrust When manually entering an invoice from the inbox we are experiencing an issue with the apply to all button. After selecting all line items, then selecting apply to all - I enter the appropriate information, once we select \"Apply Changes\" we get an instant failure error message.  I have found as a work around that I can edit the line item 1 information and then come back out and use the apply to all button correctly, but there seems to be a bug here. I have attached three screenshots of the issue. Screen recording of Apply All Failure with Brent’s steps to reproduce issue   Attachments Screenshot 2024-03-21 123857.png Screenshot 2024-03-21 124005.png Screenshot 2024-03-21 123944.png Please see Zendesk Support tab for further comments and attachments.",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-04-18T19:59:40.031-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98552",
        "summary": "Show all line item (6 or more lines) resets after making an update on a line item.",
        "description": "Uppercrust Client is requesting a way to have \"Show All\" lines be the default for their Invoice Screen OR having \"Show All\" lines stay active after editing a line that is not in the first 5 line.  Attached is an dropbox recording of Teresa explaining and showing what she is requesting.  https://capture.dropbox.com/aQLp3A180JW0ZX6G Please see Zendesk Support tab for further comments and attachments.",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-04-18T19:56:27.225-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-98502",
        "summary": "AccVal: Error message is not getting properly changed when user changes any accounting details",
        "description": "Server Devqa2 User Creds sahar.habiba+employee2@vroozi.com Ssahar@600 Steps to Reproduce: Login from employee  Create PR add line item  On line item use any string information that is deactivated Now provide location to make the error message as invalid string Verify system will update the message accordingly Expected Result: System will update the error message according to the provided information Actual Result: When user gives location system does not update the error message and when user try to change the string it also gives wrong error message Issue No.2 Sourcing approver side error messages are not displaying right Steps to Reproduce: Login from sourcing approver  Open PR and click on edit button  On PR add line item having splits Provide company code only and let the remaining splits info empty Verify the error message Expected Result: System should display error message for both splits Actual Result: System doesn't display error message for 2nd split screenshot is from employee user which shows correct information Issue No. 3: When there are error message on splits and user select none for split selection system still display error message for split that are already removed Steps to Reproduce: Login from sourcing approver  Open PR and click on edit button  On PR add line item having splits On 2nd and 3rd splits provide invalid accounting string info  System will give error message  Now from  Split Account Assignment  select none Verify error messages stop displaying  Expected Result: As splits are removed error message also get remove Actual Result: System is still displaying error messages on line item modal Issue No. 4: Error messages sorting issue Steps to Reproduce: Login from sourcing approver  Open PR and click on edit button  On PR add line item having splits On both splits provide invalid  different strings Verify split 1 issue comes on top and then 2nd split issue following the sequence  Expected Result: Issues should display in sequence just as they come on PR Actual Result: System displaying split 2 issue first then 1  On PR On PO",
        "status": "Resolved",
        "assignee": "Sahar Habiba",
        "created": "2024-04-18T00:31:23.491-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-98479",
        "summary": "AccVal: When cost Object is mark as required system stops giving error on line item modal",
        "description": "Server Devqa2 Steps to Reproduce: From DB configs make cost object as required Now create PR add line item in it Use invalid string on line item modal and verify system gives error Expected Result: Systemm gives error on line item Actual Result: System is not giving error on line item modal",
        "status": "Resolved",
        "assignee": "Zeenat Zahra",
        "created": "2024-04-17T23:01:13.111-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-98472",
        "summary": "AccVal: When user provide location in split and  make invalid string system does not give any error for invalid ACV used in split ",
        "description": "Server Devqa2 Steps to Reproduce: Login as employee create PR Add line item on PR having splits For split 1 provide valid string For split 2 provide invalid string by giving location  Verify system will  display any error message Expected Result: System will display error message for split 2 Actual Result: System is not displaying error message for split 2 before saving line item and once user click submit button error message comes Issue No 2: When there is invalid string used in split system does not let the user to copy that line item  Steps to Reproduce: Login as employee create PR Add line item on PR having splits For split 1 provide valid string For split 2 provide invalid string by giving location  Save line item and submit PR System will error message now try to copy the same line item Expected Result: System will let the user to copy the PR Expected Result: System is not letting the user to copy the PR having issues",
        "status": "Resolved",
        "assignee": "Sahar Habiba",
        "created": "2024-04-17T22:38:53.002-0700",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-98202",
        "summary": "JP Translation: PO closing notification email",
        "description": "Update Japanese translations for the following English texts on the PO Closing notification email - Original English Revised Japanese Translation System unable to close Purchase Order  {PO} 発注書 {PO} をクローズできません User who attempted to close PO 発注書をクローズしようとしたユーザー {USERNAME}  (Accounts Payable) {USERNAME} （支払担当者） Why PO could not be closed? 発注書をクローズできない理由 Discrepancy between received and invoiced quantities/amounts 受領と請求における数量/金額の差異 Reason 原因 No Additional invoices will be submitted for this PO この発注書に対し、追加の請求書は提出されません。 Supplier サプライヤー Please execute the following actions to close the PO for invoicing: 次の手順に従い、発注書をクローズし、請求に進んでください。 Close the PO for receiving. The PO should transition to 'Invoiced' status. 受領を完了し、発注書をクローズします。発注書を「請求済み」に変更します。 If you're having difficulties closing this PO or if you have questions, please contact  {USERNAME}  or your Accounts payable team この発注書をクローズできない場合や、不明点がある場合は、 {USERNAME}   または支払処理チームにお問い合わせください。 View Purchase Order 発注書を表示 Close the PO for receiving. 発注書の受領をクローズ Finally, close the PO for invoicing. 発注書をクローズして請求書を発行 If you're having difficulties closing this PO or if you have questions, please contact your Accounts Payable team. この発注書をクローズできない場合や、不明点がある場合は、支払処理チームにお問い合わせください。 Update the following English Text on the PO Closing notification email - Original English Revised English Review line-item(s) highlighted in the PO and ensure that receipts, returns/cancellalation are up-to date; if not, please receive and return/cancel line-items that have been received and returned/received-in-excess respectively. Review line-item(s) highlighted in the PO and ensure that receipts, returns/cancellalation are up-to date; If not, please create all receipts and returns (or cancellations) that have not been created yet. Update the Japanese translation for the Combined Revised English text on the PO Closing notification email - Revised English Revised Japanese Translation Review line-item(s) highlighted in the PO and ensure that receipts, returns/cancellation are up-to date; If not, please create all receipts and returns (or cancellations) that have not been created yet. Proceed to step #2 only if no additional receipt and return/cancellation activities will be performed on this PO. 発注書でハイライトされているラインアイテムを確認し受領/返品(キャンセル)が最新状況であることを確認します。最新でない場合、未実施の受領/返品(キャンセル)処理を実施してください。この発注書に対して追加の受領/返品(キャンセル)をしない場合にのみ、ステップ 2 に進んでください。 Screenshot reference for the PO Close email -",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-04-04T10:45:34.227-0700",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-98199",
        "summary": "Spike: Create Invoice - Unhandled exception appears when creating Invoice",
        "description": "Goal Investigate why OCR predictions values are duplicated for specific invoice documents and summarize how to prevent such issues in the future Update    Preconditions   Unknown - needs to be investigated Steps: Access the document from hopper Click on create Invoice Actual result: Error message shows unhandled exception Two instances are created in Db against one Invoice Expected Result: Invoice should be created successfully through OCR and there should be only one instance in Db for the Invoice created  Note:  Attaching the sample document by which QA was able to reproduce the issue",
        "status": "Investigation Done",
        "assignee": "Ahmed Habib",
        "created": "2024-04-04T10:14:23.849-0700",
        "issue_type": "Spike",
        "parent_id": null
      },
      {
        "key": "VZI-98181",
        "summary": "PROD - Accounts Payable - CXML/SP/Hopper Invoices are showing to irrelevant users",
        "description": "URL:   https://stage-go.vroozi.com/#/login username:  asma.latif+APapproverEditor01@vroozi.com password:  Blueangel1@/Blueangel1! Pre Requisite: A cxml/OCR/SP/email invoice is created and should be assigned to AP Manager/AP Processor  e.g. Invoice#  9000002014 Steps to Reproduce: Login through any irrelevant user to the Invoice who had Doc flow access  e.g. any AP approver  (given credentials) Search for the same Invoice in doc flow Please see the Invoice is showing with them Actual Result: Invoice is showing to irrelevant users Expected Result: Invoice should only be visible to assigned users",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-04-04T00:43:06.761-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-97814",
        "summary": "PROD - Accounts Payable - MAERSK - Approval Rules Grid - Applies to Column values need to be in Order.",
        "description": "Environment: https://stage-go.vroozi.com Username :  notifyvroozi@gmail.com Password:  Welcome1 Pre-Requisites: Feature Toggle ACCOUNTS_PAYABLE_WORKFLOW_ENHANCED_WORKFLOW should be enabled for the Unitid in DB. Approval Rule should exist in the Company>Workflow>Financial and Invoicing Workflow Section. Upload the attached file. Steps to Reproduce: Upload Successful msg shows. Please see ‘Applies to' Column values are not in Order. i.e  'Change Requests, Invoices, Purchase Requests’ Actual Result: 'Applies to' Column values are not in Order. i.e  'Change Requests, Invoices, Purchase Requests’ Expected Result: ‘Applies to' Column values should be ordered  i.e  'Purchase Requests ,  Change Requests, Invoices’ Screen-Shot: Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-03-20T22:17:46.804-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-97492",
        "summary": "Categories - The system does not sort categories on the transactional document’s line item modal, similar to the sorting on the Master Data > Categories screen",
        "description": "Issue : Categories - The system does not sort categories on the transactional document’s line item modal, similar to the sorting on the Master Data > Categories screen Credentials: Server: Production Pre-Conditions: 1. Prepare categories file and upload following file on Master Data > Categories screen   Steps To Replicate: 1. Login to PMAN as an Admin 2. Navigate to Master Data > Categories screen 3. Verify the order of categories Actual Result: System is sorting categories on the basis of  'Company Category Code'  Navigate to Shopper View Create Purchase Request and Click on  ‘Add Line Item’  button Verify the order in Category Actual Result: The system does not sort categories on the line item modal, similar to the sorting on the Master Data > Categories screen Expected Result: System should sort the data according to  'Company Category Code'",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-03-11T23:01:07.427-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-97354",
        "summary": "PROD-PMAN: Acc Val - When sourcing or financial approver edits PR, Validating Data silkscreen should not be displayed on the PR edit modal",
        "description": "Environment:  Devqa2, unitId 2 User:   iqtidar.arshad+sourcing_devqa2@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Acc val feature toggle should be “ON” from the db \"PURCHASE__ACCOUNTING_STRING_VALIDATION\". Acc val CURD operations feature toggle should be “ON” from DB PURCHASE__ACCOUNTING_STRING_UI_CRUD PR is already in the approval queue of Sourcing or Financial Approver. Steps to Reproduce: Navigate to Approve Requests from left menu and select a request. Click on the “Edit” button on the bottom of the screen. Actual Result: Validating Data is being displayed on the silkscreen covering the line item grid. Expected Results: Validating Data silkscreen should not be displayed when edit model is opened or closed by sourcing or financial approver.",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-03-08T02:15:13.760-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-97337",
        "summary": "Bulk upload file would not accept  GL Account even though given GL is  valid and active.",
        "description": "Pre-conditions: More Than 1 GL should exist with same Code but different Companies. First GL having code 000-787 and company A → Inactive Second GL having code 000-787 and company B → Inactive Third GL having code 000-787 and company C → Active Provide third Gl (only active) in Bulk upload file having valid Company code information. Steps to Reproduce: 1-Click on the Upload line item(s) button. 2-Select the relevant Bulk upload file that contains valid Accountings/Cost/GL inputs on the system. 3-Click on the Open. Actual Result: It throws errors “ The specified GL Account [000-787] is not active .“  Expected Result: Bulk upload should be uploaded with in the Valid Accounting GL account inputs.",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-03-07T19:54:53.621-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-97251",
        "summary": "Stage- Payment Request- Failure pop up while editing Company code, Plant and other accounting elements of line item",
        "description": "Url:  https://stage-go.vroozi.com/#/login username:  aqsa.rani+employeenew@vroozi.com password:  Qwerty@1 Steps to reproduce: Login through given user Click on Create PRQ Add line Item and save Click on edit button  Edit the company code, plant and accounting details of the line item Click on save item Please see the Failure pop up  Actual Result: Failure error showing while editing accounting details Expected Result: Accounting elements should be edited successfully Screenshot:",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-03-05T23:09:15.500-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96940",
        "summary": "PROD - OCR - Create Invoice - Duplicate OCR predictions documents are adding in DB",
        "description": "Goal Investigate why OCR predictions values are duplicated for specific invoice documents and summarise how to prevent such issues in the future Preconditions  OCR Enabled   ML Enabled  Auto consolidation Enabled Steps: Sent the document from email with wrong total and valid supplier  Access the document from hopper Click on create Invoice invoice created successfully and one item added as a result of consolidation  Actual result: Two documents added  in ocr_invoice_prediction  against invoice id Expected Result: Only one document should added  ocr_invoice_prediction  against invoice id Example  Devqa5 unitId 83 Invoice#  9000002036 Query to verify  db.ocr_invoice_prediction.find({invoiceId: \"662955e4a90b16223090b9c7\"}).sort({_id: -1})",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-02-27T21:53:38.459-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96511",
        "summary": "Payables: Fix Percentage Tolerance Implementations to Consider Total Values for Partial Invoices, Not Just Remaining Amounts",
        "description": "When we have a tolerance configured with percentages, we are calculating the percentage over the remaining amount, and not over the total. For example: Pre-requisites Item quantity tolerance = 10% PO with item qty = 3 Invoice 1 referencing PO with item qty = 2 Create invoice 2 referencing PO Actual Result A qty of 1.1 is allowed on the invoice (Because we are calculating the tolerance over what’s left: 1, and not over the total). Expected Result When creating Invoice 2 for the PO, we should be able to create up to 1.3 (Tolerance is set to 10%, and 10% of 3 is 0.3). The same concept is expected to be applied for all tolerances with percentage configured. This is not happening for fixed qty tolerances, given that the amount is fixed, and not calculated. Tolerances affected by the change: Product and service line item quantity Total quantity Blanket line item total Line item shipping Total shipping Total tax Note to QA : Please verify if we need to fix this for any other tolerance which can be configured as percentage.",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-02-15T07:18:06.646-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96015",
        "summary": "PROD - Accounts Payable - Create Invoice - Tax does not recalculate when Tax Code is added/updated against items via Apply to All.",
        "description": "Environment:  https://go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Redangel1@/ Redangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice.  9000008843 Add few items without selected a taxable tax code. Checkmark all Items and Click to Apply to All. Add details and a taxable tax code on the Changes to be applied tab of the modal. Click Apply Changes. Check the Item/s. Tax Code has been set in the field but the tax is not filling in the tax field. (estimated tax is calculating, though!) Actual Result: Tax does not recalculate when Tax Code is added/updated against items via Apply to All. Expected Result: Tax should calculate and populated against the items when added/updated via Apply to All Modal. Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-02-01T00:36:36.437-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94989",
        "summary": "Stage - Accounts Payable - AP Inbox - Task Grid - Searching by Supplier's Display Name (text) has issue.",
        "description": "Environment:  https://stage-go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@ Pre-Requisites: AP User should have logged into the Application. A supplier with Display Name “RC2311-Supplier“ should exist on both Stage and Prod Servers. Invoice with this Supplier should have been created and assigned to the AP Users on both Stage and Prod Servers.   Steps to Reproduce: Access Inbox>Task Grid. Write text “RC2311“ because a task exists already with Supplier Display i.e “RC2311-Supplier“. Nothing is being returned. Logout and Login to Prod with the AP User. Write text “RC2311“ because a task exists already with Supplier Display i.e “RC2311-Supplier“. Records are returned. Actual Result: Searching by Supplier's Display Name (text) has issue. Expected Result: Search should bring the results when searched by Supplier’s Display Name i.e text. Screenshots: Stage: Prod: Thanks, Asma",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-01-09T12:17:55.773-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94278",
        "summary": "Bulk Upsert Async sample response with Code 202 is not correct on swagger UI",
        "description": "Environment : Stage Unit ID:  “83“ Authorization:  eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA x-api-key:  9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c Steps to reproduce: Navigate to Master Data → Accounting Strings → POST /accounting-combos/bulk-upsert/async  in the Swager UI Go to the Sample Responses grid Actual Response: Bulk Upsert Async sample response with Code 202 is not correct on Swager UI Expected Result: The response payload should look like this: {\n  \"requestId\": \"35b7ac98-2eec-4d79-b34f-3195469bce29\",\n  \"status\": \"Processing\",\n  \"timestamp\": \"2023-12-11T10:22:28.971+00:00\"\n}",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2023-12-11T02:31:00.376-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-93530",
        "summary": "OCR Invoice:PR/PO is created with 0 Tax then when we created Invoice from OCR Invoice Tax value is not showing correct",
        "description": "OCR Invoice : When PR/PO is created with 0 Tax then when we created Invoice from OCR Invoice Tax value is not showing correct Preconditions: 1-Must have Related OCR Document. 2-OCR Document have the similar Data while creating the PR/PO. 3-OCR Document should be sent to the Hopper. 4-PR/PO is created from the Requester, 5-Login with AP Manager. Steps To Replicate: 1-GO to to inbox section from accounts payable. 2-Click on create Invoice. Actual Result: When click on create invoice button then un-expected Tax is added on the create Invoice scree. Expected Result: Since no Tax is included in OCR  PR/PO then 0 tax must be included  /   /    Note: I have attached the OCR Invoice as sample just Change the PO # and make similar data in PR/PO.",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2023-11-08T03:16:50.829-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-91486",
        "summary": "JP translation: Create GR Button JP translation doesn't make sense",
        "description": "USJ Unit Id: 160 Client: Please change JP translation as below. Also as we asked before, please let us know if you change any translation. Thank you. Save Receipt ⇒　受領書の一時保存 Confirm Receipt ⇒　受領書の提出 Support: USJ wants to change the translation of  Save Receipt  and  Confirm Receipt  buttons. This screen appears when you open PO and go to the  Create Receipt  option. You’ll find these options at the end of the Create Receipt page.  Please see Zendesk Support tab for further comments and attachments. FYI -       |",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2023-09-04T04:21:47.818-0700",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-89693",
        "summary": "Bulk upload file would not accept Cost Center  even though Cost centre is valid and active.",
        "description": "Bulk upload file would not accept Cost Center and GL Account even though they are valid and active. Pre-conditions: 1-have the Bulk  upload line item template. 2-Must have active cost /Gl Accounts. 3-Requester should be on the line item modal screen. 4-Login with Requester. Against requester user Company code restriction should be applied.  No Cost centre is selected on user Defaults.  Provide relevant company code and Cost centre Information in bulk upload file.  Steps to Reproduce: 1-Click on the Upload line item(s) button. 2-Select the relevant Bulk upload file that contains valid Accountings/Cost/GL inputs on the system. 3-Click on the Open. Actual Result: It throws errors “ Line Item 1 Cost Center is invalid  “. Expected Result: Bulk upload should be uploaded with in the Valid Accounting /Cost/GL account inputs.",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2023-07-10T03:54:32.308-0700",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-87986",
        "summary": "PMan - The supplier acknowledgement button is not available on the POCR confirmation email.",
        "description": "Issue is reproducible. Steps to reproduce - Supplier PO Ack and Accept POCR toggles need to be ON. Create a Service PR and submit it. PO will go into Submitted status. Confirm the order from the email as the supplier. PO goes into Ordered status. Create a GR and fully receive the PO. PO goes into Received status. Create a POCR and change something like Service Date. Submit the POCR. Result : PO gets stuck in Submitted status and the email notification sent to Supplier does not have a Confirm Button to Acknowledge the POCR. Dev Team Issue is a ripple of ticket   basically if PO is fully received and we are doing POCR and that POCR is not effecting PO received a status that we do not send PO acknowledgment button in email but move it into the submitted status and PO got stuck.  USJ - Unit id 160 Support - Suppliers have received the POCR acknowledgment email, but they report that the 'Confirm' button is not available. We have checked the details from the db and attached a screenshot below for reference. Can you please investigate the issue? Client- Supplier informed us that there is no PO confirm button on 2000057300(Ver2). And Status is still \" Submitted\"  Could you please investigate ?  Please see Zendesk Support tab for further comments and attachments. cc:",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2023-05-11T13:15:12.131-0700",
        "issue_type": "Bug",
        "parent_id": null
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-100667",
      "released_in_current_rc": false,
      "summary": "Little Rock Smart Coding Model Evaluation",
      "description": "",
      "status": "In Final Review",
      "assignee": "Sambhu Sai",
      "created": "2024-06-24T17:50:29.250-0700"
    },
    "issues": [
      {
        "key": "VZI-100592",
        "summary": "Account Inference Model - Update mongo connection to support Atlas for data ingestion",
        "description": "",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-06-21T15:05:50.150-0700",
        "issue_type": "Task",
        "parent_id": "VZI-100667"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-100573",
      "released_in_current_rc": false,
      "summary": "Integration: Critical Production Bugs RC-2024-5",
      "description": "",
      "status": "Open",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-06-21T03:12:41.568-0700"
    },
    "issues": [
      {
        "key": "VZI-100488",
        "summary": "Vroozi API - Accounting String performance enhancement with atlas latency",
        "description": "We are observing the timeouts on 500 accounting string bulk upsert requests. Acceptance Criteria: 1- The 500 accounting string should be inserted and user get success response. 2- The 500 accounting string should be updated and user get success response. 3- The 500 accounting string should be updated/inserted (mixed case) and user get success response. We need to make sure the existing test cases are working and there is no functional change in the bulk upsert API.",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-06-14T04:10:12.038-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-100573"
      },
      {
        "key": "VZI-100485",
        "summary": "NBCU - Approval Group Interface is failing due to Atlas Latency",
        "description": "This is the error we are receiving  PRODUCTION. Error Processing Message : APPROVAL_GROUPS Interface Date : 2024-05-22 06:41:00 AM PDT Interface : APPROVAL_GROUPS Data Flow From : MySQL_TO_MONGO Payload : {\"approvalGroups\":[{\"approvalGroupCode\":\"DIS\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Distribution\"},{\"approvalGroupCode\":\"GAD\",\"channel\":\"AP\",\"approvalGroupDescription\":\"General & Admin\"},{\"approvalGroupCode\":\"ITL\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Information Tech\"},{\"approvalGroupCode\":\"MKT\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Marketing\"},{\"approvalGroupCode\":\"PPP\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Prod/Post Prod\"},{\"approvalGroupCode\":\"TPK\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Theme Parks\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H01\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Finance\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H03\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UCA Finance\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H05\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Royalties\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H06\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK TV Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H07\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK UCA Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H08\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Special Int Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H09\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Public Relations\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H10\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Executive\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H11\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Film Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H12\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Programming 1\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H13\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Film Public Relations\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H14\",\"channel\":\"AP\",\"approval …. Error Message : I/O error on POST request for \" http://prod-service-elb-internal.vroozi.com:8080/purchaseapi/api/receive/approval-groups/bulk-upsert \":Unexpected end of file from server; nested exception is java.net.SocketException: Unexpected end of file from server Testing Use Cases: Integration API (Timeout) Purchase API (Timeout) Expectation 24000ms (4mins) 24100ms (more than 4 mins) Issue should be reproduced 24000ms (4mins) 23900ms (less than 4 mins) Issue should not be reproduced",
        "status": "Abandoned",
        "assignee": "Sambhu Sai",
        "created": "2024-06-14T03:33:50.353-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-100573"
      },
      {
        "key": "VZI-99726",
        "summary": "NBCU Approval Group Interface is failing",
        "description": "This is the error we are receiving  PRODUCTION. Error Processing Message : APPROVAL_GROUPS Interface Date : 2024-05-22 06:41:00 AM PDT Interface : APPROVAL_GROUPS Data Flow From : MySQL_TO_MONGO Payload : {\"approvalGroups\":[{\"approvalGroupCode\":\"DIS\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Distribution\"},{\"approvalGroupCode\":\"GAD\",\"channel\":\"AP\",\"approvalGroupDescription\":\"General & Admin\"},{\"approvalGroupCode\":\"ITL\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Information Tech\"},{\"approvalGroupCode\":\"MKT\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Marketing\"},{\"approvalGroupCode\":\"PPP\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Prod/Post Prod\"},{\"approvalGroupCode\":\"TPK\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Theme Parks\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H01\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Finance\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H03\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UCA Finance\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H05\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Royalties\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H06\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK TV Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H07\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK UCA Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H08\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Special Int Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H09\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Public Relations\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H10\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Executive\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H11\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Film Marketing\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H12\",\"channel\":\"AP\",\"approvalGroupDescription\":\"UK Programming 1\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H13\",\"channel\":\"AP\",\"approvalGroupDescription\":\"Film Public Relations\"},{\"companyCode\":\"1001\",\"approvalGroupCode\":\"H14\",\"channel\":\"AP\",\"approval …. Error Message : I/O error on POST request for \" http://prod-service-elb-internal.vroozi.com:8080/purchaseapi/api/receive/approval-groups/bulk-upsert \":Unexpected end of file from server; nested exception is java.net.SocketException: Unexpected end of file from server",
        "status": "Investigation Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-22T14:54:30.499-0700",
        "issue_type": "Spike",
        "parent_id": "VZI-100573"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-100200",
      "released_in_current_rc": false,
      "summary": "Upgrade mongoDB community version to mongoDB Atlas",
      "description": "With the successful migration of MongoDB 3.2 to 6.0 we need to move the community version of MongoDB to Atlas. The scope of this epic includes Move the community version of MongoDB to Atlas Remove unnecessary data from production DB Add compression to reduce network traffic Performance evaluation of MongoDB Atlas Define and execute MongoDB archiving strategies.",
      "status": "Work Completed",
      "assignee": "Qazi Asad Ullah",
      "created": "2024-06-06T03:19:38.784-0700"
    },
    "issues": [
      {
        "key": "VZI-100203",
        "summary": "With the successful migration of MongoDB 3.2 to 6.0 we need to move the community version of MongoDB to Atlas.",
        "description": "With the successful migration of MongoDB 3.2 to 6.0 we need to move the community version of MongoDB to Atlas.",
        "status": "Released",
        "assignee": "Farhan Tariq",
        "created": "2024-06-06T04:14:09.463-0700",
        "issue_type": "Story",
        "parent_id": "VZI-100200"
      },
      {
        "key": "VZI-99568",
        "summary": "Apply network compression on mongodb data transfer",
        "description": "Apply network compression on mongodb data transfer. This will help us reduce data transfer cost on egress for cloud providers and also potentially improve query performance.",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2024-05-17T02:34:29.117-0700",
        "issue_type": "Story",
        "parent_id": "VZI-100200"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99323",
      "released_in_current_rc": false,
      "summary": "Tech Upgrades for RC-2024-5",
      "description": "Need to add lastUpdated / updatedDate field in the incoming_cxml_transmission collection Email notification for cXML PO Confirmation not working Email notification for cXML ASN not working",
      "status": "Implementation In Progress",
      "assignee": "Sambhu Sai",
      "created": "2024-05-09T21:46:48.919-0700"
    },
    "issues": [
      {
        "key": "VZI-99764",
        "summary": "Email notification for cXML ASN not working",
        "description": "Hi Team, We have identified that the email notification when a cXML ASN is received is not being sent out to the end user. This is a very important flow for the client VASA Fitness. Can we investigate why this email notification is not working in case of cXML ASN? I have verified that the same case if working for Supplier Portal.",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-05-23T01:02:23.809-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99323"
      },
      {
        "key": "VZI-99763",
        "summary": "Email notification for cXML PO Confirmation not working",
        "description": "Hi Team, We have identified that the email notification when a cXML PO confirmation is received is not being sent out to the end user. This is a very important flow for the client VASA Fitness. Can we investigate why this email notification is not working in case of cXML PO confirmation? I have verified that the same case if working for Supplier Portal.",
        "status": "Released",
        "assignee": "Melissa Riggs",
        "created": "2024-05-23T01:01:52.575-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99323"
      },
      {
        "key": "VZI-97482",
        "summary": "Data Script: Need to rename fields  lastUpdated -> updatedDate and dateCreated -> createdDate field in the incoming_cxml_transmission collection",
        "description": "Reporting Team has to create a report on the cXML error reports. In order for them to achieve this, they require the lastUpdated / updatedDate field in the incoming_cxml_transmission collection.  In general, all collections should have incremental timestamps (lastUpdated), and the same for this collection. Pls take care of the following things while creating the timestamp field. There shouldn't be any hard delete The \"lastUpdated\" date should be modified whenever there is a new/change action that happens in any main or nested element. Index should be created on lastUpdated  CC:   /  Reporting Team  (       )",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-03-11T08:15:34.994-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99323"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-95348",
      "released_in_current_rc": false,
      "summary": "Enhancement of Terms & Conditions Management and Assignment in Purchase Orders",
      "description": "Description Objective: This Epic aims to significantly enhance the Terms & Conditions (T&Cs) management and assignment functionalities in our system, addressing specific needs of our clients, Yukon and Maersk. The primary goal is to provide flexibility and control in the creation, assignment, and management of T&Cs for Purchase Orders (POs), both auto-generated and manually created. Key Features: Admin Capabilities for T&Cs Management: Enable Company Admins to author and manage multiple custom T&Cs. Provide functionality to set default T&Cs and associate custom T&Cs with specific suppliers and/or company codes. Dynamic T&Cs Assignment: Automate the assignment of correct T&Cs to POs based on supplier and/or company code. Buyer Permissions & Capabilities: Empower Buyers with permissions to edit T&Cs on POs, including the use of a rich text editor for ad-hoc T&Cs, with options to save these either for single-use or in their profile for future reuse. PO Change Request (POCR) Enhancements: Implement functionality for Buyers to update T&Cs on POs via POCR, with tracking of changes in the document history UI. Restricted Access for Requesters: Prevent the original requester from altering T&Cs on POs through the POCR function. Admin Overrides and Approvals: Allow Admins to modify T&Cs on POs via POCR, subject to Buyer approval for manually created/transmitted POs. Stakeholders: Primary: Yukon and Maersk Vroozi Divisions: Management, Sales / Marketing, Customer Success, Implementation, Support, Product, Engineering Vroozi Functional teams: Purchase Team, Payables Team ( — ?), Integration Team ( ?) Timeline and Milestones: Start Date: ASAP Completion Target: May 2024, within Q2 2024 Dependencies and Risks: Application Roles Effected : Company Admins, Buyers Payables Team Cooperation: Required for updating POs in the Supplier Portal. Integration Team Involvement: Potential need for integrating T&Cs communication via cXML POs, which could impact project timeline. Success Criteria: Effective implementation of T&Cs management and assignment system enhancements. Improved flexibility and control for Admins and Buyers in handling T&Cs. Seamless integration with existing systems and processes. Positive feedback from primary stakeholders, Yukon and Maersk. Milestones: MVP - Minimum Viable Product: Product manager to validate assumptions and solution design with stakeholders. Engineering to complete    MUP - Minimum Useable Product:                                     Purchase Order: Allow Buyers to create and associate Ad-hoc T&Cs to a specific PO Purchase Order: Print the correct T&Cs on the PO PDF Vroozi Admin: Allow Admins to specify whether PO T&Cs can be updated via the POCR function POCR: Allow only the “PO Owner” to update T&Cs via POCR POCR: Record and display T&Cs changes done on a PO, in the PO Document Change History Integration team  → SPIKE: Integration team needs to investigate impact on NBCU, if T&Cs can be updated vai POCR Payables team  → Supplier Portal: Display PO T&Cs in the Vroozi Supplier Portal Payables team  → Supplier Portal: Ensure SP users are able to Confirm / Dispute T&Cs changes on a PO updated via POCR MLP - Minimum Lovable Product: Vroozi Admin: Figure out how to introduce an “Apply to All” option for associations SPIKE: Investigate how we can compute, store and display a fine grained “Diff” for the T&Cs content, when updated by an Admin         Integration team  →     POCR: Allow Admins to update the T&Cs on a PO via POCR POCR: Allow Central Reciever to update the T&Cs on a PO via POCR POCR: Ensure that T&Cs updates on POs; done via POCR, are reviewed and approved by the “PO Owner” Vroozi PMAN: Allow Buyers, Admins, Central Receivers to create custom T&Cs and save them in their user profile for reuse at a later date Vroozi PMAN: Allow users to view and manage their custom T&Cs from their “My Data” screen   The wireframes for this project can also be found here:",
      "status": "Implementation In Progress",
      "assignee": "Naufil Aziz",
      "created": "2024-01-18T01:03:41.306-0800"
    },
    "issues": [
      {
        "key": "VZI-99736",
        "summary": "T&Cs - T&Cs icon should not be coming on PO document right-side panel, if new feature flag is OFF",
        "description": "T&Cs - T&Cs icon should not be coming on PO document right-side panel, if new feature flag is OFF",
        "status": "Resolved",
        "assignee": "Zain Mehmood",
        "created": "2024-05-22T22:45:22.269-0700",
        "issue_type": "Defect",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99634",
        "summary": "T&Cs: In the PO side panel, the titles \"Name\" and \"Description\" are not displayed before the Terms and Conditions name and description.",
        "description": "Server : devqa6 Pre-Req: Custom T&Cs exist PO should be auto created. Steps to Reproduce: Login with employee user Navigate to  Purchase Order Open newly created draft PO.  Go to PO side panel and click on Term & Condition Icon.  Actual Result :  On side panel Name and description tittle is not displayed before T&Cs name and description. Expected Result: T&Cs name and description title should come before T&Cs name and description as follows. Note:  Behaviour should be consistent throughout the application where are are displaying PO T&Cs.",
        "status": "Resolved",
        "assignee": "Ayesha Waseem",
        "created": "2024-05-20T23:14:13.918-0700",
        "issue_type": "Defect",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99617",
        "summary": "T&Cs: When the user clicks on the See More link, the T&C unique name does not show up in the T&Cs section if no T&C description is given.",
        "description": "Server : devqa6 Pre-Req: Custom T&Cs exist Description optional field value is not provided during T&C definition.   Draft PO is created. Steps to Reproduce: Login with admin Navigate to Buyer route >  Purchase Order Open newly created draft PO.  Go to Terms and condition section on bottom of the document. T&Cs should applied on draft PO. Click on  Show More  link Actual Result :  the T&C unique name does not show up in the T&Cs section as there is no description is provided during T&C definition. Expected Result: Terms and condition unique name should displayed on model when user click on  Show more  link",
        "status": "Resolved",
        "assignee": "Javaid Sattar",
        "created": "2024-05-20T13:17:25.925-0700",
        "issue_type": "Defect",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99538",
        "summary": "T&Cs - System should check first if there is a T&Cs associated with it, if not then check for none and defaults",
        "description": "Server : devqa6 Pre-Req:   Custom T&Cs exist PO are created with Custom T&Cs Steps to Reproduce: Login with admin Navigate to Documents> Settings > Purchase Order Change the Terms and Conditions to Vroozi defaults Now, open the PO created before with custom T&Cs Actual : Vroozi defaults T&Cs are being shown Expected : PO was created earlier, so Custom T&Cs associated with it should be shown",
        "status": "Resolved",
        "assignee": "Javaid Sattar",
        "created": "2024-05-16T04:46:43.399-0700",
        "issue_type": "Defect",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99247",
        "summary": "Purchase Order: Based on assigned Buyer permissions, allow the user to change the assigned T&Cs on a PO",
        "description": "Business Case: TBD …  Acceptance Criteria: Pre-requisites: The feature flag defined in   must be enabled for the unitID. The unitID should be configured to use the “Custom Terms & Conditions” option on the  Admin Panel → Documents → Purchase Orders  screen. The system should already allow creation and management of multiple T&Cs, as well as allowing a default set of T&Cs to be designated for the unitID. As defined in: The system must already support the additional permissions added for Buyers in  The user manually creating the PO must be a Buyer with at least the “Edit PO T&Cs” permission. The system must already be capable of automatically assigning T&Cs to a DRAFT PO as defined in      Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? PMAN Admin ( when creating a PO ) PMAN Buyer Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD …     How should the auto-assigned T&Cs be displayed on a DRAFT PO? The system should continue showing the assigned T&Cs on the DRAFT PO, exactly where they’re displayed today. Towards the bottom of the document, above the action buttons. The T&Cs section should ONLY be visible if there are T&Cs assigned to the PO. The height of the T&Cs section should be capped, to be the same as the adjacent “Notes to Supplier” section. The T&Cs section should be titled “Terms & Conditions” This section should display the unique name of the assigned T&Cs, in a type-ahead field This section should display the content of the assigned T&Cs If the content doesn’t fit into the fixed height of this section, it should be truncated and the body of text should end with an ellipsis ( … ), so the user understands that there is more content. What should happen when the user clicks into the type-ahead field with the T&C name in it? When the user clicks into the type-ahead field …  The system should automatically remove the previously selected T&Cs from the field  (Please see   ) The system should display a drop-down menu  listing upto 10  (Please see  ) of the active, applicable T&Cs that could be assigned to the current DRAFT PO This list should be scrollable if needed If the BE returns more applicable T&Cs as options, than can be shown in this list, the last element in the list should be an ellipsis ( … ), so the user can understand that there’s more data There should be no change to the name or the content of the T&Cs that are already assigned to the PO.  if the user clicks away from this field, the field’s state should revert back to what it was before the user clicked into it.    What should happen when the user types is the type-ahead field with the T&C name in it? if the user begins typing into the type-ahead field, the system should search through the list of applicable T&Cs returned by the BE for this particular PO.  The user should only be able to trigger the search function by typing in the name of a set of active, applicable T&Cs from their unitID. The search function should not be triggered till the user has entered at least 2 chars.  The system should present a filtered/narrowed result set with every additional character entered by the user.  The list of options visible in the drop-down list should update in real-time as the result set is updated.  What should happen when the user clicks on one of the options listed in the type-ahead field with the T&C name in it? If the user clicks on one of the visible options in the drop-down list …  The system should replace the name and content of the previously assigned T&Cs from the T&Cs section on the DRAFT PO The drop-down list should no longer be visible The type-ahead field should now be populated with the name of the newly selected T&Cs The section should update to display the name and content of the newly selected T&Cs  Any visual artifacts when updating this data should be restricted to the T&Cs section and NOT affect the rest of the application/document UI   When should the system display a “Show more …” link in the T&Cs section? If the T&Cs section is showing truncated content, then there should be a “Show more …” link below the body of text. Whether or not this link is visible, should NOT affect the total height of the T&Cs section. This link should be clickable by the user.   What should the user see when they click on the “Show more …” link? When the user clicks on the “Show more …” link, the system should display a modal to the user. The document behind the modal should appear in a dimmed state; as is standard across the application. This modal should have the tile “Terms & Conditions“ This modal should display the unique name of the assigned T&Cs, in a type-ahead field This modal should display the optional description of the assigned T&Cs If there is no description provided for the assigned T&Cs, then the description field should NOT be visible on the UI. This modal should display the entire content of the assigned T&Cs The section of the modal displaying the T&Cs content should be scrollable, if there is more content than can be displayed in the section’s viewport. This modal should have a standard “x” button on the top right to close the modal and return the user to the DRAFT PO screen. This modal should have 2 additional action buttons at the bottom: Cancel Save What should happen when the user clicks into the type-ahead field with the T&C name in it, on the modal? When the user clicks into the type-ahead field …  The system should automatically remove the previously selected T&Cs from the field  (Please see   ) The system should display a drop-down menu  listing upto 10  (Please see  ) of the active, applicable T&Cs that could be assigned to the current DRAFT PO This list should be scrollable if needed If the BE returns more applicable T&Cs as options, than can be shown in this list, the last element in the list should be an ellipsis ( … ), so the user can understand that there’s more data There should be no change to the name or the content of the T&Cs that are already assigned to the PO.  if the user clicks away from this field, the field’s state should revert back to what it was before the user clicked into it.   What should happen when the user types is the type-ahead field with the T&C name in it, on the modal? if the user begins typing into the type-ahead field, the system should search through the list of applicable T&Cs returned by the BE for this particular PO.  The user should only be able to trigger the search function by typing in the name of a set of active, applicable T&Cs from their unitID. The search function should not be triggered till the user has entered at least 2 chars.  The system should present a filtered/narrowed result set with every additional character entered by the user.  The list of options visible in the drop-down list should update in real-time as the result set is updated.  What should happen when the user clicks on one of the options listed in the type-ahead field with the T&C name in it, on the modal? If the user clicks on one of the visible options in the drop-down list …  The system should replace the name and content of the previously assigned T&Cs from the modal The drop-down list should no longer be visible The type-ahead field should now be populated with the name of the newly selected T&Cs The content section of the modal should update to display the name, optional description and content of the newly selected T&Cs  Any visual artifacts when updating this data should be restricted to the T&Cs section and NOT affect the rest of the application/document UI    What should happen when the user clicks on the “Save” button on the modal? When the user clicks on the “Save” button …  The modal should disappear and the user should be returned to the DRAFT PO screen The assigned T&Cs on the PO should be updated The T&Cs section on the DRAFT PO should be updated to reflect this change.    What should happen when the user clicks on the “Cancel” button on the modal? When the user clicks on the “Cancel” button …  The modal should disappear and the user should be returned to the DRAFT PO screen There should be no change to any of the data in the PO.      Question Answer Q asked by … Q asked on … A provided by … A provided on … When updating the T&Cs on the PO, if the update operation fails, what message should the user see?  In such a case, the user should see a red noty message in the bottom left corner of the screen. This message should read  “ Oops! Something went wrong. Unable to update the T&Cs on this PO. Please try again later. “              Should T&C type head field be disabled if supplier or company code is missing on draft PO ?  You can’t have a DRAFT PO without a supplier or company code? How would a user even end up in this scenario?  Please let me know what I’m missing, or if you want to discuss this in detail.                 AC updated, with reference to the following comment in this ticket:",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-05-08T03:24:58.140-0700",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99246",
        "summary": "Purchase Order: Update the way assigned T&Cs are displayed on DRAFT POs",
        "description": "Business Case: The functionality being built under   will allow company administrators to create and manage multiple sets of Terms and Conditions (T&Cs) that can be associated with Purchase Orders (POs) based on specific parameters (Company Code and Supplier). To streamline operations and ensure that every PO is sent out with the correct set of T&Cs without manual intervention, we need to enable the system to automatically assign the appropriate T&Cs to POs when they are manually generated by an Admin or Buyer. This enhancement is crucial for maintaining compliance, ensuring that all transactions are governed by the correct legal frameworks, and enhancing user satisfaction by automating a critical aspect of the procurement process. We will also need t oupdate how assigned T&Cs are displayed on the DRAFT PO, in order to improve the UX.  Acceptance Criteria: Pre-requisites: The feature flag defined in   must be enabled for the unitID. The unitID should be configured to use the “Custom Terms & Conditions” option on the  Admin Panel → Documents → Purchase Orders  screen. The system should already allow creation and management of multiple T&Cs, as well as allowing a default set of T&Cs to be designated for the unitID. As defined in: The system must already support the additional permissions added for Buyers in  The user manually creating the PO  must either be an Admin, or a Buyer without the “Edit PO T&Cs” or “Create Ad-hoc PO T&Cs“ permissions. The system must already be capable of automatically assigning T&Cs to a DRAFT PO as defined in        Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? PMAN Admin ( when creating a PO ) PMAN Buyer Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD …   What triggers the association of T&Cs with a PO? An Admin or a Buyer manually creating a PO via either the “Create PO” wizard, or the “Ready for Sourcing” screen. The T&C assignment should happen once the DRAFT PO has been generated by the system, but before the user lands on the DRAFT PO screen.   How does the system determine which set of T&Cs to assign to a PO? By checking if the PO's Company Code and Supplier match those associated with a set of active T&Cs. The system should first try and fetch active T&Cs that have specified associations, that are an exact match for the Company Code + Supplier combination on the PO document. if no such T&Cs are found, then the system should try and fetch T&Cs that only have either Company Codes, or Suppliers specified in their associations, and the POs Company Code or Supplier match with those specified associations on the T&Cs. If a matching set of T&Cs is found: The system assigns this set of T&Cs to the PO. If multiple matching sets of T&Cs are found: The system assigns the first set from this list of T&Cs, to the PO. If no specific match is found: The system assigns the default set of T&Cs to the PO. In the case of the default T&Cs having specific Company Code and Supplier associations: The system treats the default T&Cs as universally applicable, ignoring any specific associations.   What should the system do if there is only one set of T&Cs in the system without specific associations? The system automatically assigns this universal set of T&Cs to the PO. QA needs to test this with the Ad-hoc output flows. The PO document needs to store which T&Cs have been applied to it. Because we have to display them on the UI. So the PO needs to show whatever the state of the T&Cs was when the PO was sent to the vendor.   How should the auto-assigned T&Cs be displayed on a DRAFT PO? The system should continue showing the assigned T&Cs on the DRAFT PO, exactly where they’re displayed today. Towards the bottom of the document, above the action buttons.  The T&Cs section should ONLY be visible if there are T&Cs assigned to the PO.  The height of the T&Cs section should be capped, to be the same as the adjacent “Notes to Supplier” section.  The T&Cs section should be titled “Terms & Conditions” This section should display the unique name of the assigned T&Cs  This section should display the content of the assigned T&Cs If the content doesn’t fit into the fixed height of this section, it should be truncated and the body of text should end with an ellipsis ( … ), so the user understands that there is more content.    When should the system display a “Show more …” link in the T&Cs section? If the T&Cs section is showing truncated content, then there should be a “Show more …” link below the body of text.  Whether or not this link is visible, should NOT affect the total height of the T&Cs section.  This link should be clickable by the user.    What should the user see when they click on the “Show more …” link? When the user clicks on the “Show more …” link, the system should display a modal to the user.  The document behind the modal should appear in a dimmed state; as is standard across the application. This modal should have the tile “Terms & Conditions“ This modal should display the unique name of the assigned T&Cs  This modal should display the optional description of the assigned T&Cs If there is no description provided for the assigned T&Cs, then the description field should NOT be visible on the UI.  This modal should display the entire content of the assigned T&Cs The section of the modal displaying the T&Cs content should be scrollable, if there is more content than can be displayed in the section’s viewport.  This modal should have a standard “x” button on the top right to close the modal and return the user to the DRAFT PO screen.      Question Answer Q asked by … Q asked on … A provided by … A provided on …",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-05-08T03:22:38.442-0700",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99245",
        "summary": "Supplier Portal: Add a new tab to the side panel on POs to display assigned T&Cs",
        "description": "Business Case: TBD …  Acceptance Criteria: Pre-requisites: The feature flag defined in   must be enabled for the unitID. The unitID should be configured to use the “Custom Terms & Conditions” option on the  Admin Panel → Documents → Purchase Orders  screen. The system should already allow creation and management of multiple T&Cs, as well as allowing a default set of T&Cs to be designated for the unitID. As defined in: The system must already be capable of automatically assigning T&Cs to a DRAFT PO as defined in  The system must already allow permitted users to manually assign T&Cs to a PO; whilst in the DRAFT state, as described in: The current user should have access to view POs in the Supplier Portal UI     Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? All Vroozi user roles with access to PO documents in the Supplier Portal module Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD …       What should the user see when they open a non-DRAFT PO with T&Cs assigned to it? If there are T&Cs already assigned to the current PO, there should be a new icon visible on the right side-panel This icon should use the following design:   What should the user see when they open the side-panel by clicking on the new “Terms & Conditions” icon? When the user clicks on this icon … The side-panel should appear in the open state on the screen, if it wasn’t already open. If it was already open then just the content visible on the panel’s UI should change. This new side-panel tab should be titled “Terms & Conditions” This new side-panel tab should display the content of the T&Cs assigned to the PO This side panel UI should be scrollable, if the amount of T&Cs content does not fit within the default height of the viewport.       Question Answer Q asked by … Q asked on … A provided by … A provided on …",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-05-08T03:21:36.981-0700",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-99150",
        "summary": "Purchase Order: Add a new section in the side-panel on non-DRAFT POs, to display assigned T&Cs",
        "description": "Business Case: TBD …  Acceptance Criteria: Pre-requisites: The feature flag defined in   must be enabled for the unitID. The unitID should be configured to use the “Custom Terms & Conditions” option on the  Admin Panel → Documents → Purchase Orders  screen. The system should already allow creation and management of multiple T&Cs, as well as allowing a default set of T&Cs to be designated for the unitID. As defined in: The system must already be capable of automatically assigning T&Cs to a DRAFT PO as defined in  The system must already allow permitted users to manually assign T&Cs to a PO; whilst in the DRAFT state, as described in:         Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? All Vroozi user roles with access to PO documents Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD …   What should the user see when they open a non-DRAFT PO with T&Cs assigned to it? If there are T&Cs already assigned to the current PO, there should be a new icon visible on the right side-panel This icon should use the following design: What should the user see when they open the side-panel by clicking on the new “Terms & Conditions” icon? When the user clicks on this icon …  The side-panel should appear in the open state on the screen, if it wasn’t already open. If it was already open then just the content visible on the panel’s UI should change.  This new side-panel tab should be titled “Terms & Conditions” This new side-panel tab should display the name, optional description & content of the T&Cs assigned to the PO This side panel UI should be scrollable, if the amount of T&Cs content does not fit within the default height of the viewport.    Question Answer Q asked by … Q asked on … A provided by … A provided on … If we turn on the Terms and Conditions switch for UnitID, but there's no Terms and Conditions linked to the Purchase Order (PO), what happens? Will a new icon for Terms and Conditions appear on the side panel of the PO? Assuming the unitID is configured to use the new T&Cs functionality Assuming that the PO doesn’t have an assigned T&Cs, and there’s no content to show in this tab.  The user should see the placeholder text “ There aren’t any Terms & Conditions assigned to this Purchase Order currently. “",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-05-06T23:12:41.223-0700",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-98947",
        "summary": "T&Cs: When user deletes the first attribute, system removes the 2nd attribute as well from the T&Cs ",
        "description": "server : stage credentials :  notifyvroozi14@gmail.com  / Welcome1 Pre-Req: PURCHASE_TERMS_AND_CONDITIONS feature flag should be enable Custom terms and conditions should exist Steps to Reproduce: Login with admin credentials Navigate to Documents > Settings > Purchase orders Open already added term and condition (which should have company and supplier attributes associated) Now, delete the first attribute Actual : System removes the 2nd attribute as well Expected : System should only remove the 1st attribute",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-04-26T04:06:38.647-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-97630",
        "summary": "System: Log a separate event in the audit log, for when unitID default T&Cs are updated",
        "description": "Business Case: Maintaining an accurate and comprehensive record of changes made to the “ unitID default ” status of custom Terms & Conditions (T&Cs) is crucial. The implementation of a background service designed to capture and log every modification to the custom T&Cs within a unitID was completed in  . This ticket builds on top of that, and adds the ability to track when the unitID default T&Cs are changed: By systematically recording who made change, when this change was made, the method used for the changes (API, bulk upload, UI), the organization can ensure a higher level of compliance with internal policies and external regulatory requirements. This comprehensive change log will serve as an essential tool for audits, offering a clear trail of modifications for accountability and verification purposes. Additionally, in instances of errors or disputes regarding the custom T&Cs, having a detailed history of this change can expedite resolution. By identifying when such a change was made and by whom, it is easier to trace back through the decision-making process, understand the context of the modifications, and, if necessary, correct an error or address a dispute more efficiently. Acceptance Criteria: Prerequisites: If the feature flag added in   has not been removed from the system. Then the unitID MUST have this feature flag enabled. The data table defined in   must have already been developed, so that any custom T&Cs that are created, can be displayed in it. The T&Cs creation function defined in   must have already been developed, so that at the very least the creation event can be recorded. The T&Cs editing functionality defined in   must have already been developed, so that at the very least the edit event can be recorded. The ability to set T&Cs as the unitID default; as defined in  must have already been developed, so that any change in this status can be recorded.      Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? PMAN Admin Vroozi Reporting & BI functions Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD … What should happen if the user changes the system default T&Cs from the drop-down field on the T&C management screen? The system records the user ID of the person making the change. The exact timestamp of when the change was made is captured. The avenue of change is documented as \"Admin Panel UI\". The event details record the old default T&C's ID as the old value and the new default T&C's ID as the new value. The specific action is documented as \"Change of System Default T&Cs\". What should occur when a user sets a specific T&C as the system default using the \"set as system default\" button on the T&C management table? The system captures and records the user ID of the individual initiating the change. The timestamp of the change is accurately logged. The avenue for the change is noted as \"Admin Panel UI\". The event details record the old default T&C's ID as the old value and the new default T&C's ID as the new value. The system identifies the action as \"Change of System Default T&Cs\". How should the system record changes made to the system default T&C through the editing UI? The user ID responsible for the change is recorded. The change's timestamp is logged. The change avenue is identified as \"Admin Panel UI\". The event details record the old default T&C's ID as the old value and the new default T&C's ID as the new value. The action type is marked as \"Change of System Default T&Cs\".     Question Answer Q asked by … Q asked on … A provided by … A provided on …",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-03-15T00:05:36.405-0700",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-95383",
        "summary": "Vroozi Admin : Allow Admins to give specific Buyers the ability to modify the T&Cs on a PO",
        "description": "I’ll flesh out the AC later. For now, please add the following 2 sub-permissions to the Buyer Role:  Edit PO T&Cs Create Ad-hoc PO T&Cs Both of these should be Off by default for every Buyer user, and Admins should optionally be allowed to enable them for a given user.  The Admin should ONLY be allowed to enabled the 1st permission if they’ve enabled the Buyer role for the user.  if they disable the Buyer role for a user, the 1st (& 2nd if already enabled) permission should also be automatically disabled.  The Admin should ONLY be allowed to enable the 2nd permission if they’ve already enabled the 1st one for the Buyer user.  If they disable the 1st permission, the 2nd one should also be automatically disabled.  On the user bulk upload sheet, use the following ENUMS to represent these permissions: EDIT_T_C CREATE_T_C The bulk upload sheet should be subject to the same rules as the UI.",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2024-01-18T03:39:48.963-0800",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      },
      {
        "key": "VZI-95376",
        "summary": "Purchase Order : Auto-associate the correct T&Cs to an auto generated PO",
        "description": "Business Case: The functionality being built under   will allow company administrators to create and manage multiple sets of Terms and Conditions (T&Cs) that can be associated with Purchase Orders (POs) based on specific parameters (Company Code and Supplier). To streamline operations and ensure that every PO is sent out with the correct set of T&Cs without manual intervention, we need to enable the system to automatically assign the appropriate T&Cs to POs during their auto-generation process. This enhancement is crucial for maintaining compliance, ensuring that all transactions are governed by the correct legal frameworks, and enhancing user satisfaction by automating a critical aspect of the procurement process. Acceptance Criteria: Pre-requisites: The feature flag defined in   must be enabled for the unitID. The unitID should be configured to use the “Custom Terms & Conditions” option on the  Admin Panel → Documents → Purchase Orders  screen.  The system should already allow creation and management of multiple T&Cs, as well as allowing a default set of T&Cs to be designated for the unitID. As defined in:          Impacted Vroozi Roles Which user roles within the Vroozi Admin system will be affected by this change? PMAN Admin ( when creating and submitting a PR ) PMAN Employee Data-Fix Necessity Will there be any requirement for data migration or transformation as part of this change? TBD … If required, please provide details of what the expected effect of this data fix will be: TBD … What triggers the association of T&Cs with a PO? The system's auto-generation of a PO upon approval of a purchase request. How does the system determine which set of T&Cs to assign to a PO? By checking if the PO's Company Code and Supplier match those associated with a set of active T&Cs. The system should first try and fetch active T&Cs that have specified associations, that are an exact match for the Company Code + Supplier combination on the PO document.  if no such T&Cs are found, then the system should try and fetch T&Cs that only have either Company Codes, or Suppliers specified in their associations, and the POs Company Code or Supplier match with those specified associations on the T&Cs.  If a matching set of T&Cs is found: The system assigns this set of T&Cs to the PO. If multiple matching sets of T&Cs are found: The system assigns the first set from this list of T&Cs, to the PO. If no specific match is found: The system assigns the default set of T&Cs to the PO. In the case of the default T&Cs having specific Company Code and Supplier associations: The system treats the default T&Cs as universally applicable, ignoring any specific associations. What should the system do if there is only one set of T&Cs in the system without specific associations? The system automatically assigns this universal set of T&Cs to the PO. QA needs to test this with the Ad-hoc output flows.  The PO document needs to store which T&Cs have been applied to it. Because we have to display them on the UI. So the PO needs to show whatever the state of the T&Cs was when the PO was sent to the vendor.  When returning multiple T&Cs from the BE, the system should sort the returned results based on creation date in ASC order.    Question Answer Q asked by … Q asked on … A provided by … A provided on …",
        "status": "Released",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-18T03:23:02.095-0800",
        "issue_type": "Story",
        "parent_id": "VZI-95348"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-26686",
      "released_in_current_rc": false,
      "summary": "Vroozi Health Check",
      "description": "Health Check Architecture Diagram",
      "status": "In Final Review",
      "assignee": "Qazi Asad Ullah",
      "created": "2017-08-24T23:18:52.826-0700"
    },
    "issues": [
      {
        "key": "VZI-99709",
        "summary": "Make HealthCheck a separate API/Utility and Integrate it with existing HealthCheck implementations",
        "description": "We need to create a plug-able utility for health-check functionality. Any project that needs to check health of different services and/or data sources like MONGO, SOLR, AMAZON_SQS, EMAIL etc, will pass the service name with type and URLs to this utility and it will behind the scene interact with the given services and respond accordingly.",
        "status": "Done",
        "assignee": "Qazi Asad Ullah",
        "created": "2024-05-22T05:02:24.141-0700",
        "issue_type": "Task",
        "parent_id": "VZI-26686"
      },
      {
        "key": "VZI-99472",
        "summary": "Tax-Integration : Provide health check facility",
        "description": "Implement Health Check for Tax-Integration API. The API should provide health status by hitting the endpoint for the Data Sources and Services provided below. Endpoint Type: GET Endpoint Name:  http://localhost:9294 / health-check Data Sources: MongoDB Services:  N/A",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2024-05-15T01:41:04.084-0700",
        "issue_type": "Story",
        "parent_id": "VZI-26686"
      },
      {
        "key": "VZI-61513",
        "summary": "Health Check For Document-History-API",
        "description": "Implement Health Check for document-history-API. The API should provide health status by hitting the endpoint for the Data Sources and Services provided below. Endpoint Type: GET Endpoint Name:  http://localhost:8888/ health-check Data Sources: MongoDB Services:  N/A",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2020-07-02T02:03:29.924-0700",
        "issue_type": "Story",
        "parent_id": "VZI-26686"
      },
      {
        "key": "VZI-30568",
        "summary": "Make HealthCheck a separate API/Utility and Integrate it with existing HealthCheck implementations",
        "description": "We need to create a plug-able utility for health-check functionality. Any project that needs to check health of different services and/or data sources like MONGO, SOLR, AMAZON_SQS, EMAIL etc, will pass the service name with type and URLs to this utility and it will behind the scene interact with the given services and respond accordingly.",
        "status": "Abandoned",
        "assignee": "Qazi Asad Ullah",
        "created": "2017-12-04T05:12:06.679-0800",
        "issue_type": "Story",
        "parent_id": "VZI-26686"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99543",
      "released_in_current_rc": false,
      "summary": "Vulnerability assessment - SBOM generation and vulnerabilities fixes",
      "description": "The scope of this epic includes but not limited to  Generating SBOM of our complete application. Evaluating SBOM generated files to identify any vulnerabilities within our project using tools e.g.  dependency track . Evaluate and fix any identified vulnerabilities wherever possible.",
      "status": "In Design",
      "assignee": "Qazi Asad Ullah",
      "created": "2024-05-16T09:30:40.706-0700"
    },
    "issues": [
      {
        "key": "VZI-99560",
        "summary": "SBOM: List all updatable vulnerabilities into a sheet",
        "description": "Generate sbom files for all the projects/microservices that vroozi uses. RnD on a tool that can merge multiple sbom files into one. RnD on a tool that can provide a visual representation of the generated sbom files. Deploy and test. https://docs.google.com/spreadsheets/d/1cB5bD3350YPldyQxYM0PNv79gI16TeiWOZkAfdQe1L4/edit#gid=0",
        "status": "Done",
        "assignee": "Ghulam Mustafa",
        "created": "2024-05-16T23:46:32.745-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99543"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-54074",
      "released_in_current_rc": false,
      "summary": "angular-upgrade: All the work related to Angular Upgrade ",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Jaroslav Bellus",
      "created": "2019-10-08T00:36:09.692-0700"
    },
    "issues": [
      {
        "key": "VZI-99556",
        "summary": "Upgrade VziForwardRequestButton, RejectRequestButton, ApproveRequestButton and its dependencies",
        "description": "Fully upgrade forwardRequestButton, RejectRequestButton, ApproveRequestButton and its dependencies into a single component (vziActionButtonComponent).",
        "status": "Done",
        "assignee": "majid.akram",
        "created": "2024-05-16T23:38:26.948-0700",
        "issue_type": "Task",
        "parent_id": "VZI-54074"
      },
      {
        "key": "VZI-91946",
        "summary": "[ng2] Upgrade Side Bar ng1 directives and components into a single ng2 component",
        "description": "Goal Upgrade directives  sidebar ,  sdmSidebar ,  adminNavLeft  and component  vzi-supplier-portal-sidebar  into a single new side bar ng2 component together with its all child components and services. Consider merging directive  offCanvasMenu  into a new component if it makes sense. Refactor the code so the template is generated based on the configuration, i.e. do not include any logic in the template checking the feature toggles or roles. Impacted Areas Admin side panel Shopper side panel SDM side panel SP side panel Example Admin side panel Tasks: Upgrade all components, services that are used by the component, with all functions (even those functions which are not used in the component) Upgrade related Unit tests and add if some are missing Make sure we are not using promises anymore but rather rxjs (including the component) If applicable, move all styles related to this component into local styles file Dev test the changes to make sure component works as before If ng1 components are no longer used, uncomment its usages, specs and styles Update ng2 angular sheet Dev Notes Important:  Try to break the work into multiple PRs so that there are at least one or two PRs each week. The final PR should make the new components to be used in the page, so we don't break anything while continually merging the previous PRs",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2023-09-19T14:20:35.685-0700",
        "issue_type": "Story",
        "parent_id": "VZI-54074"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99310",
      "released_in_current_rc": false,
      "summary": "Vroozi API Usages Plan - Setup and Configuration",
      "description": "",
      "status": "Open",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-05-09T16:57:35.709-0700"
    },
    "issues": [
      {
        "key": "VZI-99313",
        "summary": "Configure new usage plan to existing API keys",
        "description": "Requirements: After we have the usage plan created for each client (Unit ID), we will associate existing API keys for each client to the newly created usage plan and test the API with rate limit to throttle the request. Verification Steps: Existing API keys should work with the new Usage plan Usage plan should restrict client access according to the limitation e.g daily, weekly, monthly request limits. Rate and burst limits.  Note: We will do the testing in test environment first.",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-09T17:03:07.805-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99310"
      },
      {
        "key": "VZI-99312",
        "summary": "Create new usage plan for each client (UNIT ID) using API",
        "description": "Requirements: We will create a usage plan for each production client (Unit ID) in AWS API gateway from the list added here    Note: We will do the testing in test environment first with couple of unitIds.",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-09T17:00:28.300-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99310"
      },
      {
        "key": "VZI-99311",
        "summary": "Prepare list of clients using Vroozi API",
        "description": "Requirements: Prepare the list of all clients using Vroozi API with all the endpoints and App Name used and update in the sheet provided below.   List of unitIds where integation app is enabled. \"76\", \t\t\"129\", \t\t\"130\", \t\t\"160\", \t\t\"51\", \t\t\"175\", \t\t\"199\", \t\t\"190\", \t\t\"127\", \t\t\"196\", \t\t\"128\", \t\t\"80\", \t\t\"224\", \t\t\"215\", \t\t\"225\", \t\t\"210\", \t\t\"226\", \t\t\"223\", \t\t\"91\", \t\t\"230\", \t\t\"228\", \t\t\"234\", \t\t\"232\", \t\t\"241\", \t\t\"246\", \t\t\"98\", \t\t\"247\", \t\t\"240\", \t\t\"245\", \t\t\"248\", \t\t\"249\", \t\t\"239\", \t\t\"250\", \t\t\"251\", \t\t\"268\", \t\t\"54\", \t\t\"242\", \t\t\"270\", \t\t\"272\", \t\t\"273\", \t\t\"237\"",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-09T16:59:21.250-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99310"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99275",
      "released_in_current_rc": false,
      "summary": "NBCU/USJ Interface Migration: Master Data Phase I - Supplier API",
      "description": "",
      "status": "In Final Review",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-05-08T23:26:02.081-0700"
    },
    "issues": [
      {
        "key": "VZI-99307",
        "summary": "NBCU Support - Implement datafix to support API updates for supplier records",
        "description": "Requirements: We need to write a data script to allow updating of existing supplier created via UI/ActiveMQ using Vroozi API.  As reviewed, we are currently facing issues due to missing auditInfo object in the supplier records, so we need to fix the data for now by adding auditInfo object with VROOZI_API. UNIT_ID = 54 and 160",
        "status": "Done",
        "assignee": "Sambhu Sai",
        "created": "2024-05-09T15:13:11.689-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99275"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99132",
      "released_in_current_rc": false,
      "summary": "User profile enhancements 2024: OOO, Alternate Approver, & Change History.",
      "description": "This Epic encompasses various User Profile Enhancements for 2024, focusing on Out of Office (OOO) & Alternate Approver functionalities for Approvers, and the implementation of a comprehensive Change History feature. These enhancements aim to empower Admin users with the ability to manage Approvers' OOO settings, designate Alternate Approver and Alternate Buyer from the user settings itself, while also providing a transparent record of all changes made to user profiles for accountability and auditing purposes. Admins can access and maintain Approver’s OOO settings. Admins can access and maintain Approver’s Alternate Approver settings. Admins can access and maintain Buyer’s Alternate Buyer settings. Support for User change history.",
      "status": "Work Completed",
      "assignee": "Sujoy Kar",
      "created": "2024-05-06T09:20:30.713-0700"
    },
    "issues": [
      {
        "key": "VZI-99136",
        "summary": "PMAN: Integrate Alternate Approver and Alternate Buyer settings in User's Basic Info Tab.",
        "description": "Business Case : As an  Admin , I should be able to manage and control a user’s  Alternate Approver  and  Alternate Buyer  settings in a user’s profile within the Master Data user settings. These settings will be relocated to the Basic Info tab. Acceptance Criteria : What is the change?  As an  Admin , I should have the capability to control and manage the Alternate Approver and Alternate Buyer settings for users within Master Data. Which Customer should this change impact?  All Customers. What pages should this change impact?  Master Data > Users. Which users should be impacted by the change?  Admins. How should this change work? Admins  should be able to access and modify the Approver's  Alternate Approver  setting and the Buyer's  Alternate Buyer  setting from the Basic Info tab within the Master Data user settings. Alternate Approver  field should be available in the  Basic Info Tab  under the  Approval Settings  section. The users who have access to the Alternate Approver field: Financial Approver. Payment Request Approver ( assuming cause it is tied to the Financial Approver role ) Sourcing Approver. Alternate Approver  field should pop up accordingly under the  Approval settings  depending on whether the client is using the Old Approval WF or New Dynamic WF. Add a  new section  called as the  Buyer Settings  before My System Defaults. Alternate Buyer  field should be available in the  Basic Info Tab  under the  Buyer Settings  section. Buyer settings  section should only show up if the user has  Buyer  role. Ensure that both Alternate Approver and Alternate Buyer fields are implemented as  typeaheads . Similar implementation to what we are doing in this ticket  -    Do we need a data fix for existing customers?  No. Would this change impact existing documents?  No. To which teams should this change be communicated to?  All. Questions : Question # AC # Raised By Inquiry Date Assignee Response Date",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-06T15:32:24.692-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99132"
      },
      {
        "key": "VZI-99135",
        "summary": "PMAN: Functional Requirements for Delegation Tab in User Settings",
        "description": "Business Case : The  Delegation Tab  within the user settings should focus on the accessibility and functionality tailored towards the organizational use of the Out of Office (OOO) settings. The Delegation Tab will allow  Admins  to manage OOO settings efficiently, depending on the customer’s adoption of the OOO settings. Acceptance Criteria : What is the change?  As an  Admin , I should have the capability to control and manage the Out of Office (OOO) settings for users within Master Data. Additionally, the availability of the Delegation Tab should be  conditional , depending on the company’s OOO settings and the user’s role. Which Customer should this change impact?  All Customers. What pages should this change impact?  Master Data > Users. Which users should be impacted by the change?  Admins. How should this change work? As an  Admin , I should be able to control and manage OOO settings for users within Master Data using the Delegation Tab. Delegation Tab  should contain the OOO settings pertaining to that user depending on their user role. The migration of these settings should not disrupt existing OOO functionality or data integrity within the system . As an  Admin , I should see  Text #1  below the Calendar as - “ Adjust Out of Office Settings ”” As an  Admin , I should see  Text #2  below the Calendar as - “Enable the user's Out of Office functionality to ensure that their approvals receive the appropriate attention while they're away.” The OOO changes made by the  Admin  should apply to the user’s profile when they click on  Save User  button . If the OOO toggle is  ON  but mandatory fields are empty or invalid, then the  Save User  button should be  disabled . Once the  Admin  fills in all the mandatory fields, then the  Save User  button should become  active  again . In Company > Workflow, under Financial and Invoice Approval Workflow,  If the customer has the “ Enable Out of Office for Approvers ” toggle  Disabled , then keep the Delegation Tab  disabled  for all users. If the customer has the “ Enable Out of Office for Approvers ” toggle  Enabled , then the Delegation Tab should be enabled for users with certain roles. Delegation Tab  enabled  for: Financial Approver. Payment Request Approver ( assuming cause it is tied to the Financial Approver role ). Sourcing Approver. Accounts Payable Approver. Delegation Tab  disabled  for: All other user roles who do not have approval rights and for whom Out Of Office settings are not applied. When the Delegation Tab is  disabled  and the Admin clicks or hovers over this disabled Delegation Tab, then show them a tool tip indicating - Out of Office functionality is not applicable . ( Based on feedback provided on 5/9/2024 ) Reference  -  Check how the Custom fields tab works in a PR line item if there are no custom fields associated with the line item . Do we need a data fix for existing customers?  No. Would this change impact existing documents?  No. To which teams should this change be communicated to?  All. Questions : Question # AC # Raised By Inquiry Date Assignee Response Date  Should we change the tooltip message to - “ Delegation settings are disabled as Out of Office functionality is not applicable ”?  Yes, we should change the tooltip message when the Delegation Tab is disabled.  Some suggestions are - “ Delegation settings are disabled as Out of Office functionality is not applicable ” (that you guys suggested) \" Delegation settings are not applicable and have been disabled. \" \" Out Of Office settings are not applicable, hence this tab is disabled. \" I am leaning towards the 2nd option as it is a much shorter tooltip message but please feel free to provide your suggestion(s).    /     5/6/2024      5/7/2024 Delegation Info  or just  Out of Office   Info  tab name? Decided to go with Delegation Info name for now.   5/7/2024   5/9/2024 Do we disable OOO once the ending date is passed or do we need to show error on the dates when they are invalid? This is something I’ll have to discuss with   to understand if we need to change this behavior or not. Although I agree keeping the OOO settings still ON even after passing the end date doesn’t make sense.   5/15/2024  /    5/21/2024",
        "status": "Released",
        "assignee": "Asma Latif",
        "created": "2024-05-06T14:45:18.278-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99132"
      },
      {
        "key": "VZI-99134",
        "summary": "PMAN: Organize User settings in Master Data into multiple Tabs.",
        "description": "Business Case : Restructure the User settings within Master Data to feature multiple tabs, including  BASIC INFO  &  DELEGATION INFO , to enhance organization and usability. Acceptance Criteria : What is the change?  User settings in Master Data will be re-organized by splitting the interface into two distinct tabs: ' BASIC INFO ' and ' DELEGATION INFO '. Previously, the User settings were presented in a single section without tabs, which contained all user-specific data. This change will create a more structured and navigable layout. Which Customer should this change impact?  All customers. What pages should this change impact?  Master Data > Users. Which users should be impacted by the change?  Admins. How should this change work? Introduce 2 tabs in the User settings: BASIC INFO. DELEGATION INFO. BASIC INFO  should contain all the existing user settings such as: Basic Information. Roles. Dashboard. Approval Settings. Productions (SDM) My System Defaults. Access. Document Defaults. BASIC INFO  tab should always be the 1st accessible tab when the Admin opens the user’s profile. Reference  -  You can check how the supplier records have been designed in Master Data > Suppliers section for inspiration . DELEGATION INFO  tab should contain the Out Of Office (OOO) settings that an Admin can control: Re-use the OOO settings layout that we use in the Approver’s profile into the Delegation Info section (if possible). The implementation for the OOO settings will be done in this ticket -    Footer buttons  should be consistent and visible on both the BASIC INFO & DELEGATION INFO tab. Do we need a data fix for existing customers?  No. Would this change impact existing documents?  No. To which teams should this change be communicated to?  Purchase Team. Questions : Question # AC # Raised By Inquiry Date Assignee Response Date Should we change the “ Going to vacation? ” text on the Admin view side settings? Yes, we should change the “ Going to Vacation text ” on the Admin view side. Some suggestions are -  “ Adjust Out of Office Settings ” “ Modify Vacation Settings ” \"Configure Out of Office\" I am leaning towards the 1st option but please feel free to provide your suggestion(s).    /     5/6/2024      5/7/2024",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-06T14:01:08.586-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99132"
      },
      {
        "key": "VZI-99133",
        "summary": "PMAN: Change dropdown to typeahead field - Alternate Approver & Specific Approver (in OOO setting).",
        "description": "Business Case : Replace existing dropdown menus with  typeahead  fields for selecting Alternate Approvers, and Specific Approvers in the Out of Office (OOO) settings. Acceptance Criteria : What is the change?  Financial Approvers, Sourcing Approvers and AP Approvers should have the ability to search for Alternate Approvers or Specific Approvers in the Out of Office (OOO) settings by typing in the name directly, instead of using the dropdown menu to find their delegated approver. Which Customer should this change impact?  All customers. What pages should this change impact?  User profile > Approval Settings. Which users should be impacted by the change?  Financial Approver (including Payment Request approver), Sourcing Approver and AP Approver. How should this change work? Replace dropdown menus with a  typeahead  field for the following field in the Approval settings within the user profile settings. - Alternate Approver . Users affected by this change: Financial Approver. Payment Request Approver. Sourcing Approver. Specific Approver  ( Who should handle your approvals, while you're gone? ) in the Out of Office settings: Users affected by this change: Financial Approver. Payment Request Approver. Sourcing Approver. AP Approver. Example / templates for reference : {Old Implementation} : {New Change} : Do we need a data fix for existing customers?  No. Would this change impact existing documents?  No. To which teams should this change be communicated to?  Purchase Team. Questions : Question # AC # Raised By Inquiry Date Assignee Response Date",
        "status": "Released",
        "assignee": "Aqsa Rani",
        "created": "2024-05-06T10:01:43.511-0700",
        "issue_type": "Story",
        "parent_id": "VZI-99132"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-96284",
      "released_in_current_rc": false,
      "summary": "Vroozi API Documentation Update",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-02-12T23:19:52.275-0800"
    },
    "issues": [
      {
        "key": "VZI-98924",
        "summary": "Investigate on upgrade requirements to upgrade Vroozi API documentation to the latest Version OpenAPI",
        "description": "Requirements: Investigate latest version of OpenAPI and document AWS API Gateway support for OpenAPI Document migration requirements to upgrade Vroozi API from current swagger 2.0 version to OpenAPI 3+ Breakdown work object to plan the migration and size the effort including providing multiple sample examples per endpoint for different use-cases Note: The newer version of Open API supports sample examples per endpoints and it also allows for multiple examples per endpoint which would be useful for our usecases. We need to check this version is supported by AWS API Gateway and can be deployed there.",
        "status": "Investigation Done",
        "assignee": "Sambhu Sai",
        "created": "2024-04-25T22:51:26.757-0700",
        "issue_type": "Spike",
        "parent_id": "VZI-96284"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-98632",
      "released_in_current_rc": false,
      "summary": "Integration Legacy Issues -> RC-2024-5",
      "description": "",
      "status": "In Final Review",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-04-22T01:09:35.253-0700"
    },
    "issues": [
      {
        "key": "VZI-98908",
        "summary": "\"PO Confirmation Template\" and \"ASN Template\" cXML Sample Templates are not working",
        "description": "Pre-Condition: Domain URL:   Vroozi CXML Setup screen username:  notifyvroozi83@gmail.com Password: Welcome1 Steps to reproduce: Navigate to the Documents → cXML Setup Click on the \"PO Confirmation Template\" button  Actual Result: Expected Result: Sample Response should be appeared on the \"PO Confirmation Template\"and \"ASN Template\" screen",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-04-25T07:23:25.314-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-98632"
      },
      {
        "key": "VZI-98281",
        "summary": "PO Submission Error Message is not appearing on the UI",
        "description": "UI: DB:",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-04-09T13:26:27.582-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-98632"
      },
      {
        "key": "VZI-98280",
        "summary": "Investigate if Supplier support PO change flag is used when submitting PO cancelation request via cXML",
        "description": "",
        "status": "Investigation Done",
        "assignee": "Sambhu Sai",
        "created": "2024-04-09T13:25:15.182-0700",
        "issue_type": "Spike",
        "parent_id": "VZI-98632"
      },
      {
        "key": "VZI-98050",
        "summary": "Change Request - Sourcing Approver can't see Approve or Reject buttons on Change Request",
        "description": "Issue: Change Request - Sourcing Approver can't see Approve or Reject buttons on Change Request Server: URL: stage-go.vroozi.com Username: zulkiful.bajwa+BuyerSAStage85NBCU@vroozi.com Password: @Welcome1 Pre-Condition: 1. NBCU configurations are enabled 2. Sourcing and Financial Workflow is enabled 2. Purchase Request (1000000346) has been created 3. Purchase Order (5100000101) has been created against above Purchase Request 4. Do POCR and Change Request (11000000114) has been created which goes to Sourcing Approver for approval Step to Reproduce: 1. Login to PMAN as a Sourcing Approver 2. Load above Change Request (11000000114) and Approve it; Change Request goes for Financial Review 3. Reject this Change Request through Status Update public API {\n    \"id\": \"\",\n    \"externalId\": null,\n    \"docNo\": \"11000000114\",\n    \"comments\": \"Successfully rejected\",\n    \"status\": \"REJECTED\"\n} Login to PMAN as a Requester and Re-submit the Change Request which goes for Sourcing Review Login to PMAN as a Sourcing Approver Load above Change Request (11000000114) and Verify Approve and Reject buttons Actual Result: System doesn’t show Approve and Reject buttons to the Sourcing Approver on that Change Request Expected Result: System should show Approve and Reject buttons",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-03-28T23:48:21.722-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-98632"
      },
      {
        "key": "VZI-95136",
        "summary": "When budget approver rejects CR via email employee user is unable to resubmit that CR",
        "description": "Server Stage unit id 10 Steps to Reproduce: Login from employee generate over budget CR and submit it to budget approver Login to mailing address of budget approver and from the email reject the CR Now, login from employee and open the PO of the rejected CR Click on glyph and select change order  Expected Result: System should allow user to perform POCR again Actual  Result: System giving error message that change request is in progress",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-01-12T03:47:35.826-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-98632"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-76095",
      "released_in_current_rc": false,
      "summary": "SOC1 Vulnerabilities PMAN & SmartOCI",
      "description": "",
      "status": "Open",
      "assignee": "Qazi Asad Ullah",
      "created": "2022-04-14T01:47:35.953-0700"
    },
    "issues": [
      {
        "key": "VZI-98902",
        "summary": "Cross-site scripting (reflected) ( smartOCI )",
        "description": "The value of the  catalogId  request parameter is copied into the HTML document as plain text between tags. The url  /adminui/catalogDetail?catalogId=55799851e4b0c92916bb9a2168744%22%3balert(1)%2f%2f502 HTTP/2  was submitted in the  catalogId  parameter. This input was echoed as  f665l<script>alert(1)</script>gogwx  in the application's response. This proof-of-concept attack demonstrates that it is possible to inject arbitrary JavaScript into the application's response.",
        "status": "Released",
        "assignee": "Abdullah iqbal",
        "created": "2024-04-25T05:24:43.324-0700",
        "issue_type": "Story",
        "parent_id": "VZI-76095"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-96075",
      "released_in_current_rc": false,
      "summary": "Vroozi Accounting Validation 2024: GA Support Release: Accounting Validation at Document Creation and Line Item Save",
      "description": "Vroozi Accounting Validation GA Phase#5 is post MVP phase(refer to  ) where it will become generally available for all the subscribed customers. In this phase, we will cover the following areas: Purchase Request Accounting Validation on PR Creation: Bulk Upload RFQ to PR Cart to PR API Blank PR template(not applicable) Accounting Validation at: Add/ Update line item Line item bulk upload Apply to All Purchase Order Accounting Validation on PO Creation: Creation from Buy Route Creation from PO wizard API Accounting Validation at Add/ Update line item Apply to All Apart from that, in this epic, we will improve the UX for the accounting validation process.",
      "status": "Open",
      "assignee": "Muhammad Ahmar Nadeem",
      "created": "2024-02-05T23:30:30.375-0800"
    },
    "issues": [
      {
        "key": "VZI-98825",
        "summary": "PMAN: Requester - Accounting Validation should run before Requesetr can select ad-hoc email..",
        "description": "Business Case: The system should run accounting validation before the requester can provide an ad-hoc email address. When a Requester opens a PR/CR document and clicks Submit button: Existing Implementation: When Requeseter clicks the Submit button on PR/CR document, the “Ad-hoc output method” modal is displayed.  The user provides the email and clicks Submit button, “Ad-hoc output method” modal is closed and Submit button changes its label to “Validating Data”. Once the accounting validation is successful, the user is redirected accordingly. Alternate flow: If the accounting validation fails, “View Error” label is displayed on the Submit button. On clicking “View Error” button, screen focus moves to the top of the line item grid where errors are displayed. General Rule for Running the Accounting Validation at Document Submission: Currently, the system is executing accounting validation after the Requester provides an Ad-hoc email address. After this change, the system will run accounting validation before the “Ad-hoc output method” modal is displayed.  Dynamic Submit button labels: Once the user clicks the  Submit  button on the PR/CR, the  Submit  button label should change to  Validating Data . Once the user clicks the  Submit  button, all other action buttons and fields on the PR/CR should become disabled. ( Existing implementation ) An  In Progress  Icon should be visible after the  Validating Data  label on the button. If user reloads the document in  Validating Data  state, and If the accounting validation is still in progress after the refresh or reload, The system should take the user to the  Validating Data  button. The system should navigate the user to the screen accordingly if the Accounting Validation is completed successfully. ( Existing implementation ) The system should change the button’s label from  Validating Data  to  View Error(s)  if the Accounting Validation is completed and error(s) are identified. Clicking on the  View Error(s)  button should scroll the user to the Accounting Validation Error(s) message box above the Line Item grid. Once the user clicks the  View Error(s)  button, the system should revert the label to  Submit . The  Submit  button should remain disabled until all the accounting Validation errors are resolved. ( Existing implementation ) If the user updates the document without clicking the  View Error(s)  button, the system should change the label of the button from  View Error(s)  to  Submit .  The Requester can do the following actions based on the permission. Change in Header level fields. Change in Header level custom fields. Update existing line items. (from all avenues) Add new line items(from all avenues) Add notes/supplier notes Highlight the Accounting Validation Error(s) message box: Once the system scrolls the user to the Accounting Validation Error(s) message box above the Line Item grid after the  View Error(s)  button is clicked, the borders of the Accounting Validation Error(s) message box should be highlighted. The highlighted border should fade away gradually. Silkscreen on the Line Item grid (PR/CR on Load): When the system loads the PR/CR and accounting validation is in progress, the system should display the silkscreen covering the line item grid. On the silkscreen, there should be a text  Validating Data  visible. An  In Progress  Icon should be visible after the text  Validating Data. The silkscreen should prevent the user from clicking anything from the line item grid. The system should disable all the action button(s) on the PR/CR while the accounting validation process is in progress. The user should be able to edit all the header-level fields and custom fields that do not directly impact the line items. In case of any update, the system should save the changes in those header and custom fields. The system should disable the header level field  Shipping Address  while the accounting validation process is in progress. (Please let me know if any other header level field that impacts the line items directly) Once the accounting validation process is completed: The silkscreen from the line item grid should disappear. All the action buttons should be enabled. All the disabled header fields should be enabled. “Ad-hoc Output Method” modal should be displayed. The user should be able to provide the email and click Submit button. On Clicking Submit button, user should be navigated to accordingly. The system should show the accounting string error message above the line item grid for the line items having invalid accounting strings. ( existing implementation ) All the requirements mentioned above requirements should be implemented for the following users who can take action on the PR/CR: Admin Requester",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-04-24T04:22:31.941-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96075"
      },
      {
        "key": "VZI-98820",
        "summary": "AccVal: Purchase/Payable: The accounting configuration should dictate which objects are in the Accounting Validation Error message.",
        "description": "Business Case: The accounting configuration service should dictate which organization/accounting objects are in the Accounting Validation Error message on the document. Acceptance Criteria: For the HEB MVP of Vroozi Accounting Validation, the four accounting and company objects were hardcoded in the accounting validation error message. Those Objects were the  Company Code ,  Cost Center ,  GL Account , and  Location . Now the problem is if a client configures fewer or more objects than the objects mentioned above and the validation service invalidates their accounting strings, the system will still show only the hard-coded objects.  The system should check the following factors to decide which accounting objects should be visible in the Accounting Validation Error message on the documents: The accounting/organization object is turned ON for the unitID. (Not required at this time)(Updated on )  The accounting/organization object is specified in the Accounting Configuration service. If the above two conditions are met, the system should show the accounting/organization objects and their values accordingly in the Accounting Validation Error message. If both or any of the conditions mentioned in point#1 are not met, the system should not show that accounting/organization objects in the Accounting Validation Error message",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-04-24T03:37:18.950-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96075"
      },
      {
        "key": "VZI-98815",
        "summary": "[Regression Testing] AccVal: AP: Line Item Modal: The system should run the accounting validation at the Line Item Modal.",
        "description": "Business Case: The system should run the accounting string validations at the Line Item modal. Acceptance Criteria: General Rule for Running the Accounting Validation at Document Creation: Currently, the system requires the definition of the required and optional Accounting/Organization objects in the  Accounting Validation Configuration Service . If the value in the optional field is given at the line item, the system considers it for the accounting validation in addition to the required fields. If the value in the optional field is not given at the line item, the system considers only the values in the required fields at the line item for the accounting validation. Based on that, the system decided what fields should be compared in the accounting validation with the accounting string master data. Accounting Validation at Line Item: The system should run the accounting validation as soon as it finds values in at least all the required fields for the  Accounting Validation Configuration Service  on the line item modal. If the system finds no accounting string errors, the system green message. The message should disappear in 3 seconds. If the system finds the accounting string errors, the system should show the following message This message should persist until the user resolves the issue. The system should run the accounting validation as soon as it finds values in all the required and optional fields for the  Accounting Validation Configuration Service  on the line item modal. If the system finds no accounting string errors, the system green message. The message should disappear in 3 seconds. If the system finds the accounting string errors, the system should show the following message This message should persist until the user resolves the issue. The error message should be as follows when the line item is not split. Accounting String Error  The following Accounting String has been deactivated  → Error Code 02 The following Accounting String is not valid (does not exist)  → Error Code 01 Company Code = <Code> - <Description> Plant Code = <Code> - <Description> Cost Center / WBS Element / Internal Order = <Code> - <Description> GL Account = <Code> - <Description> … (display the rest of the elements in the same order the line items in separate lines) There should be a separate error message for each invalid accounting string associated with different splits of line items. The following is the pattern of the error message that should be followed: Accounting String Error - split #…  → Display all splits of the item containing that Accounting String The following Accounting String has been deactivated  → Error Code 02 The following Accounting String is not valid (does not exist)  → Error Code 01 Company Code = <Code> - <Description> Plant Code = <Code> - <Description> Cost Center / WBS Element / Internal Order = <Code> - <Description> GL Account = <Code> - <Description> … (display the rest of the elements in the same order the line items in separate lines) The message should read “Accounting String Error - split # (comma separated).“. The message should read “Accounting String Error - split # (- separated).“ in case of splits in the sequence has the same accounting string error. The message should tell the user why the selected accounting string combination of the mentioned line items was marked invalid. Either the string was deactivated. Or the string does not exist in Vroozi Master Data. The message should display the associated accounting combination with the mentioned splits in the strings. Please review the error message that appears on the documents above the line item grid. The success and error messages should appear just above the  Save  and  Cancel  buttons. ( added on 2024-03-22 ) The system should keep the  Save  Item button disabled until the accounting validation error message persists. Please note that the R&D done so far does not show any instance in which a certain accounting object is required in the accounting configuration service and is optional on the line item modal.  So making this the basis for our assumption, we can say that the above scenario can happen technically but not practically. QA can run such scenarios in their testing activity.  In editing the line item, the system should only run the accounting validation if the user changes the fields required for the  Accounting Validation Configuration Service. The system should show the green message when no errors are found. The system should show the error message if invalid accounting strings are identified. If the line item already has the invalid accounting string, then opening its line item modal should show the accounting validation error message on it. (Not required at this time)(Updated on  2024-03-22 ) If there is any custom accounting validation error message that exits, it should also be visible on the Line Item modal with the main message. (refer to  ) ( Added on  2024-03-04  ) All AC points mentioned above should be implemented for the following documents where users can access the Line Item Modal. PR CR PO Create PO Wizard POCR All AC points mentioned above should be implemented for the following users who can take action on the documents listed above. Admin Requester Sourcing Approver (with Editing rights) Financial Approver (with Coding rights) Buyer Central Receiver Any other user( QA: Please do the impact analysis and let me know If I have missed any user ) Testing Strategy: ,  , Kindly document the testing Strategy here in the panel that how the team is going to cover all the mentioned documents and users while testing the Accounting Validation at  Line Item  Modal.",
        "status": "Done",
        "assignee": "Asma Latif",
        "created": "2024-04-24T03:12:50.900-0700",
        "issue_type": "Task",
        "parent_id": "VZI-96075"
      },
      {
        "key": "VZI-98256",
        "summary": "PMAN: Sourcing Approver - Accounting Validation should run before Sourcing Approver can select approval reason.",
        "description": "Business Case: The system should run accounting validation before sourcing approver can select reason for approval. When a Sourcing Approver open a PR/CR document and click Approve button: Existing Implementation: When Sourcing Approver clicks the Approve button on PR/CR document, “Approval Decision Code” modal is displayed.  User selects the decision code and clicks Submit button, “Approval Decision Code” modal is closed and Approve button changes its label to “Validating Data”. Once the accounting validation is successful, the user is redirected to “Approve Purchase Requests” grid. Alternate flow if the accounting validation fails, “View Error” label is displayed on the Approve button. On clicking “View Error” button, screen focus moves to top of the line item grid where errors are displayed. General Rule for Running the Accounting Validation at Document Approval: Currently, the system is executing accounting validation after Sourcing Approver selects approval decision. After this change, the system will run accounting validation before the “Approval Decision Code” modal is displayed.  Dynamic Approve button labels: Once the user clicks the  Approve  button on the PR/CR, the  Approve  button label should change to  Validating Data . Once the user clicks the  Approve  button, all other action buttons and fields on the PR/CR should become disabled. ( Existing implementation ) An  In Progress  Icon should be visible after the  Validating Data  label on the button. If user reloads the document in  Validating Data  state, and If the accounting validation is still in progress after the refresh or reload, The system should take the user to the  Validating Data  button. The system should navigate the user to the screen accordingly if the Accounting Validation is completed successfully. ( Existing implementation ) The system should change the button’s label from  Validating Data  to  View Error(s)  if the Accounting Validation is completed and error(s) are identified. Clicking on the  View Error(s)  button should scroll the user to the Accounting Validation Error(s) message box above the Line Item grid. Once the user clicks the  View Error(s)  button, the system should revert the label to  Approve . The  Approve  button should remain disabled until all the accounting Validation errors are resolved. ( Existing implementation ) If the user updates the document without clicking the  View Error(s)  button, the system should change the label of the button from  View Error(s)  to  Approve .  The Sourcing approver can do the following actions based on the permission. Change in Header level fields. Change in Header level custom fields. Update existing line items. (from all avenues) Add new line items(from all avenues) Add notes/supplier notes Highlight the Accounting Validation Error(s) message box: Once the system scrolls the user to the Accounting Validation Error(s) message box above the Line Item grid after the  View Error(s)  button is clicked, the borders of the Accounting Validation Error(s) message box should be highlighted. The highlighted border should fade away gradually. Silkscreen on the Line Item grid (PR/CR on Load): When the system loads the PR/CR and accounting validation is in progress, the system should display the silkscreen covering the line item grid. On the silkscreen, there should be a text  Validating Data  visible. An  In Progress  Icon should be visible after the text  Validating Data. The silkscreen should prevent the user from clicking anything from the line item grid. The system should disable all the action button(s) on the PR/CR while the accounting validation process is in progress. The user should be able to edit all the header-level fields and custom fields that do not directly impact the line items. In case of any update, the system should save the changes in those header and custom fields. The system should disable the header level field  Shipping Address  while the accounting validation process is in progress. (Please let me know if any other header level field that impacts the line items directly) Once the accounting validation process is completed: The silkscreen from the line item grid should disappear. All the action buttons should be enabled. All the disabled header fields should be enabled. “Approval Decision Code” modal should be displayed. User should be able to select the decision code and click Submit button. On Clicking Submit button, user should be navigated to “Approve Purchase Request” grid. The system should show the accounting string error message above the line item grid for the line items having invalid accounting strings. ( existing implementation ) All the requirements mentioned above requirements should be implemented for the following users who can take action on the PR/CR: Sourcing Approver",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-04-08T00:34:53.436-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96075"
      },
      {
        "key": "VZI-98026",
        "summary": "PMAN: Buyer route - Accounting Validation should run before the PO Output enhancement functionality.",
        "description": "Environment:  Stage, Unit ID: 2 User:   Notifyvroozi@gmail.com Pre Conditions: Login as Admin Navigate to Master Data>>Suppliers: Create a supplier and do not give supplier output method to that supplier user. Now, navigate to Documents  >> Settings  >>  Purchase Orders  >>  Under Purchase Order: Enable  Allow PO Submission without Supplier Output Method  toggle Enable  Allow PO submissions to Ad-hoc email Address  toggle Accounting String Validation functionality should be enabled from DB toggle. Steps to Reproduce: Navigate to Buyer Route → Create Order Create a PO. Click “Submit” / \"Save Final PO\" button. Actual Result: As soon as Buyer/Admin submits the PO, Submit button changes to “Validating data” and after a while changes back to Submit. Meanwhile the modal for “Missing pre-defined output method for this supplier” is displayed on top of Edit Purchase Order screen. Expected Results: Once user clicks “Submit” / \"Save Final PO\" button, Accounting Validation should run first. If there are accounting validation errors then the “View Error(s)” button should be displayed. Once user fixes the errors and again clicks “Submit” / \"Save Final PO\" button application should take user to “Missing pre-defined output method for this supplier” modal.       Alternate Case (if no accounting errors are found): Once user clicks “Submit” / \"Save Final PO\" button, Accounting Validation should run first. If there are No accounting validation errors then “Missing pre-defined output method for this supplier” modal should be displayed. Screenshot: cc:",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-03-28T00:15:00.268-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96075"
      },
      {
        "key": "VZI-96829",
        "summary": "AccVal: Line Item Modal: The system should run the accounting validation at the Line Item Modal.",
        "description": "Business Case: The system should run the accounting string validations at the Line Item modal. Acceptance Criteria: General Rule for Running the Accounting Validation at Document Creation: Currently, the system requires the definition of the required and optional Accounting/Organization objects in the  Accounting Validation Configuration Service . If the value in the optional field is given at the line item, the system considers it for the accounting validation in addition to the required fields. If the value in the optional field is not given at the line item, the system considers only the values in the required fields at the line item for the accounting validation. Based on that, the system decided what fields should be compared in the accounting validation with the accounting string master data. Accounting Validation at Line Item: The system should run the accounting validation as soon as it finds values in at least all the required fields for the  Accounting Validation Configuration Service  on the line item modal. If the system finds no accounting string errors, the system green message. The message should disappear in 3 seconds. If the system finds the accounting string errors, the system should show the following message This message should persist until the user resolves the issue. The system should run the accounting validation as soon as it finds values in all the required and optional fields for the  Accounting Validation Configuration Service  on the line item modal. If the system finds no accounting string errors, the system green message. The message should disappear in 3 seconds. If the system finds the accounting string errors, the system should show the following message This message should persist until the user resolves the issue. The error message should be as follows when the line item is not split. Accounting String Error  The following Accounting String has been deactivated  → Error Code 02 The following Accounting String is not valid (does not exist)  → Error Code 01 Company Code = <Code> - <Description> Plant Code = <Code> - <Description> Cost Center / WBS Element / Internal Order = <Code> - <Description> GL Account = <Code> - <Description> … (display the rest of the elements in the same order the line items in separate lines) There should be a separate error message for each invalid accounting string associated with different splits of line items. The following is the pattern of the error message that should be followed: Accounting String Error - split #…  → Display all splits of the item containing that Accounting String The following Accounting String has been deactivated  → Error Code 02 The following Accounting String is not valid (does not exist)  → Error Code 01 Company Code = <Code> - <Description> Plant Code = <Code> - <Description> Cost Center / WBS Element / Internal Order = <Code> - <Description> GL Account = <Code> - <Description> … (display the rest of the elements in the same order the line items in separate lines) The message should read “Accounting String Error - split # (comma separated).“. The message should read “Accounting String Error - split # (- separated).“ in case of splits in the sequence has the same accounting string error. The message should tell the user why the selected accounting string combination of the mentioned line items was marked invalid. Either the string was deactivated. Or the string does not exist in Vroozi Master Data. The message should display the associated accounting combination with the mentioned splits in the strings. Please review the error message that appears on the documents above the line item grid. The success and error messages should appear just above the  Save  and  Cancel  buttons. ( added on ) The system should keep the  Save  Item button disabled until the accounting validation error message persists. Please note that the R&D done so far does not show any instance in which a certain accounting object is required in the accounting configuration service and is optional on the line item modal.  So making this the basis for our assumption, we can say that the above scenario can happen technically but not practically. QA can run such scenarios in their testing activity.  In editing the line item, the system should only run the accounting validation if the user changes the fields required for the  Accounting Validation Configuration Service. The system should show the green message when no errors are found. The system should show the error message if invalid accounting strings are identified. If the line item already has the invalid accounting string, then opening its line item modal should show the accounting validation error message on it. (Not required at this time)(Updated on  ) If there is any custom accounting validation error message that exits, it should also be visible on the Line Item modal with the main message. (refer to  ) ( Added on   ) All AC points mentioned above should be implemented for the following documents where users can access the Line Item Modal. PR CR PO Create PO Wizard POCR All AC points mentioned above should be implemented for the following users who can take action on the documents listed above. Admin Requester Sourcing Approver (with Editing rights) Financial Approver (with Coding rights) Buyer Central Receiver Any other user( QA: Please do the impact analysis and let me know If I have missed any user ) Testing Strategy: ,  , Kindly document the testing Strategy here in the panel that how the team is going to cover all the mentioned documents and users while testing the Accounting Validation at  Line Item  Modal.",
        "status": "Released",
        "assignee": "Muhammad Sajid",
        "created": "2024-02-25T22:53:43.246-0800",
        "issue_type": "Story",
        "parent_id": "VZI-96075"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-98770",
      "released_in_current_rc": false,
      "summary": "cXML Legacy issues resolution - Part I",
      "description": "",
      "status": "Open",
      "assignee": "Sambhu Sai",
      "created": "2024-04-23T21:28:39.912-0700"
    },
    "issues": [
      {
        "key": "VZI-98771",
        "summary": "As a cXML processor, I should check `Accepts PO Change Request` flag on supplier record before sending PO update/cancel request",
        "description": "Acceptance Criteria: Accept PO Change Request flag should be enabled in the supplier record If the PO is updated or Canceled i.e POCR is performed in the Vroozi, we need to send the cxml to supplier only if this flag is enabled. If the flag is not enabled than the PO should be moved to Ordered status and no update should be sent to Supplier on the cxml order submission url. If PO is canceled and this flag is not enabled the cxml should not be sent to supplier. Cxml should only be sent when this flag is ON. Logs can be verified from the po-submission-service if the updated cxml is sent to supplier or Not. Use the following AWS account: vrqa",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-04-23T21:33:08.900-0700",
        "issue_type": "Story",
        "parent_id": "VZI-98770"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-99747",
      "summary": "RC-2024-5 - Payables: Release Management Activities",
      "description": "Goal Execute all activities, tasks related to the given release",
      "status": "Work Completed",
      "assignee": "Jaroslav Bellus",
      "created": "2024-05-22T23:21:45.538-0700",
      "issue_type": "Epic",
      "parent_id": null,
      "released_in_current_rc": true
    },
    "issues": [
      {
        "key": "VZI-98668",
        "summary": "Execute Post Production Testing (Asma)",
        "description": "",
        "status": "Done",
        "assignee": "Asma Latif",
        "created": "2024-04-22T23:29:45.479-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99747"
      },
      {
        "key": "VZI-98667",
        "summary": "Execute RC Regression (Aqsa)",
        "description": "",
        "status": "Done",
        "assignee": "Aqsa Rani",
        "created": "2024-04-22T23:29:45.431-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99747"
      },
      {
        "key": "VZI-98666",
        "summary": "Analyze and Strategize RC / Regression Testing Strategy",
        "description": "Impacted Areas of Payables RC Functionalities Impacted Area 1 Impacted Area 2 Impacted Areas of Other Teams RC Functionalities Purchase Team Impacted Area 1 Impacted Area 2 Integration Team Impacted Area 1 Impacted Area 2 Budget Team Impacted Area 1 Impacted Area 2",
        "status": "Abandoned",
        "assignee": "Asma Latif",
        "created": "2024-04-22T23:29:45.383-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99747"
      },
      {
        "key": "VZI-98665",
        "summary": "Execute RC Regression (Asma)",
        "description": "",
        "status": "Done",
        "assignee": "Asma Latif",
        "created": "2024-04-22T23:29:45.370-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99747"
      },
      {
        "key": "VZI-98664",
        "summary": "Update Release Execution Workbook",
        "description": "",
        "status": "Done",
        "assignee": "Jimena Pose",
        "created": "2024-04-22T23:29:45.341-0700",
        "issue_type": "Task",
        "parent_id": "VZI-99747"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-96278",
      "released_in_current_rc": false,
      "summary": "Vroozi API for Invoice Ingestion for processing - Phase I",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-02-12T22:59:44.657-0800"
    },
    "issues": [
      {
        "key": "VZI-97855",
        "summary": "As a system, I should be able to asynchronously process incoming invoice request sent via API with retry mechanism",
        "description": "Requirements: As part of processing the incoming invoice via API, we will cover the asynchronous processing of the request and display the incoming invoice details in the Inbox section in this ticket. Acceptance Criteria: When client sends invoice via incoming endpoints, the system should queue the request and send the incoming invoice for asynchronous processing. Once the async process starts, the system should update the status of the request appropriately so client system can track the progress of the processing via status tracking endpoints (previously implemented) Once the process is complete, system should display the incoming invoice into the Invoice Inbox section in the UI ( For auto-creation of invoice OFF usecase ) If the process fails for any reason and the invoice metadata cannot be generated, the system should update the status of the request to indicate failure with proper error message.  If there is a failure related to network issues, system should be able to retry again for predefined number of times before failing the entire process. If the failure is due to data related issues where automatic retry is not applicable, the system should not do retry. Technical Details: We will use SQS for queuing request similar to cxml process Queue Name: int-vroozi-api-invoice-incoming-queue When request is received and validated, the transmission payload with only required details from incoming request payload should be send to the queue We will implement listener to process the incoming request in the background and convert and store it to incoming document metadata collection for further processing Source of this document in metadata collection should be called VROOZI_API",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-03-21T21:35:51.612-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96278"
      },
      {
        "key": "VZI-97854",
        "summary": "As a client, I should be able to send and receive update on originating invoice via API for processing",
        "description": "Requirements: We need to expose new endpoints to accept the incoming Invoice for aysnc processing and providing status update on processing results Acceptance Criteria: 1- Expose the new end point to send the invoice payload `v1/invoices/incoming/async` This end point will accept InvoiceModel as payload. Request payload:         {\n            \"id\": \"65646e52c508ee6ca4cc4edc\", // read only\n            \"externalId\": null,\n            \"dateCreated\": \"2023-11-27T10:24:18.730+0000\", // read only\n            \"lastUpdated\": \"2023-11-30T17:09:38.676+0000\", // read only\n            \"attachments\": [\n                {\n                    \"id\": \"5f8078e15711ba6b0123bd26\",\n                    \"name\": \"devQA14 - EDI_Bajwa-000002031_10-09-2020.pdf\",\n                    \"size\": 253442,\n                    \"primary\": true\n                }\n            ], // read only but for the POST API // need to provide this as id or name in the POST API\n            \"documentConfigurations\": { // Need to add support for these configurations.\n                \"distributionSettings\": {\n                    \"taxDistributionType\": \"EQUALLY_BETWEEN_LINE_ITEMS\",\n                    \"shippingDistributionType\": \"EQUALLY_BETWEEN_LINE_ITEMS\",\n                    \"discountDistributionType\": \"EQUALLY_BETWEEN_LINE_ITEMS\"\n                },\n                \"decimalSettings\": {\n                    \"minFractionDigits\": 2,\n                    \"maxFractionDigits\": 2,\n                    \"roundItemSubtotal\": true\n                }\n            },\n            \"status\": \"DRAFT\",\n            \"currency\": \"USD\", // should be selected by default, or use can specify one code from existing codes\n            \"invoiceNumber\": \"9000004717\", // read only\n            \"purchaseOrderRef\": { //\n                \"id\": \"65646cdcc508ee6ca4cc4eae\",\n                \"externalId\": null,\n                \"docNo\": \"2000005852\",\n                \"label\": \"2000005852 - Jhon Doe 1000019675\",\n                \"type\": \"PurchaseOrderModel\",\n                \"archived\": false\n            },\n            \"purchaseRequestRef\": { // read only\n                \"id\": \"65646ccbc508ee6ca4cc4eac\",\n                \"externalId\": null,\n                \"docNo\": \"1000019675\",\n                \"label\": \"1000019675 - Jhon Doe 1000019675\",\n                \"type\": \"PurchaseRequestModel\",\n                \"archived\": false\n            },\n            \"userRef\": {\n                \"id\": \"13990\",\n                \"externalId\": null,\n                \"docNo\": \"sahar.ali+jhon.doe.ap.manager@vroozi.com\",\n                \"label\": \"Jhon  Doe AP Manager\",\n                \"type\": \"UserModel\",\n                \"archived\": false\n            },\n            \"items\": [\n                {\n                    \"id\": \"65646e59c508ee6ca4cc4ee1\",\n                    \"lineNumber\": \"65646e59c508ee6ca4cc4ee1\",\n                    \"poLineNumber\": 1,\n                    \"poLineItemId\": \"19636\",\n                    \"description\": \"test1\",\n                    \"quantity\": 5,\n                    \"unitOfMeasure\": \"EA\",\n                    \"taxCodeRef\": {\n                        \"id\": \"63ecda7bc508ee46ca611963\",\n                        \"externalId\": null,\n                        \"docNo\": \"JD-Tax\",\n                        \"label\": \"JD-Tax - Jhon Doe tax\",\n                        \"type\": \"TaxCodeModel\",\n                        \"archived\": false\n                    },\n                    \"taxAmount\": 6.00,\n                    \"taxPercentage\": 12.00,\n                    \"shippingCharges\": 0,\n                    \"currencyCode\": \"USD\",\n                    \"plantCodeRef\": {\n                        \"id\": \"64d4ec30c508ee3d732a578b\",\n                        \"externalId\": null,\n                        \"docNo\": \"JD-PC\",\n                        \"label\": \"JD-PC - Jhon Doe Plant Code\",\n                        \"type\": \"PlantCodeModel\",\n                        \"archived\": false\n                    },\n                    \"poLineItem\": { // read only\n                        \"id\": \"19636\",\n                        \"accountDistributionList\": [\n                            {\n                                \"glAccountRef\": {\n                                    \"id\": \"63eca162c508ee46ca0abf56\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-GL\",\n                                    \"label\": \"JD-GL - Jhon Doe - Ledger\",\n                                    \"type\": \"GlAccountModel\",\n                                    \"archived\": false\n                                },\n                                \"charge\": null,\n                                \"costObjectRef\": {\n                                    \"id\": \"63eca1ecc508ee46ca0abfd5\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-CC\",\n                                    \"label\": \"JD-CC - Jhon Doe Cost Center\",\n                                    \"type\": \"CostCenterModel\",\n                                    \"archived\": false\n                                },\n                                \"customerRef\": {\n                                    \"id\": \"63ecda59c508ee46ca0b1a0f\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-Cust\",\n                                    \"label\": \"JD-Cust - Jhon Doe Customer\",\n                                    \"type\": \"CustomerModel\",\n                                    \"archived\": false\n                                },\n                                \"companyCodeRef\": {\n                                    \"id\": \"3127\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-CC\",\n                                    \"label\": \"JD-CC - Jhon Doe Company Code\",\n                                    \"type\": \"CompanyCodeModel\",\n                                    \"archived\": false\n                                },\n                                \"classRef\": {\n                                    \"id\": \"63eca2a4c508ee46ca0ac057\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-Class\",\n                                    \"label\": \"JD-Class - Jhon Doe Class\",\n                                    \"type\": \"ClassModel\",\n                                    \"archived\": false\n                                },\n                                \"projectRef\": {\n                                    \"id\": \"63eca2e0c508ee46ca0ac0e2\",\n                                    \"externalId\": null,\n                                    \"docNo\": \"JD-P\",\n                                    \"label\": \"JD-P - Jhon Doe Project\",\n                                    \"type\": \"ProjectModel\",\n                                    \"archived\": false\n                                },\n                                \"locationRef\": null,\n                                \"locationTypeRef\": null,\n                                \"budgetRef\": null,\n                                \"profitCenter\": \"JD-PC\",\n                                \"splitPercent\": null,\n                                \"distributedAmount\": null,\n                                \"distributedTax\": null,\n                                \"distributedShippingCharges\": null,\n                                \"distributedTotalAmount\": null,\n                                \"distributedUseTax\": null,\n                                \"distributedDiscountAmount\": null\n                            }\n                        ],\n                        \"taxAmount\": 6,\n                        \"dateCreated\": null,\n                        \"lastUpdated\": null,\n                        \"buyerGroupRef\": {\n                            \"id\": \"64d4ed0dc508ee3d73bffaf0\",\n                            \"externalId\": null,\n                            \"docNo\": \"JD-BG\",\n                            \"label\": \"JD-BG\",\n                            \"type\": \"BuyerGroupModel\",\n                            \"archived\": false\n                        },\n                        \"category\": \"10000000\",\n                        \"companyCodeRef\": {\n                            \"id\": \"3127\",\n                            \"externalId\": null,\n                            \"docNo\": \"JD-CC\",\n                            \"label\": \"JD-CC - Jhon Doe Company Code\",\n                            \"type\": \"CompanyCodeModel\",\n                            \"archived\": false\n                        },\n                        \"currency\": \"USD\",\n                        \"description\": \"test1\",\n                        \"notes\": null,\n                        \"purchasingOrgRef\": {\n                            \"id\": \"63eca04fc508ee46ca0abe76\",\n                            \"externalId\": null,\n                            \"docNo\": \"JD-PO\",\n                            \"label\": \"JD-PO - Jhon Doe Purchasing Organization\",\n                            \"type\": \"PurchasingOrganizationModel\",\n                            \"archived\": false\n                        },\n                        \"plantCodeRef\": {\n                            \"id\": \"64d4ec30c508ee3d732a578b\",\n                            \"externalId\": null,\n                            \"docNo\": \"JD-PC\",\n                            \"label\": \"JD-PC - Jhon Doe Plant Code\",\n                            \"type\": \"PlantCodeModel\",\n                            \"archived\": false\n                        },\n                        \"itemDetailUrl\": null,\n                        \"taxCodeRef\": {\n                            \"id\": \"63ecda7bc508ee46ca611963\",\n                            \"externalId\": null,\n                            \"docNo\": \"JD-Tax\",\n                            \"label\": \"JD-Tax - Jhon Doe tax\",\n                            \"type\": \"TaxCodeModel\",\n                            \"archived\": false\n                        },\n                        \"taxPercentage\": 12.00,\n                        \"uom\": \"EA\",\n                        \"type\": \"PRODUCT\",\n                        \"accountDistributionType\": \"none\",\n                        \"agreement\": null,\n                        \"agreementItemNumber\": null,\n                        \"externalRequestItemNumber\": \"00001\",\n                        \"longDescription\": null,\n                        \"quantity\": 5,\n                        \"dynamicFields\": [],\n                        \"quote\": null,\n                        \"validFrom\": null,\n                        \"validTo\": null,\n                        \"unitPrice\": 10,\n                        \"priceUnit\": 1,\n                        \"serviceStartDate\": null,\n                        \"serviceEndDate\": null,\n                        \"partNo\": \"\",\n                        \"expectedValue\": null,\n                        \"freeItem\": null,\n                        \"shippingCharges\": 0,\n                        \"deliveryDate\": \"2023-01-15T00:00:00.000+0000\",\n                        \"manufacturerName\": null,\n                        \"manufacturerPartNo\": null,\n                        \"brandName\": null,\n                        \"invoicePlanAmount\": null,\n                        \"externalItemNumber\": null,\n                        \"supplierAdditionalData\": null,\n                        \"attachments\": null,\n                        \"customFields\": [],\n                        \"catalogItem\": false,\n                        \"catalogItemId\": null,\n                        \"externalCatalogItemId\": null,\n                        \"listPrice\": null,\n                        \"subTotal\": null,\n                        \"totalPrice\": null,\n                        \"changeActionStatus\": null,\n                        \"purchaseRequestRef\": {\n                            \"id\": \"65646ccbc508ee6ca4cc4eac\",\n                            \"externalId\": null,\n                            \"docNo\": \"1000019675\",\n                            \"label\": \"1000019675 - Jhon Doe 1000019675\",\n                            \"type\": \"PurchaseRequestModel\",\n                            \"archived\": false\n                        },\n                        \"catalogRef\": null,\n                        \"goodsReceiptRequired\": true,\n                        \"finalDelivery\": false,\n                        \"finalInvoice\": false,\n                        \"lineNumber\": \"1\",\n                        \"shippingAddress\": null,\n                        \"status\": null\n                    },\n                    \"subtotal\": 50.00,\n                    \"unitPrice\": 10,\n                    \"useTax\": 0,\n                    \"discountAmount\": null,\n                    \"companyCodeRef\": {\n                        \"id\": \"3127\",\n                        \"externalId\": null,\n                        \"docNo\": \"JD-CC\",\n                        \"label\": \"JD-CC - Jhon Doe Company Code\",\n                        \"type\": \"CompanyCodeModel\",\n                        \"archived\": false\n                    },\n                    \"itemType\": \"PRODUCT\",\n                    \"accountDistributionType\": \"none\",\n                    \"accountDistributionList\": [\n                        {\n                            \"glAccountRef\": {\n                                \"id\": \"63eca162c508ee46ca0abf56\",\n                                \"externalId\": null,\n                                \"docNo\": \"JD-GL\",\n                                \"label\": \"JD-GL - Jhon Doe - Ledger\",\n                                \"type\": \"GlAccountModel\",\n                                \"archived\": false\n                            },\n                            \"charge\": null,\n                            \"costObjectRef\": {\n                                \"id\": \"63eca1ecc508ee46ca0abfd5\",\n                                \"externalId\": null,\n                                \"docNo\": \"JD-CC\",\n                                \"label\": \"JD-CC - Jhon Doe Cost Center\",\n                                \"type\": \"CostCenterModel\",\n                                \"archived\": false\n                            },\n                            \"customerRef\": {\n                                \"id\": \"63ecda59c508ee46ca0b1a0f\",\n                                \"externalId\": null,\n                                \"docNo\": \"JD-Cust\",\n                                \"label\": \"JD-Cust - Jhon Doe Customer\",\n                                \"type\": \"CustomerModel\",\n                                \"archived\": false\n                            },\n                            \"companyCodeRef\": null,\n                            \"classRef\": {\n                                \"id\": \"63eca2a4c508ee46ca0ac057\",\n                                \"externalId\": null,\n                                \"docNo\": \"JD-Class\",\n                                \"label\": \"JD-Class - Jhon Doe Class\",\n                                \"type\": \"ClassModel\",\n                                \"archived\": false\n                            },\n                            \"projectRef\": {\n                                \"id\": \"63eca2e0c508ee46ca0ac0e2\",\n                                \"externalId\": null,\n                                \"docNo\": \"JD-P\",\n                                \"label\": \"JD-P - Jhon Doe Project\",\n                                \"type\": \"ProjectModel\",\n                                \"archived\": false\n                            },\n                            \"locationRef\": null,\n                            \"locationTypeRef\": null,\n                            \"budgetRef\": null,\n                            \"profitCenter\": \"JD-PC\",\n                            \"splitPercent\": 1.0,\n                            \"distributedAmount\": 50.00,\n                            \"distributedTax\": 6.00,\n                            \"distributedShippingCharges\": 0.00,\n                            \"distributedTotalAmount\": 56.00,\n                            \"distributedUseTax\": 0.00,\n                            \"distributedDiscountAmount\": 0.00\n                        }\n                    ],\n                    \"purchaseOrderRef\": {\n                        \"id\": \"65646cdcc508ee6ca4cc4eae\",\n                        \"externalId\": null,\n                        \"docNo\": \"2000005852\",\n                        \"label\": \"2000005852 - Jhon Doe 1000019675\",\n                        \"type\": \"PurchaseOrderModel\",\n                        \"archived\": false\n                    },\n                    \"poLineItemRef\": { // associates PO item with invoice item\n                        \"itemId\": \"19636\",\n                        \"lineNumber\": 1\n                    },\n                    \"shippingAddress\": {\n                        \"id\": \"63ec9fe8c508ee46ca0abdb5\",\n                        \"externalId\": null,\n                        \"dateCreated\": \"2023-02-15T09:03:36.964+0000\",\n                        \"lastUpdated\": \"2023-11-14T12:16:16.726+0000\",\n                        \"addressId\": \"6666\",\n                        \"name\": \"Jhon Doe\",\n                        \"attentionTo\": \"Jhon Doe\",\n                        \"addressType\": [\n                            \"billing\",\n                            \"company\",\n                            \"shipping\"\n                        ],\n                        \"street1\": \"dummy\",\n                        \"street2\": \"dummy\",\n                        \"city\": \"Chicago\",\n                        \"postalCode\": \"60007\",\n                        \"state\": {\n                            \"name\": \"Illinois\",\n                            \"code\": \"IL\"\n                        },\n                        \"country\": {\n                            \"name\": \"United States of America\",\n                            \"code\": \"US\"\n                        },\n                        \"phone\": \"+1 (234) 567-8990\",\n                        \"buildingCode\": \"Dummy\",\n                        \"roomNo\": \"Dummy\",\n                        \"floor\": \"Dummy\",\n                        \"email\": \"sahar.ali+supplier.doe@vroozi.com\",\n                        \"active\": true\n                    },\n                    \"category\": \"10000000\",\n                    \"amount\": 50.00,\n                    \"finalInvoice\": false,\n                    \"purchasingOrgRef\": null\n                }\n            ],\n            \"supplierRef\": {\n                \"name\": \"Jhon Doe supplier\",\n                \"vendorId\": \"11223344\",\n                \"address\": {\n                    \"street1\": \"test\",\n                    \"street2\": null,\n                    \"city\": \"Chicago\",\n                    \"postalCode\": \"60007\",\n                    \"state\": {\n                        \"name\": \"California\",\n                        \"code\": \"CA\"\n                    },\n                    \"country\": {\n                        \"name\": \"United States of America\",\n                        \"code\": \"US\"\n                    },\n                    \"buildingCode\": \"BC01\",\n                    \"roomNo\": \"201\",\n                    \"floor\": \"201\",\n                    \"email\": \"sahar.ali+supplier.doe@vroozi.com\",\n                    \"phone\": \"+1 (234) 567-8900\"\n                },\n                \"id\": \"95025\",\n                \"externalId\": \"JD-SUP\",\n                \"docNo\": \"403265207\",\n                \"label\": \"11223344 - Jhon Doe supplier\",\n                \"type\": \"SupplierModel\",\n                \"archived\": false\n            },\n            \"shippingAddress\": null,\n            \"notesFromSupplier\": null,\n            \"billingAddress\": null,\n            \"comments\": null,\n            \"postingDate\": \"2023-11-30T17:09:38.625+0000\",\n            \"invoiceDate\": \"2023-11-30T11:00:00.000+0000\",\n            \"type\": \"STANDARD\",\n            \"paymentDate\": null,\n            \"baselineDate\": null,\n            \"clearingDate\": null,\n            \"parkedDate\": null,\n            \"referenceDocNumber\": \"\",\n            \"paymentMethod\": \"\",\n            \"paymentTermRef\": {\n                \"id\": \"590b7262b79a505910dfc0ca\",\n                \"externalId\": null,\n                \"docNo\": \"Net 30 Days\",\n                \"label\": \"Net 30 Days - Net 30\",\n                \"type\": \"PaymentTermModel\",\n                \"archived\": false\n            },\n            \"paymentDueDate\": \"2023-12-30T11:00:00.000+0000\",\n            \"subTotal\": 50.00,\n            \"taxAmount\": 6.00,\n            \"shippingCharges\": 0,\n            \"totalAmount\": 56.00,\n            \"totalUseTax\": 0.00,\n            \"totalAmountWithUseTax\": 56.00,\n            \"discountAmount\": 0.00,\n            \"discountPercent\": null,\n            \"withholdingTaxBaseAmount\": null,\n            \"withholdingTaxAmount\": null,\n            \"supplierPayableAmount\": 56.00,\n            \"subjectToWht\": false,\n            \"withholdingTaxDetails\": {\n                \"whtCode\": null,\n                \"whtType\": null\n            },\n            \"vendorInvoiceNumber\": \"234\",\n            \"vendorInvoiceLink\": null,\n            \"companyCodeRef\": {\n                \"id\": \"3127\",\n                \"externalId\": null,\n                \"docNo\": \"JD-CC\",\n                \"label\": \"JD-CC - Jhon Doe Company Code\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"companyAddress\": null,\n            \"supplierAccountNumber\": null,\n            \"invoiceLineIndicator\": {\n                \"taxInLine\": true,\n                \"shippingInLine\": false\n            },\n            \"additionalAccountingInfo\": {\n                \"taxGLAccountRef\": null,\n                \"shippingChargesGLAccountRef\": null\n            },\n            \"supplierBankAccountInfo\": null,\n            \"supplierAccountNumbers\": [],\n            \"companyCodeRefs\": [\n                {\n                    \"id\": \"3127\",\n                    \"externalId\": null,\n                    \"docNo\": \"JD-CC\",\n                    \"label\": \"JD-CC - Jhon Doe Company Code\",\n                    \"type\": \"CompanyCodeModel\",\n                    \"archived\": false\n                }\n            ],\n            \"purchaseRequestRefs\": [\n                {\n                    \"id\": \"65646ccbc508ee6ca4cc4eac\",\n                    \"externalId\": null,\n                    \"docNo\": \"1000019675\",\n                    \"label\": \"1000019675 - Jhon Doe 1000019675\",\n                    \"type\": \"PurchaseRequestModel\",\n                    \"archived\": false\n                }\n            ],\n            \"purchaseOrderRefs\": [\n                {\n                    \"id\": \"65646cdcc508ee6ca4cc4eae\",\n                    \"externalId\": null,\n                    \"docNo\": \"2000005852\",\n                    \"label\": \"2000005852 - Jhon Doe 1000019675\",\n                    \"type\": \"PurchaseOrderModel\",\n                    \"archived\": false\n                }\n            ],\n            \"customFields\": []. // read only\n        } 2-  API Gateway : Receives and routes incoming requests to the appropriate backend service (Purchase API) in case of Invoices it is routed to InvoiceModelController in Purchase API. 3- Invoice Model Service : Receives invoices from the API Gateway, stores them in MongoDB `vroozi_api_async_requests` collections, and triggers the transmission of invoices to an SQS queue.  Queue Name: int-vroozi-api-invoice-incoming-queue  int-vroozi-api-transactional-documents  +----------------------------+\n| vroozi_api_async_requests  |\n+----------------------------+\n| - id: String               |\n| - trackingId: String       |\n| - docType: Enum            |\n| - processingResult: Object |\n| - status: Enum             |\n| - lastUpdated: Date        |\n| - dateCreated: Date        |\n| - requestPath: String.     |\n| - requestMethod: String    |\n+----------------------------+\n\n+-----------------+\n| ProcessingResult  |\n+-----------------+\n| - metadata: Object    |\n| - status: Enum    |\n| - errors: Array    |\n| - warnings: Array |\n+-----------------+\n\n+-----------------+\n| Metadata        |\n+-----------------+\n| - payloadRef: Object    |\n| - vendorInvoiceNumber: String    |\n| - externalId: String    |\n| - invoiceNumber: String |\n+-----------------+ 4- We will store the incoming payload to S3 in .json file, use the bucket name: vroozi-test-file-storage. File name should be generated uniquely (id), and might have unitId in the prefix, it could have vendor invoice Number as well if provided, and append timestamp to make this unique. Store the references of this file into the collection. 5-  docType can be used to determine the transactional document type, e.g InvoiceModel etc. 6- SQS Queue : Create a transactional document processing queue. Stores incoming document for asynchronous processing. Start with Invoice Processing Queue. (We can use one queue for all documents vs separate queue for each document).  Queue message {\n    \"transmissionId\": \"ac395c84-55f8-434a-80e2-abb2952e572b\",\n    \"type\": \"JSON\",  // XML, JSON, STRING, RAW_DATA, FILE, PLAIN_TEXT, CXML;\n    \"unitId\": \"2\"\n} 7- Return Async Response to Client : Once the incoming document is stored and file is uploaded to S3,  and transmission is send on SQS, we can return the response to client. Return the Async response {\n  \"trackingId\": \"98fea22e-1537-4b6c-b445-eda852132c6f\",\n  \"status\": \"PROCESSING\",\n  \"timestamp\": \"2024-01-25T15:10:11.104+0000\"\n} 8- Expose the GET tracking by Id api, end point: v1/async-requests/{trakcingId} Response: {\n    \"id\": \"661d3819a5d9472e2266ecf0\",\n    \"trackingId\": \"ac395c84-55f8-434a-80e2-abb2952e572b\",\n    \"docType\": \"InvoiceModel\",\n    \"processingResult\": {\n        \"metadata\": {\n          \"payloadRef\": {\n                 \"id\":\"123213123212\", // S3 attachment Id\n                 \"label\" : \"Name of the file\",\n                 \"type\" : \"AttachmentModel\",\n                 \"archived\" : false\n              },\n            \"vendorInvoiceNumber\" : \"\",\n            \"externalId\" : \"\",\n            \"invoiceNumber\" : \"\", // what else we could have as unique identifier\n        }         \n        \"status\": PROCESSING,\n        \"errors\": [],\n        \"warnings\": []\n    },\n    \"status\": \"PROCESSING\", // IN_PROGRESS\n    \"dateCreated\": \"2024-04-15T14:22:17.270+0000\",\n    \"lastUpdated\": \"2024-04-15T14:22:17.270+0000\",\n    \"requestPath\": \"/api/invoices/incoming/async\",\n    \"requestMethod\": \"POST\"\n} 9- Preprocessing validation should return the response back to the client. If the payload is valid and accepted for processing, than we need to perform all post validations, e.g resource lookups, data integrity etc. 10- If we have any any error in the payload processing, we will give Internal Server error and will not store the transmission 11- When there is invalid Invoice payload (missing required fields or invalid enum values), we give the validation error. Required fields are: (invalid json), vendorInvoiceNumber",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2024-03-21T21:31:58.597-0700",
        "issue_type": "Story",
        "parent_id": "VZI-96278"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-94941",
      "released_in_current_rc": false,
      "summary": "Update BOM logic to pick the correct accounting/organization objects",
      "description": "Currently, the system does not check the given accounting/organization objects paring with the Company Code and all other objects while uploading the BOM file. Due to this, the system picks up the wrong objects from the database, which will eventually cause the accounting validation failure. In this epic, we will enable the system to pick the correct accounting/organization objects from the DB while uploading line items from the BOM file",
      "status": "Open",
      "assignee": "Muhammad Ahmar Nadeem",
      "created": "2024-01-08T22:38:07.876-0800"
    },
    "issues": [
      {
        "key": "VZI-97756",
        "summary": "Refactor the Line Item(BOM) Bulk Upload Implementation LineItemConverter",
        "description": "Business Case: Based on the analysis done in  , the Line Item(BOM) Bulk Upload implementation needs to be refactored for smooth future development/enhancements. Acceptance Criteria: We need to refactor the existing code for Line Item Bulk Upload(BOM) and find out the ways to refactor the code. For refactoring, the following points should be considered: Maintainability  (Low Maintainance Cost) The code should be maintainable. Any new enhancements or fixes should not be costly. Distribute the code to relevant utils and services. Unified caching approach. Performance  (Less uploading time) Improve the performance of BOM upload. remove unnecessary calls, loops, custom labels, calculations, and code duplications Stability  (Remove unnecessary dependencies on other modules' code) Until anything is explicitly updated in the BOM code, existing functionality should not break. Preserve Existing Functionality While refactoring, existing functionality should remain intact. QA needs to make sure that existing functionality should remain intact.",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-03-19T23:41:00.382-0700",
        "issue_type": "Story",
        "parent_id": "VZI-94941"
      },
      {
        "key": "VZI-96443",
        "summary": "Refactor the Line Item(BOM) Bulk Upload Implementation LineItemImportService",
        "description": "Business Case: Based on the analysis done in  , the Line Item(BOM) Bulk Upload implementation needs to be refactored for smooth future development/enhancements. Acceptance Criteria: We need to refactor the existing code for Line Item Bulk Upload(BOM) and find out the ways to refactor the code. For refactoring, the following points should be considered: Maintainability  (Low Maintainance Cost) The code should be maintainable. Any new enhancements or fixes should not be costly. Distribute the code to relevant utils and services. Unified caching approach. Performance  (Less uploading time) Improve the performance of BOM upload. remove unnecessary calls, loops, custom labels, calculations, and code duplications Stability  (Remove unnecessary dependencies on other modules' code) Until anything is explicitly updated in the BOM code, existing functionality should not break. Preserve Existing Functionality While refactoring, existing functionality should remain intact. QA needs to make sure that existing functionality should remain intact.",
        "status": "Released",
        "assignee": "Sahar Habiba",
        "created": "2024-02-14T23:54:25.277-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94941"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-97358",
      "released_in_current_rc": false,
      "summary": "Purchase API - Sonar Cloud Security Vulnerability Issues",
      "description": "",
      "status": "Open",
      "assignee": "Unassigned",
      "created": "2024-03-08T03:12:47.358-0800"
    },
    "issues": [
      {
        "key": "VZI-97363",
        "summary": "Change this code to not log user-controlled data.",
        "description": "Log injection occurs when an application fails to sanitize untrusted data used for logging. An attacker can forge log content to prevent an organization from being able to trace back malicious activities. What is the potential impact? If an attacker can insert arbitrary data into a log file, the integrity of the chain of events being recorded can be compromised. This frequently occurs because attackers can inject the log entry separator of the logger framework, commonly newlines, and thus insert artificial log entries. Other attacks could also occur requiring only field pollution, such as cross-site scripting (XSS) or code injection (for example, Log4Shell) if the logged data is fed to other application components, which may interpret the injected data differently. The focus of this rule is newline character replacement. Log Forge An attacker, able to create independent log entries by injecting log entry separators, inserts bogus data into a log file to conceal his malicious activities. This obscures the content for an incident response team to trace the origin of the breach as the indicators of compromise (IoCs) lead to fake application events. The following code is vulnerable to log injection as it constructs log entries using untrusted data. An attacker can leverage this to manipulate the chain of events being recorded. Noncompliant code example private static final Logger logger = Logger.getLogger(\"Logger\");\n\nprotected void doGet(HttpServletRequest request, HttpServletResponse response) throws IOException {\n\n  String data = request.getParameter(\"data\");\n  if(data != null){\n    logger.log(Level.INFO, \"Data: {0} \", data);\n  }\n}\n Compliant solution private static final Logger logger = Logger.getLogger(\"Logger\");\n\nprotected void doGet(HttpServletRequest request, HttpServletResponse response) throws IOException {\n\n  String data = request.getParameter(\"data\");\n  if(data != null){\n    data = data.replaceAll(\"[\\n\\r]\", \"_\");\n    logger.log(Level.INFO, \"Data: {0} \", data);\n  }\n} List of Issues",
        "status": "Released",
        "assignee": "qasim.riaz",
        "created": "2024-03-08T03:45:22.457-0800",
        "issue_type": "Story",
        "parent_id": "VZI-97358"
      }
    ]
  }
]