[
  {
    "epic": {
      "key": "VZI-94119",
      "released_in_current_rc": false,
      "summary": "AP: Add Purchasing Organization to AP Documents",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Deepak Mohan Kumar",
      "created": "2023-12-04T16:01:13.200-0800"
    },
    "issues": [
      {
        "key": "VZI-96200",
        "summary": "PMAN: AP: Prepare script to disable Purchasing Organization feature toggle for all customers in Production",
        "description": "Goal: Prepare script(s) to  disable  the Purchasing Organization feature toggle for all customers. Acceptance Criteria: Prepare a script that will  disable  the new Purchasing Organization feature toggle for all customers (unitIds) that are configured in a given environment. This script is expected to be executed in the following environments: SOCI, PERF, and Production.",
        "status": "Done",
        "assignee": "Jimena Pose",
        "created": "2024-02-10T16:58:57.705-0800",
        "issue_type": "Task",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94523",
        "summary": "Stage - Accounts Payable - Invoice - Accounting Changes Banner does not show for the Purchasing Organization field changes when the Invoice returns from Exception Handling or Coding.",
        "description": "Environment: https://stage-go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. Purchase Organization should be Required in Admin>Document>Settings>All Documents>Line Item Configuration section.   Steps to Reproduce: Click to Create Invoice.  9000028918 Add an item leaving Purchase Organization field empty. Send for Coding. Logout and Login as AP Coder and select Purchase Organization for the item and Return. Logout and Login as AP User. Access the Invoice. Please see Accounting Changes Banner is not showing. Check Side Panel>Audit Card. Purchase Organization audit has been recorded. Actual Result: Accounting Changes Banner does not show for the Purchasing Organization field changes when the Invoice returns from Exception Handling or Coding. Expected Result: Accounting Changes Banner should also show for the Purchasing Organization field changes when the Invoice returns from Exception Handling or Coding. Screen shot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Ahmed Habib",
        "created": "2023-12-20T02:19:35.812-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94208",
        "summary": "PMAN: AP: Prepare script(s) to enable Purchasing Organization feature toggle for all customers",
        "description": "Goal: Prepare script(s) to enable the Purchasing Organization feature toggle for all customers. Acceptance Criteria: Prepare a dynamic script that will enable the new Purchasing Organization feature toggle for all customers (unitIds) that are configured in a given environment. This script is expected to be executed in the following environments: DEVQA environments, SOCI, PERF, and Production. Only customers that have  PURCHASE__COMPANY_ACCOUNTING_LINE_ITEM_CONFIGURATION  enabled are able to see the Purchasing Organization on the invoice and memo user interfaces. If a customer does  not  have  PURCHASE__COMPANY_ACCOUNTING_LINE_ITEM_CONFIGURATION   enabled, then their users are unable to see the Purchasing Organization on the invoice and memo user interfaces, even if the new Purchasing Organization feature toggle is enabled for them. Backlog Grooming (December 6/7, 2023): Attendees:  Jaro, Mavin, Ahmed, Aqsa, Deepak Points of Discussion: Discussed the overall scope of the ticket. We collectively aligned that we’ll generate a dynamic script that will activate the feature for all customers, even if their unitId is inactive.",
        "status": "Done",
        "assignee": "Ahmed Habib",
        "created": "2023-12-06T20:22:12.078-0800",
        "issue_type": "Task",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94207",
        "summary": "PMAN: AP: System includes Purchasing Organization in the CSV Posting files",
        "description": "User Story: As an AP user , I want the Purchasing Organization to be included in the CSV posting file  so that  it can be integrated with my external system which is the source of truth. Acceptance Criteria: 1.  What is the change?  The system includes the Purchasing Organization field in the CSV posting files. 2.  Which customers should this change impact?  All customers who have ACCOUNTS_PAYABLE_WORKFLOW = true. Note:  For those customers who process memos, ACCOUNTS_PAYABLE_WORKFLOW = true. 3.  What pages should this change impact?  None – the change impacts both invoice and memo posting files. Note:  This change does not apply to auto memos. 4.  Which users should be impacted by the change?  Users who are able to post AP documents. 5.  How should this feature work? Pre-Requisites:   Conditions in AC #2 are fulfilled. The CSV connector is enabled by the Admin. A document is in an   or   status, ready to be posted out of the system. Document Posting When a user or system posts a single/multiple documents, the system includes the Purchasing Organization in the posting file. The system showcases two fields for each document line item, as listed below. The positioning of these fields are  dynamic  based on the current implementation, that is, they can be positioned anywhere in the file (using the script). Purchasing Organization Code Purchasing Organization Description Note to QA:  Please ensure to test the dynamic positioning of the fields listed above, that is, verify if the Purchasing Organization fields can be positioned at any location in the file. The system displays the values as-is. The system leaves the fields above as empty/null if no Purchasing Organization is defined. 6.  Do we need a data fix for existing customers?  Yes. A data script will be required to position the two Purchasing Organization fields at the far right of the posting file  for existing customers who will have CSV connector on at the time of executing the script in the respective environment . The data script may need to be executed in DEVQA, SOCI, PERR, and Production environments. 7.  Would this change impact existing documents?  Yes, after the change is deployed in Production. Existing documents being posted will have Purchasing Organization in the CSV posting file but it will be blank/null. 8.  To which teams should this change be communicated to?  All teams. Questions: Question # AC # Raised By Inquiry Date Assignee Response Date 1 5 Deepak December 6, 2023 Ahmed December 6, 2023 2 5 Deepak December 6, 2023 December 6, 2023 # Question Recommendation Response Remarks 1 Is the CSV file static or dynamic? None. Dynamic, based on  's examination of the code. 2 Is any Purchasing Organization attribute different from any of the other Organization or Accounting elements? None. No. Key Decisions: # Decision Point Decision Reasoning Validation Plan 1 Where should we place the Purchasing Organization in the CSV posting files? Not applicable. The posting file is dynamic, meaning that the fields can be positioned anywhere. 2 Should we consider if the Purchasing Organization is enabled or not, or if the new feature toggle is enabled? No. Purchasing Organization will be available to be displayed in the CSV posting files irrespective of feature toggles or settings. Unnecessary complication and it will have no affect if Purchasing Organization info is present in the file. If no value is present, the value will be blank. 3 Do we need to massage or localize the values prior to displaying the file? Do we need to consider the leading zeroes setting? No. We don’t currently take the leading zeroes into account for any posting mechanism. Backlog Grooming (December 6, 2023): Attendees:  Jaro, Mavin, Ahmed, Aqsa, Deepak Points of Discussion: Discussed the ticket overall. Assigned action items to Ahmed to: Understand if the CSV file is static or dynamic. Talk to Imran regarding leading zeroes and examine the code base. Sprint Planning (December 7, 2023): Attendees:  Jaro, Ahmed, Aqsa, Sujoy, Deepak Points of Discussion: Reviewed Ahmed’s findings. Made decisions on the decision points above. Sized the ticket in SP.",
        "status": "Awaiting Business Validation",
        "assignee": "Ahmed Habib",
        "created": "2023-12-06T19:51:29.776-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94122",
        "summary": "PMAN: AP: AP Users are able to update Purchasing Organization in APPROVED status and beyond",
        "description": "User Story: As an AP user , I want to be able to correct the coding information when a document is in an approved state or beyond  so that  I can ensure accuracy of the Purchasing Organization information on the document. Acceptance Criteria: 1.  What is the change?  The system allows AP users to edit the Purchasing Organization information on a document in   status and greater. 2.  Which customers should this change impact?  All customers who have ACCOUNTS_PAYABLE_WORKFLOW = true  and  the Purchasing Organization feature toggle = true. Note:  For those customers who process memos, ACCOUNTS_PAYABLE_WORKFLOW = true. 3.  What pages should this change impact?  Invoices and memos. Note:  This change does not apply to auto memos. 4.  Which users should be impacted by the change?  The following users will be able to update the Purchasing Organization in the statuses listed below: Document owners (AP Processor/Manager), individual or part of a group. All AP Managers. 5.  How should this feature work? Pre-Requisites:   Conditions in AC #2 are fulfilled. The Purchasing Organization setting in Documents → Settings → All Documents is configured to one of Optional  or  Required. A document is in one of the following statuses  and  editing has been enabled in the respective status: APPROVED READY TO POST POSTING FAILED POSTED PARTIALLY PAID PAID Document Update Users are able to click on the pencil icon → navigate to edit mode → edit the Purchasing Organization one line item at a time by clicking on the pencil icon or using the Apply All modal. Audit Trail The system instantly captures changes performed by a user to the Purchasing Organization on all the document line items (in the above statuses) in the “<Document> Updated“ audit log. Purchasing Organization = Required ,  , and   Status Actions / Transitions When the system showcases the Purchasing Organization is missing error, the system instantly showcases the “Select Next Action“ option which when clicked showcases the “Return to Draft“ and “Assign“ transitions; the “Finalize Update(s)“ transition is  not  available. ,  , and   Status Actions / Transitions When the system showcases the Purchasing Organization is missing error, the system instantly showcases the “Return to Draft“ transition only; the “Finalize Update(s)“ transition is  not  available. Note:  The implementation of the Purchasing Organization field, e.g. filtering (what values are showcased, etc.), validations, etc., will be the same as described in  . 6.  Do we need a data fix for existing customers?  No. 7.  Would this change impact existing documents?  Yes. 8.  To which teams should this change be communicated to?  All teams. Test Data: Questions: Question # AC # Raised By Inquiry Date Assignee Response Date # Question Recommendation Response Remarks Key Decisions: # Decision Point Decision Reasoning Validation Plan 1 Should we grant any other user the ability to edit a document in the above listed statuses? No. Anyone who is able to edit a document in the above statuses should continue to do so. 2 Should we split the ticket for invoices and memos? No. The scope is manageable. 3 How should the system tackle  existing documents in the above statuses? Read only:  No validation will be done in these statuses, except   . Edit mode:  They will reflect the latest state of the Purchasing Organization settings, in terms of line item display (and pertinent changes, e.g. error messages). The assumption is that customers will want any new document and existing documents in process to reflect the latest changes. Backlog Grooming (December 5/6, 2023): Attendees:  Jaro, Mavin, Ahmed, Asma, Aqsa, Sujoy, Deepak Points of Discussion: Discussed the ticket as a whole, including the decision points. Backlog Grooming (December 6, 2023): Attendees:  Jaro, Mavin, Ahmed, Jimena, Asma, Aqsa, Deepak Points of Discussion: Discussed the ticket as a whole, including the decision points. Sized the ticket in SP.",
        "status": "Awaiting Business Validation",
        "assignee": "Ahmed Habib",
        "created": "2023-12-04T19:51:58.152-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94066",
        "summary": "PMAN: AP: AP Approvers are able to update Purchasing Organization while document is pending approval",
        "description": "User Story: As an AP Approver , I want to be able to correct the coding information when a document is assigned to me  so that  I can ensure accuracy of the Purchasing Organization information on the document. Acceptance Criteria: 1.  What is the change?  The system allows AP Approvers to code/edit the Purchasing Organization information on a document when it is assigned to them in   status. 2.  Which customers should this change impact?  All customers who have ACCOUNTS_PAYABLE_WORKFLOW = true  and  the Purchasing Organization feature toggle = true. Note:  For those customers who process memos, ACCOUNTS_PAYABLE_WORKFLOW = true. 3.  What pages should this change impact?  Invoices and memos. Note:  This change does not apply to auto memos. 4.  Which users should be impacted by the change?   AP Approvers (assigned to the document in   status) who have editing and/or coding privileges. All AP Managers. Note:  Only AP Approvers with editing and/or coding privileges can edit and/or code the Purchasing Organization information in   status, respectively. 5.  How should this feature work? Pre-Requisites:   Conditions in AC #2 are fulfilled. The Purchasing Organization setting in Documents → Settings → All Documents is configured to one of Optional  or  Required. A document is assigned to an AP Approver in   status. AP Approver with Editing and/or Coding privileges If AP Approver has editing privileges | Any AP Manager Users are able to click on the pencil icon → navigate to edit mode → edit the Purchasing Organization one line item at a time by clicking on the pencil icon or using the Apply All modal. If AP Approver has coding privileges and does not have editing privileges Users are able to click on the calculator icon on the top right → navigate to coding mode → code the Purchasing Organization one line item at a time by clicking on the calculator icon or using the Apply All modal Approve and Reject (If Purchasing Organization = Required only) If document has  no  Purchasing Organization is missing error (and no other error) The user is able to  Approve  or  Reject  the document, both from a read only and edit modes. Note:  The system will showcase an error if the Purchasing Organization is  not  populated (when it is a required field). If document contains one or more Purchasing Organization is missing error (or other errors) The user is only able to  Reject  the document, both from a read only and edit modes. Note:  The implementation of the Purchasing Organization field, e.g. filtering (what values are showcased, etc.), validations, etc. will be the same as described in  . Document after being Approved/Rejected Audit Trail The system captures changes performed by a AP Approver in   status, to the Purchasing Organization on all the document line items, when the user executes the following actions: Reject (<Document> Rejected) Approve (<Document> Approved) Approve and Forward  or  Approve and forward to next AP Approver in the approval chain (<Document> Approved and forwarded to <next AP Approver>) AP Approver with no Editing or Coding privileges Users are unable to code or edit the Purchasing Organization on the entire document. 6.  Do we need a data fix for existing customers?  TBD. 7.  Would this change impact existing documents?  TBD. 8.  To which teams should this change be communicated to?  All teams. Test Data: Questions: Question # AC # Raised By Inquiry Date Assignee Response Date 1 5 Deepak December 1, 2023 December 4, 2023 1 5 Deepak December 1, 2023 December 4, 2023 # Question Recommendation Response Remarks 1 Unrelated to the ticket:  Can we retrieve a list of customers with Purchasing Organization optional vs required vs hidden? None. Yes – see comments below. 2 How does the user experience when an AP Approver has code and/or edit privileges? None. Code option (calculator) is displayed instead of edit (pencil) icon in the top right. Key Decisions: # Decision Point Decision Reasoning Validation Plan 1 Should AP Managers be able to edit/code Purchasing Organization in   status? Can they edit/code documents in   status currently? Yes. This is already supported currently. 2 How will existing documents in   status be handled? They will reflect the latest state of the Purchasing Organization settings, in terms of line item display (and pertinent changes, e.g. error messages). The assumption is that customers will want any new document and existing documents in process to reflect the latest changes. 3 Not related to this ticket:  Shall we remove the feature toggle implementation so that it doesn’t need to be considered for this change? No. Unknown unknowns. Let’s observe how the rollout works and then deprecate the feature toggle later. Support issues received or feedback received from customers. Backlog Grooming (December 4/5, 2023): Attendees:  Jaro, Mavin, Ahmed, Aqsa, Asma, Sujoy, Deepak Points of Discussion: Discussed the overall scope of the ticket. Reviewed the decision points and questions. Backlog Grooming (December 4/5, 2023): Attendees:  Jaro, Mavin, Ahmed, Aqsa, Asma, Sujoy, Deepak Points of Discussion: Reviewed the decision points again and made final decisions as documented above. Sized the ticket in SP.",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2023-12-01T14:23:06.720-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94119"
      },
      {
        "key": "VZI-94010",
        "summary": "Vroozi API: AP: System adds Purchasing Organization to the Invoice and Memo APIs",
        "description": "As an API user, We need to support for invoice and memo API to expose the purchasing organisation fields.",
        "status": "Awaiting Business Validation",
        "assignee": "Sambhu Sai",
        "created": "2023-11-30T01:17:37.418-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94119"
      }
    ]
  },
  {
    "epic": {
      "key": "No Epic",
      "released_in_current_rc": false
    },
    "issues": [
      {
        "key": "VZI-96192",
        "summary": "SOCI - Accounts Payable - Create Invoice - Apply to All is giving something went wrong error.",
        "description": "Environment: https://go.vroozi.com Username :  admin.modernniagara@vroozi.com Password:  SOCI1347 Steps to Reproduce: Navigate to  9000008867 Select desired items and click to Apply to All. Select Accounting details in the Changes to be Applied tab Click to Apply changes. Please see the error pop up shows and error in console too. Actual Result: Error shows and no changes are applied to the items. Expected Result: No error should show and changes applied to the items correctly. Screen-Shot:",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-02-09T14:46:12.539-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96190",
        "summary": "Stage - Accounts Payable - Create Invoice - GL Account filter is not working against entered text during Inline Item Edit.",
        "description": "Environment: https://stage-go.vroozi.com Username : asma.latif+APM @vroozi.com Password:  Blueangel1@ Pre-Requisites: AP User should have logged into the Application. Steps to Reproduce: Click to Create Invoice.  9000029376 Add an Item with Company Code having more than 1 GL accounts associated to it. Inline edit the GL account field and enter text unique in one of the associated GL accounts. Please see other associated GL accounts are also appearing. GL Account filter is not working against entered text during Inline Item Edit. Actual Result: GL Account filter is not working against entered text during Inline Item Edit. Expected Result: Only GL Account containing the entered text should filter. Screen-Shot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-02-09T14:09:11.409-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96086",
        "summary": "PMan - Buyer group fields are disappeared from line items and Document level validation error message appears related to Buyer Group If user change accounting elements while doing POCR and new selection meet another buyer group.  ",
        "description": "Server : stage credentials :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-Req: In Master data > Create 2 GL accounts for 1 company code Master Data  >  Buyers  >  Set a default buyer group Two Buyer groups (Buyer Group A & B )are created in system with same category, Supplier, company code but with different GL. Steps to Reproduce: Login as an employee Open a Purchase order. Click on Change request from Fab Icon.  On CR line item buyer group  A is selected. Select all items and Click on Apply to All button Select the GL account entered in Buyer Group B definition Click on  Apply Changes Actual :  Document level error message displayed related to buyer group and when user Open line item No buyer group field is displayed on UI. Expected : Buyer Group field should exist on line item and system is allow user to make changes on it as well.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-02-06T00:59:36.397-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-96003",
        "summary": "PMan - On PO creation wizard - **Kindly select Active Budget** message is shown on line item, when user changes Company and Accounting info from Apply to All modal",
        "description": "Server : Stage Credentials : ayesha.waseem+7+buyer@vroozi.com  / Welcome1@ Pre-Req: Valid budgets should exist Steps to Reproduce: Login as a Buyer user Start Creating PO through wizard Navigate to page where user can add Line item Add a line item (Valid Budget should attach) Select the Line item and Click on Apply to All Provide a different company code and Accounting Info Select a valid Budget with it Save Changes Open the line item Actual : An error message is coming below the Budget field  Kindly select an Active Budget Expected : No error message should come",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-31T22:51:03.084-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95975",
        "summary": "PMan- Warning Message is not disappearing when document is refreshed on Save call",
        "description": "Server:  Stage Pre-Req:   Location type should be OFF at Unit ID level Steps to reproduce: Login as an employee user Open a PR in draft Select a Line item and click on Apply to All button Search a invalid location and save changes Warning message is shown Open the line item and make some changes and save it Actual : Warning message is still coming  Expected :  Warning message should disappear Note: this is also happening on draft PO, and when sourcing and financial approver edit the documents",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-31T03:48:28.861-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95903",
        "summary": "PMan- Warning is being thrown even though Location is valid only when Location Type field is OFF at Unit ID level",
        "description": "Server:  Stage Pre-Req:   Location type should be OFF at Unit ID level Steps to reproduce: Login as an employee user Open a PR in draft Select a Line item and click on Apply to All button Search a valid location and save changes Actual : Warning message is coming and location is not saved Expected :  Valid locations that matches company code on the line item  should be saved",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-30T02:39:17.027-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95902",
        "summary": "PMan- If Accounting category is OFF at Unit ID level then, Accounting elements are not being marked as required on apply to All",
        "description": "Server:  Stage Pre-Req:   Master Data> Accounting : Switch Off toggles related to accounting category Steps to reproduce: Login as an employee user Open a draft PR Select a Line item and click on Apply to all button On Apply to All modal, Select Company Code Actual : Accounting elements are not being marked as Required Expected :  Accounting elements should be marked as required",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-29T23:54:01.407-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95883",
        "summary": "Stage - Accounts Payable - Invoice - Item Edit - Inline Edit ends up in the Error if Purchasing Org is OFF",
        "description": "Environment:   https://devqa15-go.vroozi.com Username :  asma.latif+APM83@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. Purchasing Org is OFF   Steps to Reproduce: Click to Create Invoice. E.g. use  9000001792 Inline Edit the Item against qty/price or both. Actual Result: Error is shown Note: Purchase org is for some reason included in the payload Expected Result: Update is done Screenshot:",
        "status": "Abandoned",
        "assignee": "Unassigned",
        "created": "2024-01-29T16:07:36.098-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95882",
        "summary": "Stage - Accounts Payable - Invoice - Item Edit - Inline Edit makes duplicate PATCH API call",
        "description": "Steps to Reproduce: Go to the Invoice in DRAFT status Create an item Edit Item using inline functionality, e.g. change a unit price Press ENTER Actual Result: PATCH API is called 2 twice  Expected Result: PATCH API should be called only once",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-29T16:03:39.631-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95881",
        "summary": "Stage - Accounts Payable - Create Invoice - Percent Dist. Issue while Item is in edit mode.",
        "description": "Environment:  https://stage-go.vroozi.com Username :  asma.latif+APM83@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice.  9000029310 Add an Item with Percent Account Splits. 70% and 30% resp. View the Item>Accounting tab. the Percent fields are showing correct values. Edit open the item. 1st dist Percent field is now showing 30% which is wrong it should be 70%. Actual Result: Percent field value is incorrect in item edit mode. Expected Result: Percent field value should remain intact. Screenshot: Thanks, Asma",
        "status": "Duplicate",
        "assignee": "Asma Latif",
        "created": "2024-01-29T14:20:03.020-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95874",
        "summary": "Stage - Accounts Payable - Invoice - Item Edit - New split value is not focused and previously entered values are not preserved",
        "description": "Steps to Reproduce: Go to the Invoice in DRAFT status Create an item Navigate to the Accounting tab Add the first split (by percent) Fill all the details Click the “+” to add the 2nd split Actual Result: Percent #2 field is not auto-focused Expected Result: Percent #2 field should be auto-focused (should work in general for the latest split value when adding new split) Additional Steps: Check Percent #1 Actual Result: Value is reset to nothing, the split value is displayed as a placeholder Expected Result: Initially set value is displayed",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-29T12:31:15.893-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95768",
        "summary": "PMan - Budget is being removed on line item on changing company info, while doing POCR (if Edit accounting info is OFF)",
        "description": "server : devqa20 Pre-Req: Edit Accounting info is OFF in Documents > Settings > Purchase Orders Budget feature toggle is ON Valid Budget is applied on PO Steps to reproduce: Login with requester user Search the above created PO Start doing POCR Select a line item Click on Apply to All modal Select Company Code, Purchasing Org and Plant code Click Save changes button Actual : Document level error is shown on the screen “Please associate a valid Budget” Expected : Budget should not be removed from the line item",
        "status": "Resolved",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-25T23:14:23.201-0800",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-95761",
        "summary": "PMan- Customer field is not being saved at line item when there is only 1 customer available on Catalog PR line item",
        "description": "Server : Stage Pre-Req: Document defaults have been set on requester profile There must be only 1 valid customer with the applied Company code us user defaults Steps to Reproduce: Login with the requester user Search a catalog item and add to cart Click on the cart Move the item to PR Document level errors are shown for missing info Open the line item and verify that Customer is set on the line item and there is only one valid customer available to be applied Actual :   Document level error is coming **Line Item #1: Field Customer missing.** Expected : When Customer is not saved on the line item (despite being only 1) . When user opens line item then Customer filed should be blank",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-25T21:51:02.161-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95572",
        "summary": "Stage - Accounts Payable - Invoice - Item Edit - Unexpected navigation to the General Information Tab",
        "description": "Steps to Reproduce: Go to the Invoice in DRAFT status Create an item Add the first split (by percent) Fill all the details Click the “+” to add the 2nd split Actual Result: System takes you to the “General Information” tab Expected Result: Should stay in the accounting tab",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-23T16:38:06.259-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95539",
        "summary": "Stage - Accounts Payable - Invoice - Inline Edit - While updating unit price the old value is displayed for a moment",
        "description": "Steps to Reproduce: Navigate to the invoice in draft with invoice items Update unit price Actual Result: For a moment, previous value is displayed Expected Result: Update value is displayed Note: The behavior should be similar as updating to quantity",
        "status": "Awaiting Business Validation",
        "assignee": "Jaroslav Bellus",
        "created": "2024-01-22T23:06:48.177-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95535",
        "summary": "Stage - Accounts Payable - Invoice/Memo - Issues on the Apply to All Modal.",
        "description": "Environment:   https://stage-go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. Company Code should have more than 1 PORGs associated.   Steps to Reproduce: Click to Create Invoice.  9000029275 Add Couple of items. Checkmark all and click to Apply to All. Select Company Code , a PORG option , plant and Cost Center from Account Category. Select. a Cost Center. Please see Apply Changes button gets enabled even GL being required has not been selected yet. Please see PORG is emptying. -  Legacy Issue Enter/Select all desired values and click to Apply Changes. Modal Closes and changes apply on the selected items. Open the Modal again. Please see the last selections in the fields is persisting. Actual Result: Issue 1:  Apply Changes button gets enabled even GL being required has not been selected yet. Issue 2:  PORG is not retaining the selection. Issue 3: Opening the Modal again , shows the last selections. Expected Result: Expected 1: Apply Changes button shouldn’t get enabled until all required fields are filled in. Expected 2 PORG should retain its selected value. Expected 3: Modal should reset. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-22T22:21:17.683-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95534",
        "summary": "Stage - Accounts Payable - Invoice/Memo - Apply to All - Cost Center, Plant, Location, Class  are not being filtered by the Company Code.",
        "description": "Environment:  https://stage-go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice.  9000029275 Add Couple of items. Checkmark all and click to Apply to All. Select Company Code and Cost Center from Account Category. Click and type a letter on the Cost Center field. Please see all are searchable. Actual Result: Cost Center is not being filtered by Company Code. Expected Result: All Accounting elements should filter by Company Code value. Screenshot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-22T22:06:51.792-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95479",
        "summary": "Stage - Accounts Payable - Invoice - Apply to All - Changes to be Applied Tab has gaps within its fields.",
        "description": "Environment: https://stage-go.vroozi.com Username :  asma.latif+APCoder@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Access Code>Invoices. Select an Invoice from the table. Checkmark all items on the invoice screen and click to Apply to All. Changes to be applied tab opens on Apply to All Modal. Please see the gaps within the fields under the Accounting heading. Actual Result: gaps within the fields under the Accounting heading. Expected Result: No Gaps should be within the fields. Screen-Shot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-19T13:46:11.380-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95472",
        "summary": "PMan- Tax Code and Tax value is being removed while doing POCR, when  user updates company info through Apply to All modal",
        "description": "Server : stage Credentials :  ayesha.waseem+emp@vroozi.com/ Welcome1@ Pre-req: Dictate accounting via Company Code toggle is ON. From Documents → Settings→ Purchase order → update accounting info toggle is disabled for Non-catalog line items. Steps to reproduce: Log in to PMan with given credentials. Go to the purchase order screen. Open any purchase order and choose \"change request\" from the Fab Icon. Select all line items Click on  \"apply to all\" button. Search a company code, Purchasing Org and Plant code Click on Save changes System updates Company info and removes Tax code and tax value Actual : Document level errors are shown for missing Tax code and tax value Expected : Tax code and tax value should not be removed when Company info is changed from Apply to All modal",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-19T09:43:05.621-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95464",
        "summary": "PMan - Buyer Group is not being reset or removed according to the Accounting elements being set from Apply to All modal",
        "description": "Server : stage credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: In Master data > Create 2 GL accounts for 1 company code Master Data  >  Buyers  >  Set a default buyer group Create a buyer group with 1 category, Supplier and GL account (use the 1 created above) Steps to Reproduce: Login as an employee Open a draft PR Add a line item with the supplier and category set in the buyer group Use the 2nd GL created for the Company code (not selected in buyer group definition) Default buyer group should apply Save the line item Click on Apply to All button Select the GL account entered in Buyer Group definition Click on  Apply Changes Verify that Buyer Group is still the default Actual :  Buyer group remains the same, although another buyer group is now matched based on the GL selection Expected : When buyer group already set in Line item is no more matching the fields set on line item the Document lever error should come",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-19T06:21:48.018-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95459",
        "summary": "Stage - Accounts Payable - Code Invoice - Purchasing Organization is not saving through Apply to ALL and Purchasing Organization is missing error shows",
        "description": "url:   https://stage-go.vroozi.com/#/login APCoder username:   aqsa.rani+apc@vroozi.com passw0rd:  Qwerty@1 Pre-Requisites: PO Based Invoice should have been sent in coding to the APCoder User e.g Invoice #  9000029257 Steps to Reproduce: Access the desired Invoice to code Select all Items and click to Apply to All button. Add all the required fields including purchasing organization and save Please see that Purchasing organization is missing error shows View details of the item and see purchasing organization filed has no value Actual Result: Purchasing Organization is not set and error shows Expected Result: Purchasing Organization should be set by Apply to All Screenshot:",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-19T03:34:02.965-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95454",
        "summary": "Stage - Accounts Payable - AP Inbox - Error in Console upon Clicking to Create Invoice on the Popup against a Multi Page OCR Document. ",
        "description": "Environment: https://devqa5-go.vroozi.com Username :  asma.latif+AP2@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. A Multipage PDF email should have been sent at the hopper address.   Steps to Reproduce: Access Inbox>Document Inbox. Click the Ellipses Icon against the newly arrived document in the Document Inbox Grid. Click to Either Create Invoice/Create Memo. A pop up appears. Ensure “All Pages” option selected and click to Create Invoice button. Pease see the error in Console. Invoice Screen shows after sometime but the popup remains processing on the screen. Access Archive Inbox. Repeat the aforementioned steps for the multipage document. Please see two errors in Console. Actual Result: Via Document Inbox:  Error in Console upon Clicking to Create Invoice on the Popup against a Multi Page OCR Document. Via Archive Inbox:  Two errors in Console and the Invoice Screen never shows. Expected Result:   No Errors should show in Console and Invoice Created successfully via both Document Inbox and Archive Inbox. Screen shot: Via Document Inbox: Via Archive Inbox: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-19T03:18:45.613-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95398",
        "summary": "PMan- Accounting info is being removed while doing POCR, when editing of Accounting info is not allowed and user updates company info through Apply to All modal",
        "description": "Server : stage Credentials :   ayesha.waseem+emp@vroozi.com/ Welcome1@ Pre-req: Dictate accounting via Company Code toggle is ON. From Documents → Settings→ Purchase order → update accounting info toggle is disabled for Non-catalog line items. Steps to reproduce: Log in to PMan with given credentials. Go to the purchase order screen. Open any purchase order and choose \"change request\" from the Fab Icon. Select all line items Click on  \"apply to all\" button. Search a company code, Purchasing Org and Plant code Click on Save changes System updates Company info and removes accounting info Actual : Document level errors are shown for missing Accounting info Expected : Accounting info should not be removed when Editing of accounting info is not allowed",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-18T08:57:03.383-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95362",
        "summary": "PMan- Accounting element is being removed on changing Shipping address, Delivery date and Tax code",
        "description": "Server : Stage Credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: PR is in draft mode Steps to Reproduce: Login with above user Open PR in draft mode Select a line item Click on Apply to All Change either Delivery date / shipping address OR tax code  Click on Save Changes Actual : Accounting information is removed from line items Expected : Accounting information should not be removed from line items",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-18T03:02:39.281-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95340",
        "summary": "Stage - Supplier Portal - Users - Create User - Error shows in Console while Saving the New User's Info on the Create User Modal.",
        "description": "URL: https://stage-go.vroozi.com/#/login?org=880852895&view=supplier Username:  asma.latif+SUP2401-Admin@vroozi.com Password: Blueangel1@ PreCondition User should have been logged into SP. Steps: Access Users Page and click to Create User. Add Details and Click to Save. It takes sometime to Save. Please see Error shows in Console. Actual result: Error shows in Console. expected result: No Error should generate in Console. Screen-Shot: Thanks, Asma",
        "status": "Abandoned",
        "assignee": "Jaroslav Bellus",
        "created": "2024-01-17T23:04:07.296-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95311",
        "summary": "Stage - Accounts Payable - Create Invoice - Search item - Keyboard shortcut [ / ] gving error in console ",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   aqsa.rani+processor@vroozi.com password:  Qwerty@1 Steps to Reproduce: Create Invoice and link PO Press [ / ] on keyboard for search item Please see the error in console Actual Result: Error showing in console Expected Result: No error should show  Screenshot:",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-17T04:18:07.329-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95307",
        "summary": "PMAN: Buyer User unable to select correct Buyer Group while creating PO.",
        "description": "Description Environment:  Stage, unitId 2 User:   iqtidar.arshad+buyer1@vroozi.com  / Welcome1! Pre Conditions: Above mentioned user is logged into PMAN application. Buyer Group already created with supplier, category and company code. (Same combination will be used while creating PO from Buyer user). Another Buyer group is also available which has supplier and category only. This Buyer group is also set as default buyer group. Steps to Reproduce: Navigate to Buyer Route → Create Order. Enter mandatory data and click Continue button. Enter Shipping Address and again click continue button. Click “Add Item” button and enter Mandatory data while selecting company code as “007” and Buyer group as “Iqtidar Buyer Group”. Select Cost Center as “CC_007”. Actual Result: The Buyer Group is changed to “AR Buyer Group” which is the default buyer group. This buyer group does not have any company associated with it whereas I had selected “Iqtidar Buyer Group” which had company “007” selected. Also “Iqtidar Buyer Group” buyer group is no longer available in the Buyer group menu. Expected Results: Buyer group with the correct combination should be displayed. Screenshots: Note: This is happening for the employee user as well while creating a PR line item.",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-17T03:37:21.117-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95291",
        "summary": "Data Validation error message appeared on the response payload when re-creating a deleted purchasing Organization",
        "description": "cURL: curl --location 'https://staging-api.vroozi.com/v1/purchasing-orgs' \\\n--header 'Content-Type: application/json' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--data '{\n    \"externalId\": \"HS QA Regression RC4\",\n    \"code\": \"HS QA Regression RC4\",\n    \"description\": \"Hasnat Purchasing Organization Description\",\n    \"active\": true,\n    \"companyCodeRef\": {\n        \"docNo\": \"HS QA Regression RC1\",\n        \"type\": \"CompanyCodeModel\",\n        \"archived\": false\n    }\n}' Pre-Condition: Purchasing Organization “ HS QA Regression RC4 \" already created Steps to reproduce: Delete the purchasing organization  “ HS QA Regression RC4 \" from the UI Create a Purchasing Organization using POST endpoint: https://staging-api.vroozi.com/v1/purchasing-orgs Actual Result: Data Validation error message appeared on the response payload when re-creating a deleted purchasing Organization Response Payload: {\n    \"id\": \"4503e3a8-e9d7-461f-9642-444def99dd8d\",\n    \"status\": \"409\",\n    \"title\": \"Conflict\",\n    \"errors\": [\n        {\n            \"code\": \"409\",\n            \"element\": \"code\",\n            \"message\": \"Field [code] should be unique within the company code. Provided value: [HS QA Regression RC4] already exists and associated with the company code [HS QA Regression RC1].\",\n            \"detail\": \"Field error in object 'purchasingOrganizationModel' on field 'code': rejected value [HS QA Regression RC4]; codes [409.purchasingOrganizationModel.code,409.code,409.java.lang.String,409]; arguments []; default message [Field [code] should be unique within the company code. Provided value: [HS QA Regression RC4] already exists and associated with the company code [HS QA Regression RC1].]\",\n            \"level\": \"Field Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-17T08:13:09.428+0000\"\n} Expected Result: Purchasing Organization should be created",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Adnan",
        "created": "2024-01-17T00:47:46.300-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95269",
        "summary": "Stage - Accounts Payable - Create Invoice - Add Item - Keyboard shortcut for next tab shift+J is working for previous tab instead of next tab and [shift+k] is working for next tab instead of previous tab",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   aqsa.rani+processor@vroozi.com password:  Qwerty@1 Steps to Reproduce: Create Invoice and Add line item Fill the necessary fields in first tab Press shift+J on keyboard to move to accounting tab Please see nothing happened press shift+k  Accounting tab opened Actual Result: Shift+K is working for next tab and shift+J is working for previous tab Expected Result: shift+J should work for next tab and shift+k should work for previous tab",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-16T11:42:40.968-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95222",
        "summary": "PMan- Location, Class and Location Type data is not being removed when sourcing approver associates Company code where Location Type is not required",
        "description": "Server : Stage Credentials :  ayesha.waseem+14+sourcing@vroozi.com  / Welcome1@ Pre-Req: PR is routed to sourcing approver  This PR must have company code where Location Type is true Steps to Reproduce: Login with above user Open PR from Approver Request list Click on Edit button Select a line item Click on Apply to All Apply the Company code for which Location Type is not required Click on Save Changes Click on Done button Open the Line item Actual : Location type, location and class fields are still coming with old company code information Expected : Location type, location and class fields data should be wipe off Location type, location and class fields are still coming with old company code information",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-15T22:19:13.333-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95201",
        "summary": "PMan- Warning message is not disappearing when Sourcing approver comes out of Editing mode",
        "description": "Server : Stage Credentials :  ayesha.waseem+14+sourcing@vroozi.com  / Welcome1@ Pre-Req: PR is routed to sourcing approver  Steps to Reproduce: Login with above user Open PR from Approver Request list Click on Edit button Select a line item Click on Apply to All Enter different GL value which should not match with already applied company code on line item Click on Save Changes Warning message appears Click on Done button Actual : Warning message is not coming Expected : Warning message should disappear when user is out of editing mode",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-15T04:15:42.637-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95190",
        "summary": "Add the updatedDate field to the MongoDB collection storing PR custom fields",
        "description": "Acceptance Criteria: Add updatedDate in document custom field collection whenever Purchase Request/Change Request get added/updated Write script to add updatedDate in existing records.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-15T02:21:19.538-0800",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-95185",
        "summary": "Catalog is mapped to an inactive Content view on the Postman",
        "description": "cURL: curl --location 'https://staging-api.vroozi.com/v1/catalogs/content-views-associations/upsert' \\\n--header 'Content-Type: application/json' \\\n--header 'Authorization:  eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--header 'x-api-key:  9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--data '{\n    \"catalogRef\": {\n        \"docNo\": \"HS Catalog 156\"\n    },\n    \"contentViewRefs\": [\n        {\n            \"id\": \"\",\n            \"externalId\": \"\",\n            \"docNo\": \"HS Content View 02\",\n            \"type\": \"\",\n            \"label\": \"\",\n            \"archived\": false\n        }\n\n]\n\n}' Pre-condition:  Content View “ HS Content View 02 ” already created and in  Inactive  status Steps to reproduce: Mapping a content view “HS Content View 02” to a Catalog “HS Catalog 156” using POST endpoint: https://staging-api.vroozi.com/v1/catalogs/content-views-associations/upsert Actual Result: Catalog is mapped to an inactive Content view. Response Payload: {\n    \"contentViewRefs\": [\n        {\n            \"id\": \"6533\",\n            \"externalId\": null,\n            \"docNo\": \"HS Content View 02\",\n            \"label\": \"HS Content View 02 - Hasnat Content View\",\n            \"type\": \"ProfileModel\",\n            \"archived\": false\n        }\n    ],\n    \"catalogRef\": {\n        \"id\": \"65a1165e9f48324d8656b269\",\n        \"externalId\": \"HS Catalog 156\",\n        \"docNo\": \"HS Catalog 156\",\n        \"label\": \"HS Catalog 156\",\n        \"type\": \"CATALOG_MODEL\",\n        \"archived\": false\n    }\n} Expected Result: Catalog should not be mapped to an inactive Content view.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Adnan",
        "created": "2024-01-15T00:51:59.440-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95183",
        "summary": "PMan- Warning message is showing {0} instead of line number, incase message was for only 1 line item. (Italian)",
        "description": "Server : Stage Credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Italian should be set in user profile Steps to Reproduce: Login with above user open a draft PR Select a line item Click on Apply to All Enter different GL value which should not match with already applied company code on line item Click on Save Changes Verify the warning message Actual : {0} is coming instead of Line item number Expected : Line item number should be mentioned in warning message",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-15T00:07:32.020-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95166",
        "summary": "AccVal : Once xlsx file is uploaded via bulk upload Dates are different from the uploaded data",
        "description": "Server Stage Steps to Replicate: Login from admin, Navigate to Master Data > Accounting Strings On the Accounting strings screen click on upload accounting string verify the dates mentioned in file and uploaded and shown on UI Expected Result: Uploaded Valid From and Valid to dates should be same as mentioned in the file Actual Result: Valid From and Valid to Dates are different from uploaded file, see screen shot.",
        "status": "Awaiting Business Validation",
        "assignee": "Masood Safi",
        "created": "2024-01-14T22:42:32.970-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95162",
        "summary": "Acc Val : While downloading accounting string file as xlsx date format saved in dd/mm/yyyy different from UI format i.e mm/dd/yyyy ",
        "description": "Server Staging Steps to Reproduce: Login from admin Navigate to Master Data > Accounting Strings screen Verify export accounting string icon click on export accounting string and save xlsx file  Expected Result: Exported file should have same date format as saved from UI i.e Add new accounting string Actual Result: Date format saved in file is unlike from UI mm/dd/yyyy and saved as dd/mm/yyyy",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-01-14T22:07:15.645-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95137",
        "summary": "Acc Val : Screen Flickering is happening once user hower mouse between Upload and download Accounting string Icons,",
        "description": "Server Stage Steps to Replicate: Login from admin, Navigate to Master Data > Accounting Strings On the Accounting strings screen Mouse hover on upload and download accounting string icons horizontal scroll bar start appearing and screen gets flickering as well.  Expected Result: Screen flickering should not happen. Actual Result: Screen Flickering is happening as well as horizontal scroll bar starts appearing. See attached VDO as reference.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-01-12T03:52:26.755-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95132",
        "summary": "Stage - Accounts Payable - Code Invoice - AcVal Error is not triggering on Apply to ALL Modal.",
        "description": "Environment:  https://stage-go.vroozi.com Username :  asma.latif+APCoder@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: PO Based Invoice should have been sent in EH to the EMP User.  (9000029145/2000029350)   Steps to Reproduce: Access Invoices and open the desired Invoice.   9000029144 Select all Items and click to Apply to All button. Select Accounting details which donot conform to the AcVal String.  AcVal Error does not trigger. Actual Result: AcVal  does not trigger and error does not show. Expected Result: AcVal should trigger and show AcVal Error correctly. Screenshot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-12T03:20:53.223-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95131",
        "summary": "Stage - PMAN - EMP/EH - Invoice in Exception Handling does not have the Apply to ALL Modal Opening.",
        "description": "Environment:  https://stage-go.vroozi.com Username :  asma.latif+EMP2401@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: PO Based Invoice should have been sent in EH to the EMP User.  (9000029145/2000029350)   Steps to Reproduce: Access Invoices and open the desired Invoice. Select all Items and click to Apply to All button. Nothing Happens. Actual Result: Apply to ALL Modal does not open. Expected Result: Apply to ALL Modal should be displayed Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-12T03:20:02.765-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95127",
        "summary": "Allow presets to be defined/managed using the the Budgets field on the new Apply to All modal",
        "description": "Business Case: The objective is to update the \"Manage Presets\" tab on the Apply to All modal to incorporate the Budgets field, ensuring it adheres to the same rules and patterns as on the main tab. This tab allows users to define and save combinations of values (using the same fields as on the main tab) with a unique name. These presets can then be used to auto-populate fields on the main tab. Specifics for the Manage Presets Tab: The Budgets field needs to be integrated following the same visibility and optional status rules as in the main Apply to All modal. Users should be able to define combinations of values including the Budgets field and other parent elements (Company Code, Purchasing Organization, Plant, Cost Center, GL Code). The system should allow these combinations to be saved with unique names. Presets should be recallable for auto-populating fields on the main tab. Acceptance Criteria: Integrate the Budgets field on the Manage Presets tab, ensuring it behaves consistently with its implementation on the main Apply to All modal. Enable users to create and save presets that include combinations of Budgets and its parent elements. Ensure each preset can be named uniquely and saved within the system. Allow these presets to be easily recalled and used to auto-populate fields on the main Apply to All modal. Verify that the implementation aligns with the visibility rules and behaviour of the Budgets field as specified for the main tab in",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-12T02:59:44.252-0800",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-95120",
        "summary": "PMan - Plant field is not populating on selecting only Location (which has a default Plant code set) on Apply to All modal",
        "description": "Server : stage credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Company and Accounting information is set in Master data User profile should not have default company code set Create a Location for which default Plant code is set Steps to Reproduce: Login as an employee Open a draft PR Select the line item  Click on Apply to All button Select a Location type and Location (created in Pre-Req) Plant code is not populating Click on  Apply Changes Open the Line item Default Plant code is set on the line item Actual :  On Apply to All Modal, on selecting Location, default Plant code is not being populated Expected : On Apply to All Modal, on selecting Location, default Plant code should be populated",
        "status": "Awaiting Business Validation",
        "assignee": "Sajid Akram",
        "created": "2024-01-11T23:51:01.663-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95115",
        "summary": "PMan- Manage Preset: If you select a saved preset in the \"apply to all\" model and then delete the saved Purchasing Organization value, the system won't filter out Purchasing Organizations based on the chosen company code in the line item model.",
        "description": "Server : stage Credentials :  Admin :  notifyvroozi14@gmail.com  / Welcome1 Employee :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-req: Preset is saved against company code having more than one Purchasing Organization. Steps to reproduce: Login into the PMan using given employee credentials Open a PR in draft Select a line Item Click on Apply to All button Select saved preset against company code having more than one Purchasing Organization. Delete already saved Purchasing organization. Actual : When choosing a saved preset, and delete Purchasing Organization then the the system won't filter out Purchasing Organizations based on the chosen company code in the line item model. Expected : the system should filter out Purchasing Organizations based on the chosen company code in the line item model.",
        "status": "Awaiting Business Validation",
        "assignee": "Sajid Akram",
        "created": "2024-01-11T22:55:05.181-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95080",
        "summary": "Catalog Status is not correct on the POST response payload ",
        "description": "Environment:  Stage Unit id:  83 Steps to Reproduce: Create a Catalog using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/ Actual Result: “NEW_PROCESSED” is showing on the response Payloadr Response Payload: {\n    \"id\": \"659fb9349f48321a8df7ee48\",\n    \"externalId\": \"HS Catalog 109 \",\n    \"dateCreated\": \"2024-01-11T09:47:32.499+0000\",\n    \"lastUpdated\": \"2024-01-11T09:47:32.516+0000\",\n    \"name\": \"HS Catalog 109\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 1,\n    \"description\": \"Hasnat Catalog description\",\n    \"supplierRefs\": [\n        {\n            \"name\": \"Hasnat Supplier stage83\",\n            \"vendorId\": \"333\",\n            \"address\": {\n                \"street1\": \"123\",\n                \"street2\": \"\",\n                \"city\": \"New York\",\n                \"postalCode\": \"10001\",\n                \"state\": {\n                    \"name\": \"New York\",\n                    \"code\": \"NY\"\n                },\n                \"country\": {\n                    \"name\": \"United States of America\",\n                    \"code\": \"US\"\n                },\n                \"buildingCode\": null,\n                \"roomNo\": null,\n                \"floor\": null,\n                \"email\": \"hasnat.saleem+Supplier_Stage83@vroozi.com\",\n                \"phone\": \"+1 (201) 555-5555\"\n            },\n            \"id\": \"360131\",\n            \"externalId\": \"\",\n            \"docNo\": \"483578594\",\n            \"label\": \"333 - Hasnat Supplier stage83\",\n            \"type\": \"SUPPLIER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"approverRefs\": [\n        {\n            \"id\": \"72924\",\n            \"externalId\": null,\n            \"docNo\": \"hasnat.saleem+approver2_stage83@vroozi.com\",\n            \"label\": \"Hasnat Approver 1\",\n            \"type\": \"USER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"submitterRef\": {\n        \"id\": \"71820\",\n        \"externalId\": \"\",\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": \"2023-12-12\",\n    \"validTo\": \"2024-12-12\",\n    \"timeZone\": \"-12:00\",\n    \"contractNumber\": \"HS01\",\n    \"contractLineItem\": \"HS01\",\n    \"catalogStatus\": \"NEW_PROCESSED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 0,\n    \"inputRecordsCount\": null,\n    \"outputRecordsCount\": null,\n    \"failedRecordsCount\": null,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": \"Test\",\n    \"language\": \"en\",\n    \"quantityLocked\": true,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} Expected Result: “NEW_PROCESSED” should be updated to NEW",
        "status": "Awaiting Business Validation",
        "assignee": "Waheed Nawaz",
        "created": "2024-01-11T02:28:41.446-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95061",
        "summary": "Payables: Inline Item Edit: Pressing ENTER should result into saving the change and dismissing the edit mode",
        "description": "Pressing ENTER should result into saving the change and dismissing the edit mode Steps: Inline Edit Item field (e.g. Description, Unit Price, Quantity, GL Account) Change the value Press ENTER Actual Result No change Expected Result Inline Edit item change should be saved and edit mode should be dismissed",
        "status": "Resolved",
        "assignee": "Aqsa Rani",
        "created": "2024-01-10T14:56:18.592-0800",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-95053",
        "summary": "RC-2024-1 - Payables - Regression Testing",
        "description": "",
        "status": "Done",
        "assignee": "Asma Latif",
        "created": "2024-01-10T08:52:22.998-0800",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-95031",
        "summary": "PMan - application only applies Company info on Catalog line item through apply to All modal",
        "description": "Server : stage credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Company and Accounting information is set in Master data User profile should not have default company code set Steps to Reproduce: Login as an employee Search a catalog line item and add it into cart Open the cart and move the line item to PR Select the line item  Click on Apply to All button Enter Company and Accounting info in all fields Click on  Apply Changes Actual :  “Line Item #1: Field ‘accounting info' missing” document error is displayed. It only saved Company Info Expected : When user provide the complete set then it should be saved",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-10T02:35:26.636-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95027",
        "summary": "PMan - application throws blank error massage on Apply to All modal, if catalog line item doen't have any company or accounting info applied",
        "description": "Server : stage credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Company and Accounting information is set in Master data User profile should not have default company code set Steps to Reproduce: Login as an employee Search a catalog line item and add it into cart Open the cart and move the line item to PR Select the line item  Click on Apply to All button Select a value in GL code or any other independent company or accounting field Click on  Apply Changes Actual :  Error bullet appears on Apply to all modal Expected : Validation error should come at document level (not sure, what should happen)",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-10T01:56:38.882-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95015",
        "summary": "Stage - Accounts Payable - AP Inbox - SP Invoice when clicked shows error.",
        "description": "Environment: AP:  https://stage-go.vroozi.com SP:  https://stage-go.vroozi.com/#/login?org=880852895&view=supplier Username :  asma.latif+APM@vroozi.com /  asma.latif+SUP2401-admin@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. SP Invoice should have been submitted already.  9000029087   Steps to Reproduce: Access Inbox>Document Inbox. Click the Supplier Portal Invoice document in the grid. Please see Red Error noty shows at left bottom. Check in Network tab the last call it states Invoice Submit event in REd. Click again,Refresh Error shows. Click to Refresh. SP Invoice Document is no more in the Inbox grid now. Access Track Invoices>ALL in descending order. Please see its there. Actual Result: Error shows when SP Invoice Document is clicked in the Document Inbox grid. Expected Result: No Error should show and invoice should open successfully when clicked from the Document Inbox. Screen shots: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-10T00:11:23.083-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95011",
        "summary": "500 Internal Error appears on the Postman when changing the status of the VersionNumber 2 Catalog using POST endpoint, but in the UI catalog status can be updated",
        "description": "CURL: curl --location 'https://staging-api.vroozi.com/v1/catalogs/status-update' \\\n--header 'Content-Type: application/json' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--data-raw '{\n    \"payload\": {\n        \"docNo\": \"HS Catalog 104\",\n        \"action\": \"APPROVE\",\n        \"submitterRef\": {\n            \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\"\n        }\n    }\n}' Pre-Condition: Catalog “HS Catalog 104” already created and in Published status with Version Number 2 Steps to reproduce: Changing the catalog status from working to approved using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/status-update Actual Result: Response Payload: {\n    \"id\": \"11efc9f9-5d3f-4100-88ab-9c9ddd6e4bdc\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 104\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-10T07:36:45.237+0000\"\n} Expected Result: Validation error should not be appeared on the response Payload: Note: UI Behaviour: Able to change the Catalog status in UI",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2024-01-09T23:27:56.111-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-95006",
        "summary": "500 Internal Error is appeared on the Postman when updating the VersionNumber 2 Catalog using PUT endpoint and but the Catalog can be updated in the UI",
        "description": "CURL: curl --location --request PUT 'https://staging-api.vroozi.com/v1/catalogs/catalog-name/HS Catalog 105' \\\n--header 'Content-Type: application/json' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--data-raw '{\n    \"name\": \"HS Catalog 105\",\n    \"submitterRef\": {\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"quantityLocked\": false\n}' Pre-Condition: Catalog “HS Catalog 105” already created and in Published status Steps to reproduce: Change the catalog items file by using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/item-upload Response Payload: {\n    \"id\": \"659e3d8b38165a1d211143a7\",\n    \"externalId\": \"HS Catalog 105\",\n    \"dateCreated\": \"2024-01-10T06:43:45.486+0000\",\n    \"lastUpdated\": \"2024-01-10T06:47:39.987+0000\",\n    \"name\": \"HS Catalog 105\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 2,\n    \"description\": \"Hasnat Catalog description\",\n    \"supplierRefs\": [\n        {\n            \"name\": \"Hasnat Supplier stage83\",\n            \"vendorId\": \"333\",\n            \"address\": {\n                \"street1\": \"123\",\n                \"street2\": \"\",\n                \"city\": \"New York\",\n                \"postalCode\": \"10001\",\n                \"state\": {\n                    \"name\": \"New York\",\n                    \"code\": \"NY\"\n                },\n                \"country\": {\n                    \"name\": \"United States of America\",\n                    \"code\": \"US\"\n                },\n                \"buildingCode\": null,\n                \"roomNo\": null,\n                \"floor\": null,\n                \"email\": \"hasnat.saleem+Supplier_Stage83@vroozi.com\",\n                \"phone\": \"+1 (201) 555-5555\"\n            },\n            \"id\": \"360131\",\n            \"externalId\": \"\",\n            \"docNo\": \"483578594\",\n            \"label\": \"333 - Hasnat Supplier stage83\",\n            \"type\": \"SUPPLIER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"approverRefs\": [\n        {\n            \"id\": \"72924\",\n            \"externalId\": null,\n            \"docNo\": \"hasnat.saleem+approver2_stage83@vroozi.com\",\n            \"label\": \"Hasnat Approver 1\",\n            \"type\": \"USER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"submitterRef\": {\n        \"id\": \"71820\",\n        \"externalId\": \"\",\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": \"2023-12-12\",\n    \"validTo\": \"2024-12-12\",\n    \"timeZone\": \"-12:00\",\n    \"contractNumber\": \"HS01\",\n    \"contractLineItem\": \"HS01\",\n    \"catalogStatus\": \"PUBLISHED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 23,\n    \"inputRecordsCount\": 23,\n    \"outputRecordsCount\": 23,\n    \"failedRecordsCount\": 0,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": \"Test\",\n    \"language\": \"en\",\n    \"quantityLocked\": true,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} Login the Smart OCI as an admin user and navigate to the Content Manager screen Updating the “HS Catalog 3” catalog record using the DELETE endpoint: https://staging-api.vroozi.com/v1/catalogs/catalog-name/HS Catalog 105 Actual Result: Response Payload: {\n    \"id\": \"76b00ffa-0358-4581-b29d-9d0ad58dd1cd\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 105\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-10T06:54:37.414+0000\"\n} Expected Result: Validation error should not be appeared on the response Payload: Note: UI Behaviour: Able to update the Catalog in UI",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2024-01-09T22:39:47.677-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94991",
        "summary": "PROD - Accounts Payable - Inline Edit issues",
        "description": "Environment: Any (e.g. stage) Username : notifyvroozi@gmail.com Password:  Welcome1 Prerequisite : Invoice in DRAFT with some items Issue #1 First Field is not updated after second is focused and blured Steps: Inline Edit Item field (e.g. Description, Unit Price, Quantity) Change the value Focus another field (e.g. Description, Unit Price, Quantity) Blur the field unchanged Actual Result Edited first field is not updated via API call Expected Result Edited first field is updated via API call Issue #2 Pressing ESC should result into canceling the change Steps: Inline Edit Item field (e.g. Description, Unit Price, Quantity, GL Account) Change the value Press ESC Actual Result No change Expected Result Inline Edit item should be canceled without any change Note: ESC should not propagate in closing the dialog if opened via hopper or edit invoice opened from grid ellipsis",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-09T17:50:58.394-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94990",
        "summary": "PROD - Accounts Payable - Keyboard shortcuts modal shows empty with an error in console",
        "description": "Environment: https://go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Redangel1! Pre-Requisites: AP User should have logged into the Application. Steps to Reproduce: Access Inbox. Press shift + ? Empty Keyboard shortcuts modal opens. Actual Result: Keyboard shortcuts modal shows empty with an error in console. Expected Result: Keyboard shortcuts relevant details should show on the modal. Screen-Shot: Note:  Please refer    for more details. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-09T13:02:51.061-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94987",
        "summary": "PROD - Supplier Portal - Create Invoice - Side Panel - Related Docs - Clicking the PO link does nothing for the first time invoice is created.",
        "description": "Environment:  https://go.vroozi.com/#/login?org=880852895&view=vroozi1test Username :  asma.latif+SUP2311-Admin@vroozi.com Password:  Redangel1@ Pre-Requisites: SP User should have logged into the Application.   Steps to Reproduce: Access a Ready PO via Dashboard>Task grid. Confirm it.  (2000013977) Click the FAB button on bottom right and Flip to PO. Create Invoice Screen shows.  (9000008737) Traverse Side Panel Tab Icons one by one until Related Docs tab. Click the PO link. Nothing Happens. Actual Result: Clicking the PO link does nothing for the first time invoice is created. Save it / move away and then back on the Invoice now the PO is accessible if clicking in the side panel related docs. Expected Result: PO should be accessible anytime. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-09T10:42:18.544-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94986",
        "summary": "500 Internal Error is appeared on the Postman when deleting the VersionNumber 2 Catalog using GET endpoint and but the Catalog can be deleted in the UI",
        "description": "CURL: curl --location --request DELETE 'https://staging-api.vroozi.com/v1/catalogs/catalog-name/HS Catalog 103' \\\n--header 'Content-Type: application/json' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' Pre-Condition: Catalog “HS Catalog 103” already created and in Published status Steps to reproduce: Change the catalog items file by using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/item-upload Response Payload: {\n    \"id\": \"659d5b3c38165a1d211141ff\",\n    \"externalId\": \"HS Catalog 103\",\n    \"dateCreated\": \"2024-01-09T14:38:51.467+0000\",\n    \"lastUpdated\": \"2024-01-09T14:42:04.670+0000\",\n    \"name\": \"HS Catalog 103\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 2,\n    \"description\": \"Hasnat Catalog description\",\n    \"supplierRefs\": [\n        {\n            \"name\": \"Hasnat Supplier stage83\",\n            \"vendorId\": \"333\",\n            \"address\": {\n                \"street1\": \"123\",\n                \"street2\": \"\",\n                \"city\": \"New York\",\n                \"postalCode\": \"10001\",\n                \"state\": {\n                    \"name\": \"New York\",\n                    \"code\": \"NY\"\n                },\n                \"country\": {\n                    \"name\": \"United States of America\",\n                    \"code\": \"US\"\n                },\n                \"buildingCode\": null,\n                \"roomNo\": null,\n                \"floor\": null,\n                \"email\": \"hasnat.saleem+Supplier_Stage83@vroozi.com\",\n                \"phone\": \"+1 (201) 555-5555\"\n            },\n            \"id\": \"360131\",\n            \"externalId\": \"\",\n            \"docNo\": \"483578594\",\n            \"label\": \"333 - Hasnat Supplier stage83\",\n            \"type\": \"SUPPLIER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"approverRefs\": [\n        {\n            \"id\": \"72924\",\n            \"externalId\": null,\n            \"docNo\": \"hasnat.saleem+approver2_stage83@vroozi.com\",\n            \"label\": \"Hasnat Approver 1\",\n            \"type\": \"USER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"submitterRef\": {\n        \"id\": \"71820\",\n        \"externalId\": \"\",\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": \"2023-12-12\",\n    \"validTo\": \"2024-12-12\",\n    \"timeZone\": \"-12:00\",\n    \"contractNumber\": \"HS01\",\n    \"contractLineItem\": \"HS01\",\n    \"catalogStatus\": \"PUBLISHED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 23,\n    \"inputRecordsCount\": 23,\n    \"outputRecordsCount\": 23,\n    \"failedRecordsCount\": 0,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": \"Test\",\n    \"language\": \"en\",\n    \"quantityLocked\": true,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} Login the Smart OCI as an admin user and navigate to the Content Manager screen Deleting the “HS Catalog 3” catalog record using the DELETE endpoint: https://staging-api.vroozi.com/v1/catalogs/catalog-name/HS Catalog 103 Actual Result: Response Payload: {\n    \"id\": \"d9457298-aac9-4311-80af-dd70891d1d48\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 103\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T15:18:19.645+0000\"\n} Expected Result: Validation error should not be appeared on the response Payload: Note: UI Behaviour: Able to delete the Catalog in UI",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2024-01-09T07:08:47.764-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94985",
        "summary": "500 Internal Error is appeared on the Postman when fetching the VersionNumber 2 Catalog using GET endpoint",
        "description": "CURL: {\n    \"id\": \"e70110b9-353c-4c67-ac27-2e14d9df33fa\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 103\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T14:49:14.945+0000\"\n} Pre-Condition: Catalog “HS Catalog 103” already created and in Published status Steps to reproduce: Change the catalog items file by using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/item-upload Response Payload: {\n    \"id\": \"659d5b3c38165a1d211141ff\",\n    \"externalId\": \"HS Catalog 103\",\n    \"dateCreated\": \"2024-01-09T14:38:51.467+0000\",\n    \"lastUpdated\": \"2024-01-09T14:42:04.670+0000\",\n    \"name\": \"HS Catalog 103\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 2,\n    \"description\": \"Hasnat Catalog description\",\n    \"supplierRefs\": [\n        {\n            \"name\": \"Hasnat Supplier stage83\",\n            \"vendorId\": \"333\",\n            \"address\": {\n                \"street1\": \"123\",\n                \"street2\": \"\",\n                \"city\": \"New York\",\n                \"postalCode\": \"10001\",\n                \"state\": {\n                    \"name\": \"New York\",\n                    \"code\": \"NY\"\n                },\n                \"country\": {\n                    \"name\": \"United States of America\",\n                    \"code\": \"US\"\n                },\n                \"buildingCode\": null,\n                \"roomNo\": null,\n                \"floor\": null,\n                \"email\": \"hasnat.saleem+Supplier_Stage83@vroozi.com\",\n                \"phone\": \"+1 (201) 555-5555\"\n            },\n            \"id\": \"360131\",\n            \"externalId\": \"\",\n            \"docNo\": \"483578594\",\n            \"label\": \"333 - Hasnat Supplier stage83\",\n            \"type\": \"SUPPLIER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"approverRefs\": [\n        {\n            \"id\": \"72924\",\n            \"externalId\": null,\n            \"docNo\": \"hasnat.saleem+approver2_stage83@vroozi.com\",\n            \"label\": \"Hasnat Approver 1\",\n            \"type\": \"USER_MODEL\",\n            \"archived\": false\n        }\n    ],\n    \"submitterRef\": {\n        \"id\": \"71820\",\n        \"externalId\": \"\",\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": \"2023-12-12\",\n    \"validTo\": \"2024-12-12\",\n    \"timeZone\": \"-12:00\",\n    \"contractNumber\": \"HS01\",\n    \"contractLineItem\": \"HS01\",\n    \"catalogStatus\": \"PUBLISHED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 23,\n    \"inputRecordsCount\": 23,\n    \"outputRecordsCount\": 23,\n    \"failedRecordsCount\": 0,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": \"Test\",\n    \"language\": \"en\",\n    \"quantityLocked\": true,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} Login the Smart OCI as an admin user and navigate to the Content Manager screen Fetching the “HS Catalog 3” catalog record using the GET endpoint: https://staging-api.vroozi.com/v1/catalogs/catalog-name/HS Catalog 103 Actual Result: Response Payload: {\n    \"id\": \"e70110b9-353c-4c67-ac27-2e14d9df33fa\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 103\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T14:49:14.945+0000\"\n} Expected Result: Validation error should not be appeared on the response Payload:",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2024-01-09T07:05:31.546-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94973",
        "summary": "Fix issues with the Budgets field on the new Apply to All modal",
        "description": "Business Case: The goal is to modify the behavior of the Budgets field on the Apply to All modal. This field is conditionally visible based on whether the Budgets functionality is enabled for the user's unitID. Once enabled, the Budgets field should always be visible on the Apply to All modal and be optional by default. Specific Use Cases: Changing Only the Budget : When a user selects a budget for the line items using the Apply to All modal, the system should display all active, non-deleted budgets from the user's company account. The user can search and select a budget without being required to fill other fields. The system should then evaluate if the selected budget matches the existing company and accounting info on the item. If it matches, the change is applied; if not, a warning message (as per   ) is shown. Changing Parent Elements of Budgets : If any parent element (Company Code, Purchasing Organization, Plant, Cost Center, GL Code) is altered, all these fields, including the Budget field, become mandatory. The system should then provide a list of budgets based on the combination of these parent elements. The user's specified combination is applied to all selected items without further validation, as the modal already ensures a valid combination. Acceptance Criteria: Modify the Budgets field visibility to always appear when the Budgets functionality is enabled. Ensure the Budgets field is optional by default. Implement a functionality to display all active, non-deleted budgets for selection. Enable a search feature within the budget selection list. Allow the application of a selected budget to all chosen items, with system validation against existing item data. In the case of only Budget being changed, display a warning message if the selected budget doesn't match the item's existing data, using the pattern specified in   . Ignore these original requirements.  Make Budget and its parent elements (Company Code, Purchasing Organization, Plant, Cost Center, GL Code) mandatory if any one of the parent elements is altered. When parent elements are also specified, provide a filtered list of budgets based on the combination of the parent elements specified by the user. Ensure the system applies the combination of changes to all selected items without additional validation in the case of parent element modification. The updated requirements; following the team’s discussion and review of the existing Budgets implementation on 01/22/2024, are documented below.  In the case of any one of the parent elements ( which includes Company Code, Purchasing Org, Plant, Cost Center, GL Code ) of the Budget field being modified by the user, the Budget field should automatically become required on the Apply to All modal. This will ensure that the Apply to All modal will always send a combination of the parent element, and a Budget to be applied to the selected line items.  The system should evaluate the user’s specified value for the parent element, against the company info + accounting info already present on the selected line items, one at a time. If the user’s specified value can be used with the data already present on a given line item, the system should update that field in said line item, with the user’s specified change. if it can’t be used, then the system should leave the line item as it is and display a warning message using the pattern specified in   . Once the parent element has been updated, the system should then evaluate the user’s specified value for the Budget field, against the data present on the line item. If it can be applied to the line item, then the system should update the Budget in the line item. Otherwise, the system should leave the Budget field blank on the line item, and show the user the standard “ Budget missing ” error message at the document level.  Additional information regarding the scope of work being covered in this ticket, as determined after discussion with QA: Purchase team will work off of the assumption, that the BE logic currently in the system; as of 01/22/2024, to fetch Budgets that can be used on a given line item, is working correctly. If there are any issues with that particular service’s behavior, it will be referred to and addressed by the Budget team.  Example scenario to clarify the above statement: If the user updates the values in the GL Code and Budget fields on the Apply to All modal; say he selects  GL1  and  BudgetABC , respectively.  The system will 1st evaluate  GL1  against the given Company Code data on the selected line item.  Assuming that  GL1  can be used with the given company code, the system will update the value of the GL Code field in the line item to  GL1 .  Next, the system will use the existing Budget fetching logic to get all active budgets that can be used with the combination of Company Code, Purchasing Org, Plant, Cost Center and GL Code on the line item. If the user’s specified Budget;  BudgetABC , is included in that list, the system will update the Budget field’s value on the line item to  BudgetABC . Alternatively, if  BudgetABC  isn’t part of that list returned by the system, then the budget field on the line item will be reset to empty, and the standard “ Budget missing ” error message will be displayed for that line item, at the document level.",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-09T03:42:00.298-0800",
        "issue_type": "Story",
        "parent_id": null
      },
      {
        "key": "VZI-94960",
        "summary": "500 Internal server error appeared on the response payload when re-uploading the file in the version 2 Published Catalog ",
        "description": "Pre-Condition: Catalog  HS Catalog 102   already created on stage and in Published status Steps to reproduce: Change the catalog items file by using the POST endpoint: https://staging-api.vroozi.com/v1/catalogs/item-upload Response Payload: {\n    \"id\": \"659d1c0338165a760308902c\",\n    \"externalId\": null,\n    \"dateCreated\": \"2024-01-09T10:05:20.405+0000\",\n    \"lastUpdated\": \"2024-01-09T10:12:19.862+0000\",\n    \"name\": \"HS Catalog 102\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 2,\n    \"description\": null,\n    \"supplierRefs\": null,\n    \"approverRefs\": null,\n    \"submitterRef\": {\n        \"id\": \"71820\",\n        \"externalId\": \"\",\n        \"docNo\": \"hasnat.saleem+employee_stage83@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": null,\n    \"validTo\": null,\n    \"timeZone\": null,\n    \"contractNumber\": null,\n    \"contractLineItem\": null,\n    \"catalogStatus\": \"PUBLISHED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 5,\n    \"inputRecordsCount\": 5,\n    \"outputRecordsCount\": 5,\n    \"failedRecordsCount\": 0,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": null,\n    \"language\": \"en\",\n    \"quantityLocked\": false,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} Login the Smart OCI as an admin user and navigate to the Content Manager screen Re execute the same request on the postman Actual Result: {\n    \"id\": \"f6b93498-4335-448b-b345-be1226896243\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Query { \\\"$java\\\" : Query: { \\\"unitId\\\" : \\\"83\\\", \\\"name\\\" : \\\"HS Catalog 102\\\", \\\"deleted\\\" : false }, Fields: { }, Sort: { } } returned non unique result.\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T10:15:51.545+0000\"\n} Expected Result: 500 Internal Server error should not be appeared in the response payload and “ Submission Failed: An offline/pending version of this catalog already exists” error should appeared There should be no error if the catalog is updated again using the same payload. However if the previous request to update the catalog is not completed the catalog is in locked status. System should not give 500 error response in this case. Following error message should be thrown to the client {\n    \"id\": \"f6b93498-4335-448b-b345-be1226896243\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"\",\n            \"message\": \"Cannot process this catalog request as multiple versions with the [<name/externalId>] exist.\",\n            \"detail\": \"Cannot process this catalog request as multiple versions with the [<name/externalId>] exist. Please either use id to process the request or merge multiple version of the catalog and send the request again.\",\n            \"level\": \"Data Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T10:15:51.545+0000\"\n} UI behaviour:",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2024-01-09T02:23:07.829-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94958",
        "summary": "Stage - Supplier Portal - Create Invoice - Error shows in Console upon clicking in and inputting value in the Tax field.",
        "description": "Environment: https://stage-go.vroozi.com Username :  asma.latif+SUP2401-Admin@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: SP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice.  (9000029034) Click to Add an Item. Add details. Click in the Tax field. Please see error in console. Type a value in the tax field. Please see error in console. Actual Result: Error shows in Console if user clicks in and inputs a value in the tax field. Expected Result: No error should show in Console anytime. Screen shot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-09T01:43:37.562-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94952",
        "summary": "Stage - Accounts Payable - Create Invoice - Purchasing Organization Field is not showing on screen",
        "description": "url:   https://stage-go.vroozi.com/#/login username:   aqsa.rani+processor@vroozi.com password:  Qwerty@1 Prerequisite: “ACCOUNTS_PAYABLE_WORKFLOW__PURCHASING_ORGANIZATION” feature toggle is enabled in db Purchase Organization Field is set as Required/Optional in Documents->Settings->All Documents Steps to Reproduce: Login through given credentials Click on create invoice->Add line item Please see that Purchase Organization field is not showing on the screen Actual Result: Purchase Organization field is not showing Expected Result: Purchase Organization field should be shown on the screen Screenshot:",
        "status": "Awaiting Business Validation",
        "assignee": "Jaroslav Bellus",
        "created": "2024-01-09T00:08:41.144-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94951",
        "summary": "When no zip file is attached to the \"imageFile\" field, ImageFile is passing the null value and throwing the invalid format error",
        "description": "CURL curl --location 'https://staging-api.vroozi.com/v1/catalogs/item-upload' \\\n--header 'Content-Type: application/json' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--form 'catalogRef=\"{\\\"docNo\\\":\\\"HS Catalog 7802\\\"}\";type=application/json' \\\n--form 'resourceFile=@\"/C:/Users/hp/Desktop/Paper/AR Paper.xlsx\"' \\\n--form 'imageFile=@\"/path/to/file\"' Pre-condition: Catalog ( HS Catalog 7802 ) already created on the Stage Steps to reproduce: POST endpoint for catalog file upload https://staging-api.vroozi.com/v1/catalogs/item-upload catalogRef:{\"docNo\":\" HS Catalog 7802 \"} Actual Result: When no zip file is attached to the \"imageFile\" field, ImageFile is passing the null value and throwing the invalid format error Response Payload: {\n    \"id\": \"e2f1c3c5-4ac7-4cb1-bbf3-c916bd63b632\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"imageFile\",\n            \"message\": \"Provided [imageFile] is not valid.\",\n            \"detail\": \"Provided [imageFile] is not valid. Please check the file and upload again\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T07:48:11.616+0000\"\n} Expected Result: imageFile is not required, there should be no error.",
        "status": "Awaiting Business Validation",
        "assignee": "Sudip Bolakhe",
        "created": "2024-01-09T00:04:17.302-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94948",
        "summary": "Stage - Create Invoice - Add Item - Getting error in console when Plant field is focused",
        "description": "url:  https://stage-go.vroozi.com/#/login username:  aqsa.rani+processor@vroozi.com password: Qwerty@1 Steps to Reproduce: Login through given credentials Click create Invoice->Add line item Fill all the mandatory field and click on Plant  Please see the error coming in console Actual result: Error coming in console when Plant field is focused Expected Result: No error should show in console Screenshot:",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2024-01-08T23:34:52.339-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94940",
        "summary": "When no zip file is attached to the \"imageFile\" field, an incorrect error message is displayed in the response payload.",
        "description": "CURL curl --location 'https://staging-api.vroozi.com/v1/catalogs/item-upload' \\\n--header 'Content-Type: application/json' \\\n--header 'x-api-key: 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA' \\\n--form 'catalogRef=\"{\\\"docNo\\\":\\\"HS Catalog 7802\\\"}\";type=application/json' \\\n--form 'resourceFile=@\"/C:/Users/hp/Desktop/Paper/AR Paper.xlsx\"' \\\n--form 'imageFile=@\"/path/to/file\"' Pre-condition: Catalog ( HS Catalog 7802 ) already created on the Stage Steps to reproduce: POST endpoint for catalog file upload https://staging-api.vroozi.com/v1/catalogs/item-upload catalogRef:{\"docNo\":\" HS Catalog 7802 \"} Actual Result: When no zip file is attached to the \"imageFile\" field, an incorrect error message is displayed in the response payload. Response Payload: {\n    \"id\": \"e2f1c3c5-4ac7-4cb1-bbf3-c916bd63b632\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"imageFile\",\n            \"message\": \"Provided [imageFile] is not valid.\",\n            \"detail\": \"Provided [imageFile] is not valid. Please check the file and upload again\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T07:48:11.616+0000\"\n} Expected Result: Request should be processsed properly",
        "status": "Awaiting Business Validation",
        "assignee": "Sudip Bolakhe",
        "created": "2024-01-08T22:36:47.747-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94935",
        "summary": "PMAN- The user encounters difficulty in establishing a new buyer group, with an associated exception being recorded in the console.",
        "description": "Server : stage Credentials : Admin :  notifyvroozi14@gmail.com / Welcome1 Pre-req: Steps to reproduce: Login into the PMan using given credentials Go to  Master Data → Buyer Data On buyer group screen Click on Add Buyer Group Button Actual Result : Upon clicking the \"add buyer group\" option, the system remains inactive, yet an exception linked to the GL account is being logged in the console. Expected Result : User should be able to create new buyer group.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-08T21:53:51.319-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94920",
        "summary": "Stage - Accounts Payable - Create Invoice - Application goes unresponsive when Qty is updated via inline editing on the Invoice Screen.",
        "description": "Environment: https://go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice. Add an Item. Select the Qty value via inline edit. Update and click away from the grid. Please see Invoice disappears and click anywhere on the Application Screen. Nothing happens. Actual Result: Application goes unresponsive when Qty is updated via inline editing on the Invoice Screen. Expected Result: Qty should be updated and clicking anywhere else shouldn’t hide away the invoice screen. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-08T04:10:53.383-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94919",
        "summary": "Stage - Accounts Payable - Supplier Invoice/Memo #, Total, PO # and other few column values are missing on the Track Invoices/Memo Pages.",
        "description": "Environment: https://go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Access Track Invoice>ALL Remove any filter. Please see Supplier Invoice #, Total and PO # are empty. Access Track Memo>ALL Remove any filter. Please see Supplier memo #, Total and PO # and other column values are missing. Actual Result: Column values are missing on the Track Invoices/Memo Pages. Expected Result: All column values should be available on the Track Pages. Screen shots: Thanks, Asma",
        "status": "Duplicate",
        "assignee": "Sheikh Mavin",
        "created": "2024-01-08T04:09:23.367-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94911",
        "summary": "PMAN -  On Create PO Wizard, Buttons and labels on the bottom of Add item page are fixed at it's place",
        "description": "Server : Production Credentials :  ayesha.waseem+prod+buyer@vroozi.com  / Welcome1@ Steps to Reproduce: Login as a Buyer user Start Creating a PO through Wizard Navigate to  Let’s add some items to your order Add more than 5 line items Actual : Line Item 5 is hidden behind the buttons Expected : Buttons should move down as we add more items",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2024-01-08T03:03:11.342-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94909",
        "summary": "Wrong Error Message displayed in response payload when no file is attached in the request only catalog docNo is Passed.",
        "description": "CURL curl --location 'https://staging-api.vroozi.com/v1/catalogs/item-upload' \\\n--header 'Content-Type: application/json' \\\n--header 'Authorization: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiI4OWY3Y2Y0Ni01NjBlLTQwYWYtYjQ3OC05MDA1OTI2ZjBhMjkiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiOGIwNDljZDktZGZiMi00MzU0LWIyNjgtOWQ4ZjJmZDhmZjNhIn0.293oLnPkuSNST11uzTWLT9cVnL28MCk9hXdz-yJkRJu9k5d83jL_2r9QFORNTSozsLSwooPDhdW-MqEGgC354Q' \\\n--header 'x-api-key: xpRZF0Sazu8i6ShvdCYnB7ZxBrLbkrU43CGMhhe1' \\\n--form 'catalogRef=\"{\\\"docNo\\\":\\\"Waheed Catalog 01\\\"}\";type=application/json' \\\n--form 'resourceFile=@\"/path/to/file\"' \\\n--form 'imageFile=@\"/path/to/file\"' Pre-condition: Catalog ( Waheed Catalog 01 ) already created on the Stage Steps to reproduce: POST endpoint for catalog file upload https://staging-api.vroozi.com/v1/catalogs/item-upload catalogRef:{\"docNo\":\" Waheed Catalog 01 \"} Actual Result: Wrong Error Message displayed in response payload when no file is attached in the request only catalog docNo is Passed. User is not passing any resource file but it gives error message Provided file is no valid. Response Payload: {\n    \"id\": \"b702d5cd-0ef6-467d-a41a-4f744cdf4825\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"resourceFile\",\n            \"message\": \"Provided [resourceFile] is not valid.\",\n            \"detail\": \"Provided [resourceFile] is not valid. Please check the file and upload again\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-08T10:02:48.655+0000\"\n} Expected Result: Error Message should be updated   Sir,   bahi {\n    \"id\": \"b702d5cd-0ef6-467d-a41a-4f744cdf4825\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"resourceFile\",\n            \"message\": \"[resourceFile] is a required parameter.\",\n            \"detail\": \"[resourceFile] is a required parameter. Please select a valid file and upload again.\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-08T10:02:48.655+0000\"\n}",
        "status": "Awaiting Business Validation",
        "assignee": "Sudip Bolakhe",
        "created": "2024-01-08T02:11:29.029-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94895",
        "summary": "PMAN: Data on multiple master data grids is missing like Users, Accounting String, buyers.",
        "description": "Server :  Stage unit Id 2 User:  notifyvroozi@gmail.com Pre Conditions: Above mentioned user is logged into PMAN application. Acc val feature toggle should be “ON” from the db \"ACCOUNTING_STRING_VALIDATION\". Steps to Replicate: Navigate to Master Data → Users Navigate to Master Data → Accounting String Navigate to Master Data → Buyer Expected Result: Proper data should be displayed on the grids.  Actual Result: Data on these grids is missing. Screenshot:",
        "status": "Awaiting Business Validation",
        "assignee": "Unassigned",
        "created": "2024-01-07T23:50:39.150-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94891",
        "summary": "PROD - Accounts Payable - AP Inbox - Task Inbox Multiple Status filter results issue.",
        "description": "Environment: https://go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Access Inbox>Task Inbox. Put a filter of status Parked it gives 2  Also Put of filter of status Draft it remains 2 ,  Remove Parked status i.e Draft stays on and now it filters 103 docs. Actual Result: Multi Status results are not adding up and giving 500 internal error in the console. Expected Result: More than 1 status filter results should add up correctly and no error shown in the console too. Screen shots: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-07T23:33:19.421-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94876",
        "summary": "Regression Testing Integration Team RC-2024-1",
        "description": "",
        "status": "Done",
        "assignee": "Waheed Nawaz",
        "created": "2024-01-07T23:15:23.133-0800",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-94872",
        "summary": "Stage - Accounts Payable - AP Inbox - Issues with the Received Date filter.",
        "description": "Environment: https://stage-go.vroozi.com Username :  asma.latif+APM@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application.   Steps to Reproduce: Access Inbox>Document Inbox. Place Received Date filter for On/After/Before in the grid’s search bar. Results populate accordingly. Click the Archive link on top right of the Inbox grid. Place Received Date filter for On/After/Before in the grid’s search bar. Results populate accordingly. Switch to the Inbox by clicking the Inbox link on top right of the Inbox grid. Please see the Date has gone missing in the filter applied. Switch to the Archive by clicking the Archive link on top right of the Inbox grid. Please see the Date has gone missing in the filter applied. Actual Result: Date has gone missing in the Received Date filter applied. Expected Result: Filter details should remain intact while switching between the Inbox and Archive. Screen shot: Note : Same Issue is being observed while applying filter using Received/Assigned Date in the Ellipses drop down menu for both Inbox and Task grids, respectively. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-07T22:56:35.389-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94866",
        "summary": "Integration - DEVQA5 - AP Inbox - Create Invoice/Memo Popup for OCR Document Containing More than 1 Pages has issues.",
        "description": "Environment: https://devqa5-go.vroozi.com Username :  asma.latif+AP2@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. A Multipage PDF email should have been sent at the hopper address.   Steps to Reproduce: Access Inbox>Document Inbox. Click the Ellipses Icon against the newly arrived document in the Document Inbox Grid. Click to Either Create Invoice/Create Memo. A pop up appears. Issue 1:  Please see the options have checkbox. Issue 2:  Please see 2nd option has text box missing to mention no. of page/ range of pages. Actual Result: Issue 1:  Please see the options have checkbox. Issue 2:  Please see 2nd option has text box missing to mention no. of page/ range of pages. Expected Result: (Please see the Screenshot from STAGE) Expected 1:  Popup should show the radio buttons against the options. Expected 2:  2nd Option should have the text box to mention no. of page/ range of pages. Screen shot: Stage: DEVQA5: Thanks, Asma",
        "status": "Resolved",
        "assignee": "Asma Latif",
        "created": "2024-01-05T10:46:40.063-0800",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-94845",
        "summary": "Integration - DEVQA5 - AP Inbox - Error shows in Console if user clicks Cancel on the Document Delete Pop up in the Document Inbox grid.",
        "description": "Environment: https://devqa5-go.vroozi.com Username :  asma.latif+AP2@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: AP User should have logged into the Application. A PDF email should have been sent at the hopper address.   Steps to Reproduce: Access Inbox>Document Inbox. Click the Ellipses Icon against the newly arrived document in the Document Inbox Grid. Click to Delete Document. A pop up appears. Click to Cancel on the Popup. Please see Error in Console shows. Actual Result: Cancelling the Delete Document Action shows an Error in Console. Expected Result: No Error should generate. Screen shot: Thanks, Asma",
        "status": "Resolved",
        "assignee": "Asma Latif",
        "created": "2024-01-05T01:00:28.142-0800",
        "issue_type": "Defect",
        "parent_id": null
      },
      {
        "key": "VZI-94794",
        "summary": "System does not show the list of all content views associated with the catalog when a new content view is merged. ",
        "description": "Environment: Devqa12 PreConditions:  POSTMAN is set up with API requests with proper configuration.  Catalogs are created Content view is created and associated with the catalog above.  a new content view is created without any association.  Steps to reproduce:  Send a post request to content view association upsert. with the doc no of the newly created content view which is not associated with the catalog.  url: https:// dev-api.vroozi.com /v1/catalogs/content-views-associations/upsert {\n  \"catalogRef\": {\n    \"id\": \"6594f92cc508ee1c33600bf8\"\n  },\n  \"contentViewRefs\": [\n    {\n      \"id\": \"\",\n      \"externalId\": \"\",\n      \"docNo\": \"SA-005-03\",\n      \"type\": \"CostCenterModel\",\n      \"label\": \"Description for label\",\n      \"archived\": false\n    }\n  ]\n} Actual Result:  the payload shows only the content view that is recently merged in the request above {\n    \"contentViewRefs\": [\n        {\n            \"id\": \"1187\",\n            \"externalId\": null,\n            \"docNo\": \"SA-005-03\",\n            \"label\": \"SA-005-03 - SA-005-03\",\n            \"type\": \"ProfileModel\",\n            \"archived\": false\n        }\n    ],\n    \"catalogRef\": {\n        \"id\": \"6594f92cc508ee1c33600bf8\",\n        \"externalId\": \"SA-005\",\n        \"docNo\": \"SA-005\",\n        \"label\": \"SA-005\",\n        \"type\": \"CATALOG_MODEL\",\n        \"archived\": false\n    }\n} Expected Result:  The request payload should show the list of all the content views associated with the catalog.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Adnan",
        "created": "2024-01-03T04:53:48.119-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94765",
        "summary": "Payables: Edit Item Scroll flicking issue",
        "description": "Steps: Open an Invoice in DRAFT status Click on the Edit item icon  Actual Result Scroll acts weirdly and jumps multiple times Expected Result Scroll should be fluent as for adding the item",
        "status": "Awaiting Business Validation",
        "assignee": "Sheikh Mavin",
        "created": "2024-01-02T20:59:05.720-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94764",
        "summary": "Payables: Shift + Tab should work from Split Account Assignment",
        "description": "Steps: Open an Invoice in DRAFT status Edit Invoice Item Navigate to Accounting Tab and focus the field  Split Account Assignment Press Shift+Tab Actual Result Description is focused Expected Result The last editable input (i.e. Plant) field is focused",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2024-01-02T20:54:08.219-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94559",
        "summary": "500 Internal Error is appeared on the Postman when without passing the request payload",
        "description": "Environment:  devqa12 Unit Id:  “2” Authorization:  eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjOTNkOGYyMS1kNmE0LTQzNDQtOTc5NS05NjBmZGJmODRmYTciLCJVTklUX0lEIjoiMiIsIlJBTkRPTV9OVU1CRVIiOiJkZTI3ZDMwMS01YzA2LTQyZDItYmZiZS04NjNkNTcyMmNlNzMifQ.DUwbWy0DV3kLcCU28Bhyf2pgbT43KnPIGCjimZMueyhwqvKC46jRwHQklDTK98U0cKARuE7Ke70Hc6ZGQ0Nz0g x-api-key:  0HUVkZ6TDN3IDow68gHNu6nXhnL6z7DV23iYA5O3 Steps to Reproduce: Upload without the items request payload using the POST endpoint https://dev-api.vroozi.com/v1/catalogs/item-upload Response Payload: {\n    \"id\": \"2b7a5c0d-3964-4100-b1be-2f78ed04089e\",\n    \"status\": \"500\",\n    \"title\": \"Internal Server Error\",\n    \"errors\": [\n        {\n            \"code\": \"500\",\n            \"element\": \"\",\n            \"message\": \"Something is wrong, please contact administrator.\",\n            \"detail\": \"Current request is not a multipart request\",\n            \"level\": \"System Error\"\n        }\n    ],\n    \"timestamp\": \"2023-12-21T12:15:47.211+0000\"\n} Actual Result: 500 Internal Error is appeared on the Postman when without passing the request payload Expected Result: 422 Unprocessable Entity error should appear and 500 Error should not have appeared on the response payload {\n    \"id\": \"b702d5cd-0ef6-467d-a41a-4f744cdf4825\",\n    \"status\": \"422\",\n    \"title\": \"Unsupported Media Type\",\n    \"errors\": [\n        {\n            \"code\": \"422\",\n            \"element\": \"\",\n            \"message\": \"Request is not valid.\",\n            \"detail\": \"Request is not valid. Please check headers, payload body and resend request again.\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-08T10:02:48.655+0000\"\n}",
        "status": "Awaiting Business Validation",
        "assignee": "Sudip Bolakhe",
        "created": "2023-12-21T04:15:04.483-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94543",
        "summary": "PMan- Manage Preset: When choosing a saved preset, the Purchasing Organization field stays empty. This happens when a user saves a preset for one Purchasing Organization and later creates a second one for the same company code.",
        "description": "Server : production Credentials :  Admin :  qa.admin@vroozi.com Employee :  javaid.sattar+employee@vroozi.com  / Welcome1@ Pre-req: Only one Purchasing Org should exist against  company code( RC-2023-8). Steps to reproduce: Login into the PMan using given employee credentials Open a PR in draft Select a line Item Click on Apply to All button Click on manage preset tab.  Create and save New Preset against company RC-2023-8. Now login with admin user  Go to master data ->> Organization  Define another (second) Purchasing Org. against company RC-2023-8.  Now Login again into the PMan using given employee credentials Open a PR in draft Select a line Item Click on Apply to All button.  Select saved preset against company RC-2023-8. Actual : When choosing a saved preset, the Purchasing Organization field remains empty because there are now two purchasing organisations linked to the same company. Expected : Selecting a saved preset should maintain the Purchasing Organization field and populate all previously entered data without any changes.",
        "status": "Released",
        "assignee": "Javaid Sattar",
        "created": "2023-12-20T22:31:17.296-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94520",
        "summary": "DEVQA5 - Integration - Create Invoice - Location is not saving against the item and error shows in Console.",
        "description": "Environment: https://devqa5-go.vroozi.com Username :  asma.latif+APM83@vroozi.com Password:  Blueangel1@/ Blueangel1! Pre-Requisites: Accounting Validations should be enabled. AP User should have logged into the Application.   Steps to Reproduce: Click to Create Invoice.  9000001898 Add an Item details ensuring Location too. Please see associated Location Type does not auto populate. Save the Item. Edit Open, Please see Location is empty. Check Console. Please see error shows. Actual Result: Location is not saving and error shows in Console. Expected Result: Location should save correctly and no error should appear in Console. Screen shot: Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2023-12-20T00:58:15.317-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94405",
        "summary": "\"CatalogService Exception:\" appeared when clicking the Error with processing catalog ",
        "description": "Environment:  devqa12 Unit Id:  “2“ Authorization:  eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjOTNkOGYyMS1kNmE0LTQzNDQtOTc5NS05NjBmZGJmODRmYTciLCJVTklUX0lEIjoiMiIsIlJBTkRPTV9OVU1CRVIiOiJkZTI3ZDMwMS01YzA2LTQyZDItYmZiZS04NjNkNTcyMmNlNzMifQ.DUwbWy0DV3kLcCU28Bhyf2pgbT43KnPIGCjimZMueyhwqvKC46jRwHQklDTK98U0cKARuE7Ke70Hc6ZGQ0Nz0g x-api-key:  0HUVkZ6TDN3IDow68gHNu6nXhnL6z7DV23iYA5O3 Pre-condition: Catalog (HS Catalog 03) already created on the devqa12 Steps to reproduce: Upload the items to the catalog using the POST endpoint.  https://dev-api.vroozi.com/v1/catalogs/item-upload catalogRef:{\"docNo\":\"HS Catalog 03\"} Response Payload: {\n    \"id\": \"657ae2c1c508ee47cb0b2ae2\",\n    \"externalId\": null,\n    \"dateCreated\": \"2023-12-14T11:10:57.672+0000\",\n    \"lastUpdated\": \"2023-12-14T11:22:31.561+0000\",\n    \"name\": \"HS Catalog 03\",\n    \"catalogType\": \"INTERNAL\",\n    \"versionNumber\": 1,\n    \"description\": \"Hasnat Catalog description\",\n    \"supplierRefs\": null,\n    \"approverRefs\": null,\n    \"submitUserRef\": {\n        \"id\": \"14009\",\n        \"externalId\": \"Hasnat Employee devqa12\",\n        \"docNo\": \"hasnat.saleem+employee_devqa12@vroozi.com\",\n        \"label\": \"Hasnat Employee\",\n        \"type\": \"USER_MODEL\",\n        \"archived\": false\n    },\n    \"active\": true,\n    \"validFrom\": null,\n    \"validTo\": null,\n    \"timeZone\": null,\n    \"contractNumber\": null,\n    \"contractLineItem\": null,\n    \"catalogStatus\": \"NEW_PROCESSED\",\n    \"approvedItemsCount\": 0,\n    \"rejectedItemsCount\": 0,\n    \"pendingItemsCount\": 0,\n    \"publishedItemsCount\": 0,\n    \"inputRecordsCount\": null,\n    \"outputRecordsCount\": null,\n    \"failedRecordsCount\": null,\n    \"externalDefinition\": {\n        \"punchOutMethod\": null,\n        \"customImageField\": null,\n        \"communicationType\": null,\n        \"encodingType\": null,\n        \"extrinsicFields\": []\n    },\n    \"clientCatalogId\": null,\n    \"language\": \"en\",\n    \"quantityLocked\": false,\n    \"transferItemDescription\": true,\n    \"searchAllowed\": false\n} login into the smartOCI as admin user Username:  notifyvroozi@gmail.com Password: Welcome1 Navigate to the CONTENT MANAGER → CATALOG MANAGEMENT Click on the “Error with processing, Error” Actual Result: \"CatalogService Exception:\" appeared when clicking the Error with processing catalog  Expected Result: Error should be appear in the response payload when user uploads the image file directly without zip file extention. {\n    \"id\": \"a3c1d400-2b9c-4951-acb3-8996dc08d57d\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"element\": \"imageFile\",\n            \"message\": \"Provided [imageFile] is not valid.\",\n            \"detail\": \"Provided [imageFile] is not valid. Supported file type are: [zip].\",\n            \"level\": \"Request Error\"\n        }\n    ],\n    \"timestamp\": \"2024-01-09T14:23:29.548+0000\"\n}",
        "status": "Awaiting Business Validation",
        "assignee": "Hasnat.saleem",
        "created": "2023-12-14T03:47:16.023-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94316",
        "summary": "Compile an Inventory of Areas Potentially Affected by Third-Party Cookies Phaseout - Phase I",
        "description": "Goal Identify all areas in PMAN + SmartOCI that might be impacted due to Third-Party Cookies Phaseout Context Google Chrome has announced plans to begin disabling third-party cookies for 1% of users starting in the first quarter of 2024. This action is intended for testing purposes, with the process gradually scaling up to 100% of users, probably starting sometime in Q3 2024. Source:    Browsers such as Firefox and Safari have already phased out third-party cookies. Microsoft Edge, which is based on the Chromium engine, has not yet announced any changes, and for now, third-party cookies are allowed by default. It is crucial to ensure that Vroozi customers are not significantly impacted by these planned changes. Therefore, we need to identify all areas that might be affected by the disabling of third-party cookies. Note Adab mentioned that it has been reported that customers have already complained about Looker not working in Firefox and Safari -   . Tasks Compile the inventory of potential issues introduced by Third-Party cookies in the following Google Sheet:    Identify all potential issues along with the customers who might be impacted Ensure that we have testing steps to reproduce the functionality Audit cookies while executing testing steps (refer to:  https://developers.google.com/privacy-sandbox/3pcd#audit ) Test for breakage (refer to:  https://developers.google.com/privacy-sandbox/3pcd#test ). This is to simulate the state after the phase-out. Note: If we are unable to execute the audit or the test for breakage, we should ask the client to perform the test on our behalf. If the functionality will stop working, we need to prioritize the issue based on customer usage and the complexity of the solution Inventory sheet :",
        "status": "Done",
        "assignee": "Jaroslav Bellus",
        "created": "2023-12-12T16:05:55.192-0800",
        "issue_type": "Task",
        "parent_id": null
      },
      {
        "key": "VZI-94176",
        "summary": "Invalid GL account and Projects are being set on line item, if user select values in both fields first and then fill out rest of the fields",
        "description": "Server : devqa20 credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Company and Accounting information is set in Master data Dictate Accounting Via Company Code  should be OFF Steps to Reproduce: Login as an employee Open a draft PR Click on  Add new Item  button Click on GL account and select a GL code randomly Click on Projects field and select a Project randomly Now, select a cost centre for a different Company Code Fill out rest of the required fields (Don’t click in CL Account and Project field)  Click  Save  button on line item modal Actual :  Line item is saved with invalid  GL account  and  Projects.  Expected : Values in GL account and Projects should be reset once, company code is found on Line item modal. Same issue exist on Apply to All modal",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2023-12-05T23:40:09.715-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-94057",
        "summary": "PMan- Application is not auto-populating Location field when user selects a Location Type on Line Item modal",
        "description": "Server : devqa20 credentials :  ayesha.waseem+emp@vroozi.com  / Welcome1@ Pre-Req: Configure company codes with Location type as yes Steps to Reproduce: Login as an employee Open a draft PR Click on Add new line item button Search a company code created in Pre-Req Select a Location Type  Location  is not auto selected Actual :  Location  is not auto selected Expected : On selecting Location type, Location should be auto-populated (if there is only single value against it)",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2023-12-01T02:49:35.187-0800",
        "issue_type": "Bug",
        "parent_id": null
      },
      {
        "key": "VZI-93430",
        "summary": "Purchase Request - When we don't have Purchasing Organization on Line Item modal then system is throwing validation about Plant Code which is already selected",
        "description": "Issue: Purchase Request - When we don't have Purchasing Organization on Line Item modal then system is throwing validation about Plant Code which is already selected Server: Environment: Stage UserName:  notifyvroozi77+NonNBCU@gmail.com  /  zulkiful.bajwa+StageEmployeeUnitId77@vroozi.com Password: @Welcome1 Pre-Conditions: Master Data has been created expect Purchasing Organization Update Line Item Field Configuration by making optional or hidden Purchasing Organization Step to Reproduce: Login to PMAN as an Employee Create PR by adding a line item where all master data has been selected expected Purchasing Organization Save the line item modal and verify the changes Actual Result: System is throwing validation about missing Plant Code which is already selected on Line Item modal Expected Result: If relevant data is selected on document then system should not show any validation about it",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2023-11-05T20:59:22.091-0800",
        "issue_type": "Bug",
        "parent_id": null
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-94939",
      "summary": "API Legacy Issues -> RC-2024-1",
      "description": "",
      "status": "Released",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-01-08T22:35:17.282-0800",
      "issue_type": "Epic",
      "parent_id": null,
      "released_in_current_rc": true
    },
    "issues": [
      {
        "key": "VZI-95286",
        "summary": "NBCU Failed Status still appears when user resubmit the Failed CR from UI.",
        "description": "NBCU Settings Test Case:  https://vroozi.testrail.net/index.php?/cases/view/6956786&group_by=cases:section_id&group_order=asc&display_deleted_cases=0&group_id=665034 Steps to Reproduced: Stage URL:     Employee Login:  waheed.nawaz+employee_stage83-20@vroozi.com Password: Welcome1! Create a PR from UI. Submit it from UI. PR Went to Sourcing Approver. Sourcing Approver Login:  waheed.nawaz+sourcing_approver_stage83-20@vroozi.com Password: Welcome1! Approve it from Sourcing Approver. PR is in Submitted status. Approve this PR from Status Update API.  Create a Full PR Ref PO through API. Go to UI → Open PO Click on Fab icon → Cancel the Purchase Order. Auto CR is created. Pass the Failed Status through Status Update Endpoint and CR is in Failed Status. Open the PO Again. Click on Change Request. Open the Existing CR. Change the first 2 line items and change only the Quantity. ReOpen the Third Line item with same quantity. Click on Submit Button. CR is in Submitted status. Actual Result: CR submitted to external system. When Open the CR the message still appears on UI. “ FAILED: Updating the Purchase Request Status “ Expected Result: In this case when user resubmit the failed CR the should not be visible on UI.",
        "status": "Awaiting Business Validation",
        "assignee": "Sudip Bolakhe",
        "created": "2024-01-16T23:36:20.763-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94939"
      },
      {
        "key": "VZI-91112",
        "summary": "Bulk Upsert Async API showing 500 error instead of a validation in case of payload without 'payload' tag. ",
        "description": "PreConditions:  Postman is installed with proper authorizations.  Steps to Reproduce:  Navigate to bulk upsert async request on Postman.   Send the request using the payload below:  {\n    \"externalId\": \"\",\n    \"accountingElement\": {\n        \"companyCodeRef\": {\n            \"id\": null,\n            \"externalId\": null,\n            \"docNo\": \"JD-01\",\n            \"label\": \"\",\n            \"archived\": false\n        },\n        \"locationRef\": {\n            \"id\": \"\",\n            \"externalId\": \"\",\n            \"docNo\": \"JD-01\",\n            \"label\": \"\",\n            \"archived\": false\n        },\n        \"glAccountRef\": {\n            \"id\": \"\",\n            \"externalId\": \"\",\n            \"docNo\": \"JD-01\",\n            \"label\": \"\",\n            \"archived\": false\n        },\n        \"costObjectRef\": {\n            \"id\": \"\",\n            \"externalId\": \"\",\n            \"docNo\": \"JD-01\",\n            \"label\": \"\",\n            \"type\": \"CostCenterModel\",\n            \"archived\": false\n        }\n    },\n    \"active\": false,\n    \"effectiveStartDate\": \"2023-07-29T22:05:47.368+0000\",\n    \"effectiveEndDate\": \"2023-09-29T22:05:47.368+0000\"\n} Actual Result:  The system returns 500 Response Code.  Expected Result:  The system should show validation.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Adnan",
        "created": "2023-08-22T03:24:55.133-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-94939"
      },
      {
        "key": "VZI-91100",
        "summary": "POST Accounting combo sample response is not correct on swagger ",
        "description": "Environment:  Stage Unit Id:  83 domain:   staging-api.vroozi.com Authorization:  eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzUxMiJ9.eyJBUFBfSUQiOiJjYjNiOGNiNC1jNDQ5LTQ0N2YtYWQ5OS1iMjI1NzljNmY2MjEiLCJVTklUX0lEIjoiODMiLCJSQU5ET01fTlVNQkVSIjoiZGMxMGFjYmYtZmZmNi00NmFiLWI5ZjMtNmI5MDk0YTc3ZWYxIn0.Ln_5-MyhXH5k7kc5kodjGavbb1xyPHA5Bk7eSt0whNQtHU0-BeJAELjcXarYLkQD04a93qpNKugtjfCtHxSnqA x-api -key : 9vPCZmeKIY3pUXVNBEUD59wHp4r6pKsr87voQj0c Steps to Reproduce: Navigate to the “POST” Accounting Combo Sample Responses Actual Response: Sample Response code is showing “200” code Expected Result: “201” code should be appeared in the Sample Response Description should be for create only.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Adnan",
        "created": "2023-08-22T01:07:33.394-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-94939"
      },
      {
        "key": "VZI-90359",
        "summary": "No index number display in response message against company code Ref",
        "description": "Pre Condition: Enable Toggle:  PURCHASE__ACCOUNTING_STRING_VALIDATION Steps to Reproduced: Using Bulk Upsert Endpoint: [\n    {\n        \"externalId\": \"00001\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"43171\",\n                \"externalId\": \"\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"locationRef\": {\n                \"id\": \"64b638593e1b0d40e1b527c2\",\n                \"externalId\": \"\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"LocationModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"64b6382d8a0db877f9ed6750\",\n                \"externalId\": \"\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"64b638443e1b0d40e1b527a3\",\n                \"externalId\": \"\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": true,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    },\n    {\n        \"externalId\": \"00002\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD1\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"locationRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD1\",\n                \"label\": \"\",\n                \"type\": \"LocationModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": true,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    },\n    {\n        \"externalId\": \"00003\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": true,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    },\n    {\n        \"externalId\": \"00004\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": true,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    },\n    {\n        \"externalId\": \"00005\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"\",\n                \"externalId\": \"ABCD1\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"locationRef\": {\n                \"id\": \"\",\n                \"externalId\": \"ABCD1\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"LocationModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"\",\n                \"externalId\": \"ABCD1\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"\",\n                \"externalId\": \"ABCD1\",\n                \"docNo\": \"\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": true,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    },\n    {\n        \"externalId\": \"00006\",\n        \"accountingElement\": {\n            \"companyCodeRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD1\",\n                \"label\": \"\",\n                \"type\": \"CompanyCodeModel\",\n                \"archived\": false\n            },\n            \"glAccountRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD1\",\n                \"label\": \"\",\n                \"type\": \"GlAccountModel\",\n                \"archived\": false\n            },\n            \"costObjectRef\": {\n                \"id\": \"\",\n                \"externalId\": \"\",\n                \"docNo\": \"ABCD1\",\n                \"label\": \"\",\n                \"type\": \"CostCenterModel\",\n                \"archived\": false\n            }\n        },\n        \"active\": false,\n        \"effectiveStartDate\": \"2023-06-29T22:05:48.368+0000\",\n        \"effectiveEndDate\": \"2024-06-29T22:05:47.368+0000\"\n    }\n] Response Payload: {\n    \"id\": \"aa60f420-7c01-4cc3-b7f2-e40ccbdce1e4\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"message\": \"Field [companyCodeRef] cannot be null or empty. At least one of the Field [id, externalId, docNo] should have a value.\",\n            \"detail\": \"Field error in object accountingComboModel on field accountingElement.companyCodeRef. Field  companyCodeRef cannot be null or empty. At least one of the Field [id, externalId, docNo] should have a value.\",\n            \"level\": \"Request Error\",\n            \"element\": \"accountingElement.companyCodeRef\"\n        }\n    ],\n    \"timestamp\": \"2023-07-26T07:42:58.618+0000\"\n} Actual Result: On index number 2 I have not passed company code Ref. In the Response, it returns a Generic message. Expected Result: It should give proper error message with proper indexing like an example against gl account. {\n    \"id\": \"fe7566e6-defa-429f-b06f-b2d67a51701f\",\n    \"status\": \"400\",\n    \"title\": \"Bad Request\",\n    \"errors\": [\n        {\n            \"code\": \"400\",\n            \"message\": \"Field [accountingElement[2].glAccountRef] cannot be null or empty. At least one of the Field [id, externalId, docNo] should have a value.\",\n            \"detail\": \"Error in object 'accountingComboModelList': codes [400.accountingComboModelList,400]; arguments []; default message [Field [accountingElement[2].glAccountRef] cannot be null or empty. At least one of the Field [id, externalId, docNo] should have a value.]\",\n            \"level\": \"Data Error\",\n            \"element\": \"accountingComboModelList\"\n        }\n    ],\n    \"timestamp\": \"2023-07-26T07:46:50.697+0000\"\n}",
        "status": "Awaiting Business Validation",
        "assignee": "Sambhu Sai",
        "created": "2023-07-26T00:44:22.234-0700",
        "issue_type": "Bug",
        "parent_id": "VZI-94939"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-94090",
      "released_in_current_rc": false,
      "summary": "Vroozi Accounting Validation 2024: GA Support Release: Bulk Upload",
      "description": "Vroozi Accounting Validation GA Phase#3 is post MVP phase(refer to  ) where it will become generally available for all the subscribed customers. In this phase, we will cover the following areas: Accounting String Bulk Upload Implement Accounting Validation in Budget Workflow (implemented in   ) For the following point, please refer to the epic    UI CRUD operations for Accounting String master data",
      "status": "Open",
      "assignee": "Muhammad Ahmar Nadeem",
      "created": "2023-12-03T22:51:44.217-0800"
    },
    "issues": [
      {
        "key": "VZI-95184",
        "summary": "AccVal: On error report there is same message duplicated ",
        "description": "Server Stage unit Id 10 Steps to Reproduce: Login from admin, Navigate to Master Data > Accounting Strings Upload accounting string file have already available string  Verify system will generate error report Expected Result:  System should display each message only one time Actual Result: System displays “combo already in use twice“ Issue No.2 On error report file re-upload spelling is not correct Steps to Reproduce: Login from admin, Navigate to Master Data > Accounting Strings Upload accounting string file have already available string  Verify system will generate error report Expected Result: Spelling on error report file should be re-upload Actual Result: spelling on file is reupload",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2024-01-15T00:28:47.154-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94947",
        "summary": "Acc Val: Upon clicking upload bulk accounting string file doesn't get uploaded ",
        "description": "Server Stage Steps to Replicate: Login from admin, Navigate to Master Data > Accounting Strings On the Accounting strings screen click on upload  accounting string  Expected Result: The file should be uploaded without any exception. Actual Result: The waiting circle keeps on moving round and round and never uploads the file successfully or displays any error.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-01-08T23:31:38.726-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94900",
        "summary": "AccVal: When user upload wrong file system neither displays error message nor error report generate",
        "description": "Server: Stage Unit id 10 Steps to Reproduce: Login from admin Navigate to Master Data > Accounting Strings Click on upload accounting string icon and then select wrong file for upload Verify that system will give error message Expected Result: System should give error message and there should be error report generated Actual Result: System neither displays error message nor there is anything comes in DB async_bulk_upload_requests as well  Issue No.2 Server Stage unit id 10 Steps to Reproduce: Login from admin, Navigate to Master Data > Accounting String Click on bulk upload and upload any other file rather than accounting string file Verify system behaviour Expected Result: System will give red noty message and on clicking error report icon system should say “Invalid file format. Kindly download the template and use that file format for bulk upload.“ Actual Result: System display red noty message and on clicking error report it redirect to blank url. If there is any previous error report available then system displays that instead of new",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2024-01-08T00:32:08.711-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94897",
        "summary": "AccVal: when there is already export file available to download and UI icons are hidden then no overlay will be displayed",
        "description": "Server Stage unit ide 10 Steps to Reproduce: Login from admin Navigate to  Master Data > Accounting Strings Click on the export accounting string icon and make the file available for download Now from DB company setting hide the bulk upload icons  Refresh the PMAN and verify file is ready for download overlay displays Expected Result As the bulk upload icons are hidden no overlay should be displayed on screen Actual Result File ready for download still comes on the Accounting String screen however the user can't download anything",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2024-01-08T00:05:42.792-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94778",
        "summary": "AccVal:  On uploading wrong file system doesnt display red noty message",
        "description": "Server devqa2 Steps to reproduce: Login from admin, Navigate to Master Data > Accounting strings Click on upload accounting string and from there upload wrong file Verify system displays red noty message for processing failed  Expected Result: System displays red noty message when user uploads wrong file  Actual Result: System process the file, once user navigate back from any other screen uploading process stops and there is no error message or slider comes that let user knows that file isnt uploaded",
        "status": "Resolved",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2024-01-03T01:04:49.245-0800",
        "issue_type": "Defect",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94773",
        "summary": "AccVal: On upload accounting string spinner is spinning continuously which blocks user to upload file",
        "description": "Server devqa2  Steps to Reproduce: Login from admin, Navigate to master data > accounting strings Verify upload accounting string icon Expected Result: Upload accounting string icon should be there and when user clicks on it, it let user upload file Actual Result:  On opening the screen spinner already spinner on upload accounting string icon that is why user is unable to upload any file",
        "status": "Resolved",
        "assignee": "Zeenat Zahra",
        "created": "2024-01-02T23:58:28.792-0800",
        "issue_type": "Defect",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94565",
        "summary": "AccVal: Admin: Admin can change the status of the accounting string through bulk upload",
        "description": "Business Case: As an admin, I want to change the status of the accounting string(s) through bulk upload. Acceptance Criteria: The following red highlighted portion is not required at this point. Updated on    Admin should provide 'X' or any value in the  Deactivate  column of the downloaded accounting string bulk upload template if they want to deactivate an accounting string. If the current status of the accounting string is inactive and the user tries to deactivate the accounting string, the system should mention that in the error report. The message should be “the accounting string <strigName> is already inactive.“ If the user leaves the  Deactivate  column empty, nothing should happen. Status  (optional input column in upload accounting string file) The user should be able to provide: Active(for activating an accounting string) Inactive(for deactivating an accounting string) If a user leaves the Status field empty, nothing should happen to the existing status of the accounting string. While creating a new accounting string via bulk upload, any  Duration ( valid from, valid to ) or  Status  should be given. If both are missing, the default status should be  Active . ( Updated on  ) If both are given, the system should check the  Duration ( valid from, valid to ) and decide whether to consider the status field. ( Following are the scenarios when the system should not consider the Status field ) If the  Valid From  date is not given, the system should consider the value given in the  Status  field. If the  Valid From  date is given with a future date, the system should ignore the  Status  field if the  Active  value is given.  If only  Status  is given, the system should assign the given status to the accounting string. Please note that above AC should be working for both Creating or updating accounting strings via Bulk UPload",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2023-12-21T22:30:40.122-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94563",
        "summary": "AccVal: Admin: Additional columns in downloaded template and exported accounting strings",
        "description": "Business Case: As an admin, I want to see the  Status ,  Deactivate , and  Deleted  columns in the Downloaded template and exported accounting strings. Acceptance Criteria: Download Template: If the admin downloads the template, it should contain the following additional columns as well in the template file: (in template download, no values should be there) Status  (informational in download template and export accounting strings)( Updated on  ) It is for the current status of the accounting string. This column is just informational in the download template and export accounting strings.  In upload, this column will become an optional status change field(as discussed in  ) Deactivate  (optional, flag) ( The red highlighted portion is not required at this point. Updated on     ) This is the action column. Users can provide' X' If they want to deactivate an accounting string.  Delete  (optional, flag) ( Updated on  ) This is the action column. Users can provide' X' If they want to deactivate an accounting string.  Here is the updated template Export Accounting Strings: If the admin exports the accounting strings, it should contain the following additional columns as well in the exported file Status  (informational) It will contain the current status of the accounting string. This column is just informational.  The user is not required to provide any value in that. Deactivate  (optional, flag) ( The red highlighted portion is not required at this point. Updated on     ) There should be no value in this column of the exported file. This is the action column. Users can provide' X' If they want to deactivate an accounting string.  Delete  (optional, flag)( Updated on  ) There should be no value in this column of the exported file. This is the action column. Users can provide' X' If they want to deactivate an accounting string.",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2023-12-21T21:37:01.764-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-94323",
        "summary": "AccVal: In progress spinner continuously displaying on the export accounting string icon ",
        "description": "Server Devqa2 Steps to Reproduce: Login from admin  Navigate to Master Data  > Accounting Strings screen Verify export accounting string icon  Expected Result: Export accounting string icon should be there, on hovering icon it displays export accounting string and should be clickable Actual Result: In progress spinner is continuously spinning on the icon and it isn’t clickable",
        "status": "Resolved",
        "assignee": "Kiran Koirala",
        "created": "2023-12-12T23:00:31.600-0800",
        "issue_type": "Defect",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-93429",
        "summary": "AccVal: Admin: Admin can download the bulk upload error report",
        "description": "Business Case: As an admin, I want to see the error report if there are any issues in the Accounting String Bulk Upload file. Acceptance Criteria: If there are any type of errors in the bulk upload file or processing failure, the system should show a red exclamation: Hovering on the icon should show a tooltip saying  Download Error Report . Clicking on the   Download Error Report  icon should download the error report.  The system identifies the errors after processing the file: If there are invalid records in the columns of the accounting string bulk upload file, the system should mention them in the error report as per the existing standard of bulk upload error report. Please refer to the following pattern. Row# of the file. Issue(s) that causes the error. If there are multiple errors for a single row, all errors should be visible with comma separated. ( Not Required. Updated on  ) If there are multiple errors for a single row, all errors should be visible in a separate row. ( Added on    ) The Processing Failure: The system supports bulk upload file in XLSX format If the user tries to upload the file in a format the system does not support, there should be a processing failure report. The error report in the PDF should say “Invalid file format. Kindly download the template and use that file format for bulk upload.“ If the user removes any required column from the bulk upload file or provides an invalid column name, the system should provide those details in the PDF error report. Each error should be accommodated in a separate row in case of multiple errors.",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2023-11-05T20:30:37.038-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-93428",
        "summary": "AccVal: Admin: Admin can download the existing accounting strings master data",
        "description": "Business Case: As an admin, I want to download the existing accounting strings in Vroozi master data. Acceptance Criteria: There should be an  Export Accounting Strings  icon above the top right corner of the accounting string table on the Accounting String screen. ( The following image is just for reference. ) Hovering on the icon should show a tooltip saying  Export Accounting Strings . It should be dependent on a sub-feature toggle for UI CRUD operations(refer to  ). If the above-mentioned feature toggle is ON, the user should be able to see the  Export Accounting Strings  icon. If the above-mentioned feature toggle is OFF, the user should not be able to see the  Export Accounting Strings  icon. Clicking on the  Export Accounting Strings  icon should download the template in the xlsx format. When the user clicks on the  Export Accounting Strings  icon, the system should show the following overlay that should disappear automatically: The In Progress spinner should appear around the  Export Accounting Strings  icon: Once the file is processed, The following overlay should appear that should disappear automatically: The  Export Accounting Strings  icon should turn green:  Clicking on the green  Export Accounting Strings  icon should download the accounting strings file. The name of the downloaded file should be  Accounting-Strings-Export-{dateTimeStamp}.",
        "status": "Awaiting Business Validation",
        "assignee": "Sahar Habiba",
        "created": "2023-11-05T20:29:56.771-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94090"
      },
      {
        "key": "VZI-93426",
        "summary": "AccVal: Admin: Admin can  upload the accounting strings via bulk upload file",
        "description": "Business Case: As an admin, I want to be able to upload the accounting strings via bulk upload file. So the system can use them for document validation. Acceptance Criteria: There should be a  Upload Accounting Strings  icon above the top right corner of the accounting string table on the Accounting String screen. ( The following image is just for reference. ) It should be dependent on a sub-feature toggle for UI CRUD operations(refer to  ). If the above-mentioned feature toggle is ON, the user should be able to see the  Upload Accounting Strings  icon. If the above-mentioned feature toggle is OFF, the user should not be able to see the  Upload Accounting Strings  icon. Hovering on the icon should show a tooltip saying  Upload Accounting Strings . Clicking on the  Upload Accounting Strings  icon should open a window where users can select and upload the bulk upload file. Upon Selecting the file, the system should validate the bulk upload file to verify all the data is valid. In case of valid data in the bulk upload file, the system should save the accounting strings uploaded via bulk upload in the DB. There should be a green noty message stating that the file has been uploaded successfully. They should start appearing in the accounting string table. If there are errors in the files, the system should generate an error report which the user can download. (refer to the ticket   ). There should a red noty message stating that the file has been failed to upload or there are errors in the file. Here is the attached template file that should be used for the accounting string bulk upload. There is one optional column  DELETED  in the bulk upload file. It is a flag type(true or false). The user can use it to delete the existing record in the system through bulk upload. The user can provide  X or any letter  in the column to mark the  DELETED  flag true. The accounting string with the  DELETED  flag true should be soft-deleted and kept in the DB. The system should keep it in the DB with the  DELETED  flag true if the user marks the  DELETED  flag true for the string that has never existed in the system before.  Please open the  Instructions  of the attached sheet to understand the validations of each field(column) present in the bulk upload file. The column names(fields) should be case-insensitive. The system should support custom labels for accounting and company objects in the bulk upload file as column(field) names.",
        "status": "Awaiting Business Validation",
        "assignee": "Muhammad Ahmar Nadeem",
        "created": "2023-11-05T20:11:20.668-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94090"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-91878",
      "released_in_current_rc": false,
      "summary": "Modern Niagara Go-Live Blockers",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Naufil Aziz",
      "created": "2023-09-18T01:32:03.662-0700"
    },
    "issues": [
      {
        "key": "VZI-95070",
        "summary": "Apply to all- Manage Preset tab- System is not allowing user to update only Location value through apply to all model when at accounting definition against location apply to all company toggle is selected.",
        "description": "Server : stage Credentials :  Admin :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-req: Multiple location is create against same location type. On both Locations Apply to all Company code toggle is “On” . Steps to reproduce: Log in to PMan with provided credentials. Go to the Non-catalog request. Create new Line item and select Valid company and accounting information. Select all added line items and click on apply to all model Now from apply to all model select other location value of same company code that is not selected on line item before. Actual : Line item level warning message appears and user selected changes are not applied on selected line items. Expected : System should only update Location information data and all accounting information should remain intact.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-11T00:18:37.981-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-95032",
        "summary": "Apply to all- Manage Preset tab- System is not displaying account category objects (Cost Center, WBS, IO, Profit Center)  value on PR When the user uses a saved preset in an existing document, the system updates the accounting information. ",
        "description": "Server : stage Credentials :  Admin :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-req: Dictate accounting via Company Code toggle must be disabled at organization level. From Documents → Purchase order update accounting info toggle must be disabled for Non-cataloge POCR. Preset is already saved with all accounting elements information.” Steps to reproduce: Log in to PMan with provided credentials. Go to the purchase order section. Open any purchase order and choose \"change request\" from the Fab Icon. Select all line items and use the \"apply to all\" button. Pick a saved preset that includes company and accounting information. The system updates company details and some accounting values accordingly. Actual : The system refreshes company specifics and specific accounting details for the line items impacted by the \"Apply to all\" action. Additionally, Account Category Objects like Cost Centers, WBS Elements, IO, and Profit Center values are not visible on the user interface. Expected : System should display Account Category Objects like Cost Centers, WBS Elements, IO, and Profit Center values  on the user interface.",
        "status": "Awaiting Business Validation",
        "assignee": "Sajid Akram",
        "created": "2024-01-10T02:52:39.323-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-95018",
        "summary": "Apply to all- Manage Preset tab- When the user uses a saved preset in an existing document, the system updates the accounting information. However, in the POCR, the option to modify accounting information at the document level is disabled.",
        "description": "Server : stage Credentials :  Admin :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-req: Dictate accounting via Company Code toggle must be disabled at organization level. From Documents → Purchase order update accounting info toggle must be disabled for Non-cataloge POCR. Preset is already saved with all accounting elements information.” Steps to reproduce: Log in to PMan with provided credentials. Go to the purchase order section. Open any purchase order and choose \"change request\" from the Fab Icon. Select all line items and use the \"apply to all\" button. Pick a saved preset that includes company and accounting information. The system updates company details and some accounting values accordingly. Actual : The system updates company details and certain accounting information on the line items affected by the \"Apply to all\" action. Expected : System should only update company information data and all accounting information should remain intact.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2024-01-10T00:22:47.960-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-94910",
        "summary": "Apply to all- Manage Preset tab- The preset contains valid combination of location and location type, but when applying it, Location type field remain empty and data in plant code is selected.",
        "description": "Server : stage Credentials :  Admin :  javaid.sattar+emp1@vroozi.com  / Welcome1@ Pre-req: Company Code and Accounting information must exist in the Master data. Preset is saved with combination of “Location”, “Location Type” and “class.” No value is selected in Plant field  Steps to reproduce: Login into the PMan using given credentials Click on non catalog request Add new items and provide all required information. Select any added line items and click on “Apply To all“ button.  From manage preset field select already define preset having location type , location and class information only. Actual : Location Type field remain empty but plant code value is populated along with location and class. Expected : Selecting a preset should update all valid saved data within it.",
        "status": "Awaiting Business Validation",
        "assignee": "Sajid Akram",
        "created": "2024-01-08T02:53:13.946-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-93979",
        "summary": "PMan- On apply to All modal, user should be able to search through all Active Customers",
        "description": "Server : devqa20 Credentials :  Admin :  notifyvroozi@gmail.com  / Welcome1 Employee : ayesha.waseem+emp@vroozi.com / Welcome1@ Pre-req: There must be customers configured with GL/ Accounting Category/ Project Steps to reproduce: Login into the PMan using given credentials Open a PR in draft Select a line Item Click on Apply to All button On Apply to All modal, click on Customers field Search a Customer created with the configurations given in Pre-Req Actual : Customer is not searched Expected : Customer should be searched with in the given Active Customers in the Unit ID",
        "status": "Resolved",
        "assignee": "Ayesha Waseem",
        "created": "2023-11-29T03:51:13.719-0800",
        "issue_type": "Defect",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-93938",
        "summary": "Add support for Split Accounting to the updated Apply to All modal",
        "description": "This ticket MUST be released along with:    This ticket will NOT have any effect on how the “Apply to All” functionality works on the following documents: Payment Request Invoice Memo Expense Business Case: Following the updates done in   and    , a key element is missing: the ability to apply split accounting assignments to selected line items. This enhancement aims to provide users with the ability to assign accounting splits based on quantity, value, or percent using the new Apply to All modal. We also want to enabled users to define presets with split accounting from the “Manage Presets” tab, and then use them from the “Changes to be Applied” tab.  Acceptance Criteria: Note: The behavior described in this ticket MUST work consistently on all line items, regardless of how they were added to the document: Manually via the “ Add Item ” function Shopping Cart Bulk Upload template UI Enhancement: A new field labeled \"Split Account Assignment\" should be added to the Accounting section of the Apply to All modal. The new field should have the following options: <blank>, \"None\", \"By Quantity\", \"By Value\", \"By Percent\", with <blank> as the default. Functionality for <Blank>: By default, the <blank> option should be selected.  Selecting this option should maintain the current UI state. Upon application, the system should NOT make any changes to the split accounting status of the selected items.  Instead, any fields which have values specified in them, should be updated across all the available accounting segments of all the selected line items.  Functionality for 'None': Selecting \"None\" should maintain the current UI state. Upon application, the system should overwrite existing split accounting segments with the new data provided, making all fields in the Accounting section required. Functionality for 'By Quantity': Selecting \"By Quantity\" should dynamically add at least two sets of accounting fields. Users should be able to add additional sets of identical fields. A required field labeled \"Quantity #1\", \"Quantity #2\", etc., should be added to each set. Upon application, the system should overwrite existing split accounting segments with the new data provided, making all fields in the Accounting section required. Functionality for 'By Value': Selecting \"By Value\" should replicate the functionality of \"By Quantity\", replacing \"Quantity #n\" with \"Value #n\" fields. Functionality for 'By Percent': Selecting \"By Percent\" should replicate the functionality of \"By Quantity\", replacing \"Quantity #n\" with \"Percent #n\" fields. Application of Changes: The system should evaluate if the user's specified changes are compatible with each pre-selected line item. Compatibility for split accounting by quantity will be determined by comparing the sum of the quantities specified by the user, across all accounting segments, to the total order quantity of the selected line item. If the two values are equal, then the change can be applied, otherwise, the item must not be updated. Compatibility for split accounting by value will be determined by comparing the sum of the values specified by the user, across all accounting segments, to the total order value of the selected line item. If the two values are equal, then the change can be applied, otherwise, the item must not be updated. Compatibility for split accounting by percent will be determined by comparing the sum of the percentages specified by the user, across all accounting segments. if this sum adds up to “ 100 ”, then the change can be applied, otherwise, the item must not be updated.  Error Notification: If any of the user’s selected items were not updated, and the reason for that was related to the split accounting that the user was trying to apply. The system should display a persistent notification on the UI, informing the user about which items were not updated and providing a clear explanation of why they were not updated. This message should be displayed on screen using the pattern for document level warning messages; within the “ yellow ” panel.  If the user was trying to apply split accounting by quantity, this message should highlight the items that weren’t updated using the text “ < 1 > # < 2 > not updated. The sum of the quantities across all the accounting segments you specified, did not match the order quantity of < 3 >. “ < 1 > :  If there’s only one item in this list, then the system should use the word “ Item ”. But, if there are multiple items in this list, then the system should use the word “ Items “. < 2 > :  If there’s only one item in this list, then the system should only display the index number of that item and follow that with the word “ was ”. If there are multiple consecutive items in the list, the system use the pattern  [index number of the 1st item in the list] - [index number of the last item in the list]  and follow that with the word  “were“ . If there are multiple items in the list, but they’re not consecutive, the system should list the index numbers of all those items separated by commas, with the last item in that list being separated by an “ and ”. The end of the list should be followed by the word  “were“ .  < 3 > :  If there’s only one item in this list, then the system should use the word “ this Item ”. But, if there are multiple items in this list, then the system should use the word “ these Items “. If the user was trying to apply split accounting by value, this message should highlight the items that weren’t updated using the text “ < 1 > # < 2 > not updated. The sum of the values across all the accounting segments you specified, did not match the order value of  < 3 >. “ < 1 > :  If there’s only one item in this list, then the system should use the word “ Item ”. But, if there are multiple items in this list, then the system should use the word “ Items “. < 2 > :  If there’s only one item in this list, then the system should only display the index number of that item and follow that with the word “ was ”. If there are multiple consecutive items in the list, the system use the pattern  [index number of the 1st item in the list] - [index number of the last item in the list]  and follow that with the word  “were“ . If there are multiple items in the list, but they’re not consecutive, the system should list the index numbers of all those items separated by commas, with the last item in that list being separated by an “ and ”. The end of the list should be followed by the word  “were“ .  < 3 > :  If there’s only one item in this list, then the system should use the word “ this Item ”. But, if there are multiple items in this list, then the system should use the word “ these Items “. If the user was trying to apply split accounting by percent, this message should highlight the items that weren’t updated using the text “ < 1 > # < 2 > not updated. The sum of the percentages across all the accounting segments you specified, does not add up to 100%. “ < 1 > :  If there’s only one item in this list, then the system should use the word “ Item ”. But, if there are multiple items in this list, then the system should use the word “ Items “. < 2 > :  If there’s only one item in this list, then the system should only display the index number of that item and follow that with the word “ was ”. If there are multiple consecutive items in the list, the system use the pattern  [index number of the 1st item in the list] - [index number of the last item in the list]  and follow that with the word  “were“ . If there are multiple items in the list, but they’re not consecutive, the system should list the index numbers of all those items separated by commas, with the last item in that list being separated by an “ and ”. The end of the list should be followed by the word  “were“ .",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2023-11-28T01:13:37.536-0800",
        "issue_type": "Story",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-92338",
        "summary": "Update the behavior of the Manage Presets tab, on the Apply to All modal across all Vroozi documents",
        "description": "This ticket MUST be released along with    This ticket will NOT have any effect on how the “Apply to All” functionality works on the following documents: Payment Request Invoice Memo Expense Business Case: The behavior for the “*Apply to All*” modal needs to be updated across the application. So that users are able to change the value in as few as 1 individual field in the line items, using this mechanism. Additionally, Our system does not; currently, natively support many-to-many relationships between company info & accounting info master data objects. Many customers have worked around this limitation by creating duplicate accounting elements, each of which is connected to a different parent element. We somehow have to keep this \" workaround \" functioning. Acceptance Criteria: Note: The behavior described in this ticket MUST work consistently on all line items, regardless of how they were added to the document: Manually via the “*Add Item*” function Shopping Cart Bulk Upload template Apply to All Functionality: There should be a \"Apply to All\" button in the application's user interface. This button should NOT be visible to any Employee user that has coding restrictions enabled in their user record.   The user can select one or more items before clicking the \"Apply to All\" button. Clicking the \"Apply to All\" button should open a modal dialog containing a dynamic form with multiple input fields. This modal should only show fields for the Org / Accounting elements that are enabled in the unitID.  By default, all input fields in the modal should be blank. All input fields in the modal should be optional for the user to fill in. The system should only allow a user to set values in these fields that are currently “_not deleted_” and active in the unitID.  Parent-Child Relationship: Some fields in the modal are considered parent elements, and others are considered child elements. If a user fills in a parent field, the system should restrict the user to selecting values in the child fields that are linked to the selected value in the parent field. This filtering mechanism must be driven off of the parent-child relationship of these elements in the unitID’s master data If a parent field has only one possible value for a child field, that value should be automatically filled in by the system. Mandatory Child Fields: If the user fills in a parent field, the system must make it mandatory for the user to fill in all linked child fields before allowing the changes to be applied to the selected items. Validation and Notification: Note: The requirements documented below mean that either the user’s entire set of specified changes will be applied to the line item, or nothing will be updated. There will not be a scenario where the user specifies changes to “ n ” child fields, but the system only updates some fraction of those “ n ” fields; as they were the only ones that would be valid with the existing parent field values on the line item. In this scenario, the entire set of specified changes will be discarded, and the user will be shown the appropriate error message. If the user is only updating child fields, the system should allow the user to apply changes. During the application of changes, the system must evaluate each selected item to determine if the user's specified change can work with the values already provided in the selected item's parent fields. If a user's specified change is incompatible with the existing parent field values, that item should remain unchanged. The system should display a persistent notification on the UI, informing the user about which items were not updated and providing a clear explanation of why they were not updated. This message should be displayed on screen using the pattern for document level warning messages; within the “*yellow*” panel.  This message should highlight the items that weren’t updated using the text “* < 1 > # < 2 > not updated. The specified change conflicts with one or more of the company info or accounting elements that are already present on < 3 >. *“ < 1 > :  If there’s only one item in this list, then the system should use the word “* Item ”. But, if there are multiple items in this list, then the system should use the word “ Items *“. < 2 > :  If there’s only one item in this list, then the system should only display the index number of that item and follow that with the word “* was *”. If there are multiple consecutive items in the list, the system use the pattern  [index number of the 1st item in the list] - [index number of the last item in the list]  and follow that with the word  “were“ . If there are multiple items in the list, but they’re not consecutive, the system should list the index numbers of all those items separated by commas, with the last item in that list being separated by an “* and *”. The end of the list should be followed by the word  “were“ .  < 3 > :  If there’s only one item in this list, then the system should use the word “* this Item ”. But, if there are multiple items in this list, then the system should use the word “ these Items *“.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2023-09-28T04:46:20.666-0700",
        "issue_type": "Story",
        "parent_id": "VZI-91878"
      },
      {
        "key": "VZI-91883",
        "summary": "Update the behavior of the Apply to All modal across all Vroozi documents",
        "description": "This ticket MUST be released along with    This ticket will NOT have any effect on how the “Apply to All” functionality works on the following documents: Payment Request Invoice Memo Expense Business Case: The behavior for the “ Apply to All ” modal needs to be updated across the application. So that users are able to change the value in as few as 1 individual field in the line items, using this mechanism. Additionally, Our system does not; currently, natively support many-to-many relationships between company info & accounting info master data objects. Many customers have worked around this limitation by creating duplicate accounting elements, each of which is connected to a different parent element. We somehow have to keep this \" workaround \" functioning. Acceptance Criteria: Note: The behavior described in this ticket MUST work consistently on all line items, regardless of how they were added to the document: Manually via the “ Add Item ” function Shopping Cart Bulk Upload template Apply to All Functionality: There should be a \"Apply to All\" button in the application's user interface. This button should NOT be visible to any Employee user that has coding restrictions enabled in their user record.  The user can select one or more items before clicking the \"Apply to All\" button. Clicking the \"Apply to All\" button should open a modal dialog containing a dynamic form with multiple input fields. This modal should only show fields for the Org / Accounting elements that are enabled in the unitID.  By default, all input fields in the modal should be blank. All input fields in the modal should be optional for the user to fill in. The system should only allow a user to set values in these fields that are currently “ not deleted ” and active in the unitID.  Parent-Child Relationship: Some fields in the modal are considered parent elements, and others are considered child elements. If a user fills in a parent field, the system should restrict the user to selecting values in the child fields that are linked to the selected value in the parent field. This filtering mechanism must be driven off of the parent-child relationship of these elements in the unitID’s master data If a parent field has only one possible value for a child field, that value should be automatically filled in by the system. Mandatory Child Fields: If the user fills in a parent field, the system must make it mandatory for the user to fill in all linked child fields before allowing the changes to be applied to the selected items. Validation and Notification: Note:  The requirements documented below mean that either the user’s entire set of specified changes will be applied to the line item, or nothing will be updated.  There will not be a scenario where the user specifies changes to “ n ” child fields, but the system only updates some fraction of those “ n ” fields; as they were the only ones that would be valid with the existing parent field values on the line item. In this scenario, the entire set of specified changes will be discarded, and the user will be shown the appropriate error message.  If the user is only updating child fields, the system should allow the user to apply changes. During the application of changes, the system must evaluate each selected item to determine if the user's specified change can work with the values already provided in the selected item's parent fields. If a user's specified change is incompatible with the existing parent field values, that item should remain unchanged. The system should display a persistent notification on the UI, informing the user about which items were not updated and providing a clear explanation of why they were not updated. This message should be displayed on screen using the pattern for document level warning messages; within the “ yellow ” panel.  This message should highlight the items that weren’t updated using the text “ < 1 > # < 2 > not updated. The specified change conflicts with one or more of the company info or accounting elements that are already present on < 3 >. “ < 1 > :  If there’s only one item in this list, then the system should use the word “ Item ”. But, if there are multiple items in this list, then the system should use the word “ Items “. < 2 > :  If there’s only one item in this list, then the system should only display the index number of that item and follow that with the word “ was ”. If there are multiple consecutive items in the list, the system use the pattern  [index number of the 1st item in the list] - [index number of the last item in the list]  and follow that with the word  “were“ . If there are multiple items in the list, but they’re not consecutive, the system should list the index numbers of all those items separated by commas, with the last item in that list being separated by an “ and ”. The end of the list should be followed by the word  “were“ .  < 3 > :  If there’s only one item in this list, then the system should use the word “ this Item ”. But, if there are multiple items in this list, then the system should use the word “ these Items “.",
        "status": "Awaiting Business Validation",
        "assignee": "Ayesha Waseem",
        "created": "2023-09-18T02:09:14.004-0700",
        "issue_type": "Story",
        "parent_id": "VZI-91878"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-94169",
      "released_in_current_rc": false,
      "summary": "Catalog API Design and Development - Phase II",
      "description": "Catalog Delete/Update (CRUD) APIs (with Item) Catalog Upload API with Vroozi standard data model (with Items) Catalog File upload through public API (Max size 10 MB limit)",
      "status": "Released",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2023-12-05T23:19:15.803-0800"
    },
    "issues": [
      {
        "key": "VZI-94540",
        "summary": "Design and Develop Catalog Content View mapping API",
        "description": "We need to support content group association with catalog. Support Upsert association end point for catalogs, that will update the association with the current catalog. Create or Update Content group association POST UPSERT → MERGE/REPLACE (need of header param association-update-strategy, default is merge), It will associate the content group with the catalog. The preference of the look-up is based on ID, externalId and docNo. If the record is not found by the look up, than the API will give a validation error the content group is not found. If the records is not found by any id, externalId or docNo, we will give validation error that the given catalog not found. {\n    \"catalogRef\": {\n        \"id\": \"\", //(Catalog Ref Id)\n        \"docNo\": \"\", //(Catalog Ref externalId)\n        \"exnteralId\": \"\" //(Catalog Ref docNo)\n    },\n  \"contentViewRefs\" : [\n    {\n      \"id\" : \"\",\n      \"externalId\" : \"\",\n      \"docNo\" : \"\"\n    },\n    {\n      \"id\" : \"\",\n      \"externalId\" : \"\",\n      \"docNo\" : \"\"\n    }\n  ]\n} NOTE: Content view do not have externalId, so we will not do lookup by externalId. Once we implement the externalId in content views, we can reference by externalId. We will give validation error if lookup by externalId is performed. 501 Not Implemented should be thrown.",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2023-12-20T22:07:30.649-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94169"
      },
      {
        "key": "VZI-93403",
        "summary": " Design and Develop Catalog API for CRUD Operations",
        "description": "As an API user I should be allowed to perform CRUD operations on the catalogs. Acceptance Criteria: 1- POST API to create the catalog in Working column (New Status) 2 - Get API by id/exteranalId/name For Get request catalogs/{id/externalId} For Get by name catalogs/catalog-name/{name} 3- Get the list of Catalogs, support standard filtering lastUpdatedDateAfter 4- Delete the Catalog by id/externalId (Unpublish the catalog if required) For Delete request catalogs/{id/externalId} For Delete by name catalogs/catalog-name/{name} 5- PUT API to update the catalog by id / externalId For update request catalogs/{id/externalId} For update by name catalogs/catalog-name/{name} 6- Public API documentation",
        "status": "Released",
        "assignee": "Sahar Ali",
        "created": "2023-11-03T03:27:52.245-0700",
        "issue_type": "Story",
        "parent_id": "VZI-94169"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-94942",
      "released_in_current_rc": false,
      "summary": "Tech Upgrades for RC-2024-1",
      "description": "",
      "status": "Released",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2024-01-08T22:38:36.077-0800"
    },
    "issues": [
      {
        "key": "VZI-94191",
        "summary": "Vroozi API - User API should support account restriction with Account Processor role as in UI",
        "description": "As an API user, we should be able to create the User with accounting restriction ON for Accounts Payable roles.",
        "status": "Awaiting Business Validation",
        "assignee": "Sambhu Sai",
        "created": "2023-12-06T02:38:01.590-0800",
        "issue_type": "Story",
        "parent_id": "VZI-94942"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-54074",
      "released_in_current_rc": false,
      "summary": "angular-upgrade: All the work related to Angular Upgrade ",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Jaroslav Bellus",
      "created": "2019-10-08T00:36:09.692-0700"
    },
    "issues": [
      {
        "key": "VZI-94174",
        "summary": "[ng2] Upgrade AP Document Items (vzi-document-items)",
        "description": "Goal Upgrade component  vzi-document-items  together with its all child components and services functions Components are represented as items grid in edit and display mode in Invoice / Memo and PRQ page and hosts item editable / readonly inline dialog. Scope Item grid in display mode (includes Add Item, Apply to All, Delete Item(s), Consolidate All Items(s) logic) (  ) Items grid in edit mode Hovering functionality for items in edit mode Invoiced Items Grid (  ) Search functionality OCR / ML Suggestions Tasks: Upgrade all components, services that are used by the component, with all functions (even those functions which are not used in the component) Upgrade related Unit tests and add if some are missing Make sure we are not using promises anymore but rather RxJS (including the component) If applicable, move all styles related to this component into local styles file Dev test the changes to make sure component works as before Make sure all item actions work correctly Make sure that shorcuts work correctly Make sure Apply to all logic works Items consolidation logic Search items logic Try to use idiomatic Angular instead of approaches like using query selector Dev Notes Do not upgrade items-apply-all  but rather try to open apply to all dialog in context of  vzi-document-form DifferenceCalculatorService  probably doesn’t need to be upgraded because it seems it is not used by the component Instead of  PromiseChainService  try to use RxJS. Something similar (not really similar) as I did here: Important:  Try to break the work into multiple PRs so that there are at least one or two PRs each week. The final PR should make the new components to be used in the page, so we don't break anything while continually merging the previous PRs",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2023-12-05T23:34:36.611-0800",
        "issue_type": "Story",
        "parent_id": "VZI-54074"
      },
      {
        "key": "VZI-93991",
        "summary": "[ng2] Upgrade AP Inbox Page",
        "description": "Goal Fully upgrade component  ApInboxCtrl  and  ap-inbox.html  together with its all child components and services  The page is represented by  Accounts Payable → Inbox  (login as Admin or as AP Manager)   Prerequisities :  Following tickets are finished and merged:   ] Tasks: Upgrade all components, services that are used by the component, with all functions (even those functions which are not used in the component) Upgrade related Unit tests and add if some are missing Make sure we are not using promises anymore but rather RxJS (including the component) If applicable, move all styles related to this component into local styles file Dev test the changes to make sure component works as before and make sure all the functionality works as before that includes but is not limited to:  Grids filtering ellipsis actions to Create Invoice, Memo, opening documents from Document Inbox (cXML, email PDF, Supplier Portal) Dev Notes   Logic to open documents using  InvoiceService.openHopper  will probably still need to use ng1 context. One potential solution is to raise an event using Message Service to communicate between ng2 component ap-inbox.component and AppCtrl so AppCtrl calls ng1 logic  InvoiceService.openHopper . After the hopper is closed, AppCtrl will probably also use Message Service so ng2 component is notified to refresh the grids.",
        "status": "Awaiting Business Validation",
        "assignee": "Asma Latif",
        "created": "2023-11-29T18:31:34.634-0800",
        "issue_type": "Story",
        "parent_id": "VZI-54074"
      },
      {
        "key": "VZI-92405",
        "summary": "[ng2] Upgrade AP Document Item (vzi-document-item)",
        "description": "Goal Upgrade component  vzi-document-item  together with its all child components and services (like  DocumentItemUiWorkflowFactory ).  Components are represented as item in edit and display mode in Invoice / Memo and PRQ page. Out of Scope Items grid Example Item in edit mode Item in display mode Tasks: Upgrade all components, services that are used by the component, with all functions (even those functions which are not used in the component) Upgrade related Unit tests and add if some are missing Make sure we are not using promises anymore but rather RxJS (including the component) If applicable, move all styles related to this component into local styles file Dev test the changes to make sure component works as before Dev Notes Important:  Try to break the work into multiple PRs so that there are at least one or two PRs each week. The final PR should make the new components to be used in the page, so we don't break anything while continually merging the previous PRs",
        "status": "Awaiting Business Validation",
        "assignee": "Aqsa Rani",
        "created": "2023-10-02T17:48:52.193-0700",
        "issue_type": "Story",
        "parent_id": "VZI-54074"
      },
      {
        "key": "VZI-92209",
        "summary": "Upgrade PurchaseOrderService and its dependencies",
        "description": "Goal Upgrade PurchaseOrderService and its dependencies and write unit tests. Impacted Areas Tasks: Upgrade all components, services that are used by the component, with all functions (even those functions which are not used in the component) Upgrade related Unit tests and add if some are missing Make sure we are not using promises anymore but rather rxjs (including the component) If applicable, move all styles related to this component into local styles file Dev test the changes to make sure component works as before If ng1 components are no longer used, uncomment its usages, specs and styles Update ng2 angular sheet Dev Notes Important:  Try to break the work into multiple PRs so that there are at least one or two PRs each week. The final PR should make the new components to be used in the page, so we don't break anything while continually merging the previous PRs",
        "status": "Done",
        "assignee": "majid.akram",
        "created": "2023-09-25T23:43:06.981-0700",
        "issue_type": "Task",
        "parent_id": "VZI-54074"
      },
      {
        "key": "VZI-54083",
        "summary": "[ng2] vzi-grid - update component to use Angular dependencies + add UTs",
        "description": "Goal Revisit Angular  vzi-grid  implementation and replace all dependencies with Angular services, pipes, etc. Tasks: Add Unit tests Make sure we are not using promises anymore but rather RxJS (including the component) Dev test the changes to make sure component works as before Dev Notes Important:  Make sure to dev test all usage of upgraded vzi-grid in all screens and mention those in  Impacted Areas .",
        "status": "Awaiting Business Validation",
        "assignee": "Masood Safi",
        "created": "2019-10-08T05:01:21.071-0700",
        "issue_type": "Story",
        "parent_id": "VZI-54074"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-89462",
      "released_in_current_rc": false,
      "summary": "Accounts Payable: Approval Workflow MVP (2023)",
      "description": "",
      "status": "Implementation In Progress",
      "assignee": "Deepak Mohan Kumar",
      "created": "2023-06-26T11:25:46.290-0700"
    },
    "issues": [
      {
        "key": "VZI-93872",
        "summary": "Stage - Accounts Payable - Enhanced Approval WF - Newly Added Rule does not appear on the Grid as its taking time to synch with the elastic search.",
        "description": "Server: Environment: Stage UserName:  notifyvroozi77+NonNBCU@gmail.com Password: @Welcome1 Pre-Conditions: “ACCOUNTS_PAYABLE_WORKFLOW__ENHANCED_WORKFLOW” feature toggle is enabled Multiple rules exist in the system in more than 1 grid pages. Steps:  Access Admin>Company>Workflow>Approval Rule Section. Go to a page other than 1st page and click to Add Approval Rule. Add Details on the Rule Modal and click to Save. Please see the Grid has not updated and not showing the newly added rule.  Go back to the other page and then on the last page. Please see now the rule is appearing. Actual: Newly Added Rule does not appear on the Grid as its taking time to synch with the elastic search. Expected: Grid shoukd show the rule aded right away. Thanks, Asma",
        "status": "Awaiting Business Validation",
        "assignee": "Ahmed Habib",
        "created": "2023-11-23T10:51:12.804-0800",
        "issue_type": "Bug",
        "parent_id": "VZI-89462"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-93093",
      "released_in_current_rc": false,
      "summary": "Catalog API Design and Development - Phase I",
      "description": "Create Catalog API Upload Catalog Item API using existing template Update Catalog Status API",
      "status": "Released",
      "assignee": "Muhammad Imran Sarwar",
      "created": "2023-10-26T23:01:29.965-0700"
    },
    "issues": [
      {
        "key": "VZI-93095",
        "summary": "Design and Develop Catalog Upload Public API to support existing catalog template update via attachment",
        "description": "As an API user I should be able to upload existing catalog template from the public API, and also attach images to the catalog items Acceptance Criteria: Upload the catalog file and return the response to user. If there is any error provide the link to download the error report. The catalog reference should be received in the form data catalog file should be provided by the user, (same template and validations as we have in the smart OCI) additional attachments file can be provided within this form for item images. Use the existing statuses and services in catalog API to perform the catalog upload. catalogRef : {\n   \"id\" : \"catalog ID\",\n   \"externalId\" : \"externalId\",\n   \"docNo\" : \"catalog name\"\n} Download the error report using the public end point e.g  https://dev-api.vroozi.com/catalogs/6540a450b87a055c1161555c/view-error-report  (available from UI) API Documentation  Add the new end point documentation. Add this into the release notes section",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2023-10-26T23:03:51.274-0700",
        "issue_type": "Story",
        "parent_id": "VZI-93093"
      },
      {
        "key": "VZI-93094",
        "summary": "Design and Develop Catalog Update API to support approval and publishing Actions",
        "description": "We need to support this status transition of the catalogs from the following POST end point  https://api.vroozi.com/v1/catalogs/status-update From Working column (New/Updated) Rejected Approved From Approved Column Published (Live Column) to working column will move to Disapproved From Live Column Deactivate, When the catalog is active in live column (Offline) Activate, when the catalog is already deactivated in live column (Online) to Approved column will move the unpublished status Existing transitions from the UI should be followed in the same way as allowed from the smartOCI UI. Based on the DEV demo feedback, we need to update the implementation with the following changes 1- Need to use the URI status-update instead of actions 2- Need to record the incoming request into a separate collection, that will serve the purpose of doing the audit as well later. 3- Need to expose the requestId/processId field in the response, that will be used by the separate end point to track the progress of the async process.",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2023-10-26T23:03:11.368-0700",
        "issue_type": "Story",
        "parent_id": "VZI-93093"
      },
      {
        "key": "VZI-93084",
        "summary": "Design and Develop Catalog Create POST API",
        "description": "As an API user I should be allowed to perform POST operations on the catalogs. Acceptance Criteria: POST API to create the catalog in Working column (New Status) Internal and external type catalogs should be supported The validation should be performed as we have on the FE (Catalog name should be required). Reference data should be valid and exist in Vroozi (Use standard validation messages for reference objects e.g Not found, in active and not associated etc.) Timezone should be provided as String name of the timezone, Valid timezone should be provided, if invalid timezone is provided, we will error out with a validation message. externalId should be unique Catalog name should be unique Public API documentation should be updated. Move the Published Catalog out of transaction Documents Create a separate Catalog APIs section Create the POST api for Catalog and add the following in the release notes section of the API Added support for new [Create New Catalog] POST API. (this should be a link to navigate the catalog post API. Data model should be updated if there is any new field exposed in the existing data model for the get API. (Release notes we will update when the APIs are ready for deployment, and we will deploy the changes to production. Currently catalog changes are in progress, release section should not be updated for incomplete APIs.",
        "status": "Released",
        "assignee": "Sambhu Sai",
        "created": "2023-10-26T21:35:59.433-0700",
        "issue_type": "Story",
        "parent_id": "VZI-93093"
      }
    ]
  },
  {
    "epic": {
      "key": "VZI-90000",
      "released_in_current_rc": false,
      "summary": "Provide Admins greater granularity when deciding how to route items to Ready for Sourcing, and allow Buyers to reject/return items before creating a PO",
      "description": "",
      "status": "Open",
      "assignee": "Naufil Aziz",
      "created": "2023-07-18T01:21:19.710-0700"
    },
    "issues": [
      {
        "key": "VZI-90002",
        "summary": "Route PR Line items into BuyRoute based on the enhanced BuyerGroup definition",
        "description": "Note: This ticket  MUST ONLY  be release alongside    Business Case: Based on the changes made in   , the system’s logic for routing PR line items to the appropriate BuyerGroup needs to be updated.  Acceptance Criteria: Retain the current behavior where PR line items are auto-assigned to Buyer Groups based on matching attributes. Once assigned, PR line items should automatically appear in the \"Ready for Sourcing\" queue of all associated Buyers. Retain the current email notifications sent to Buyers when they receive a PR line item in their \"Ready for Sourcing\" queue. The fields that play a role in the routing logic include: Product Categories, Suppliers, Company Codes, Cost Centers, GL Codes, Projects, and Locations. If any of these fields are left blank on the Buyer Group definition, ignore those attributes when matching a PR line item to a Buyer Group. In case multiple Buyer Groups match a PR line item, show an error prompting the user to manually select a Buyer Group. Evaluate if this is possible: Log any routing failures and roll the entire PR document back to its previous state.",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2023-07-18T01:23:14.603-0700",
        "issue_type": "Story",
        "parent_id": "VZI-90000"
      },
      {
        "key": "VZI-90001",
        "summary": "PMAN: Add additional parameters to the BuyerGroup definition",
        "description": "Business Case: We need to provide unitID Admins with more granular control over which PR line items make it over to which BuyerGroups. In order to accomplish this, we need to add more parameters to the BuyerGroup definition.  Acceptance Criteria: Change this …  To this … General Changes from the existing modal: Remove the existing “ Click here to select all … “ links Move the existing “ Product Categories ” and “ Suppliers “ fields into their own section This section should be titled “ General Info ” Addition of new fields to the BuyerGroup definition: After the General section, add a new section called “ Company Info “ In this section, add a new type-ahead field for Company Codes After the Company Info section, add a new section called “ Accounting Info “ In this section, add new type-ahead fields for the following accounting objects: Cost Centers GL Codes Projects Locations General rules for the input fields: All the fields in the form, except for  Group Name  and  Group Description , should be optional If any of these fields are left empty, the effect should be the same as if the rule had been defined to work with any possible value for these fields.  All of the fields in the General Info, Company Info and Accounting Info sections should be type-ahead fields These fields need to be multi-select fields If the user clicks into the Company Codes field, they should see a list of all active, available master data objects for that specific field. If there’s no Company Code specified in the Buyer Group definition, when the user clicks into any of the Accounting Info fields, they should see a list of all active, available master data objects for that specific field. If there are one or more Company Codes specified in the Buyer Group definition, when the user clicks into any of the Accounting Info fields, they should see a list of all active, available master data objects for that specific field. However, these values should be filtered based on whether they’re linked to 1 of the specified Company Codes or not.  Clicking into any of these fields should  NOT  wipe out any of the previously selected values in that field.   Users should be able to manually remove individual selections from each of these fields by clicking on the “x” on that individual value’s “pill” If a selected value has been deactivated, or deleted from the unitID, the next time a user opens this modal, that value should be highlighted and the user should be informed of the change.  The following information was added on 12/01/2023 PKT: Help text to be used for each of the fields on this modal: Field Help Text New addition / Update to existing help text Associated Buyer(s) Please select the Buyers that you want to include in this group. If this Buyer Group is assigned to a line item, and the system evaluates that the line item should be routed into Vroozi BuyRoute, all the Buyers listed in this field will receive the item for sourcing.    Product Categories Please select the Product Categories you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Product Categories selected in this field.    Suppliers Please select the Suppliers you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Suppliers selected in this field.    Company Codes Please select the Company Codes you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Company Codes selected in this field.   Cost Centers Please select the Cost Centers you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Cost Centers selected in this field.    GL Codes Please select the GL Codes you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the GL Codes selected in this field.    Projects Please select the Projects you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Projects selected in this field.    Locations Please select the Locations you want to include in this group. This Buyer Group will be assigned to a line item, if the item is associated to one of the Locations selected in this field.    The following information was updated on 12/21/2023 PKT: # Question Answer 1 Which fields should be shown on this modal? Only those fields should be visible on this UI, which the unitID is configured to use. 2 if an accounting object is enabled in the unitID, but configured as “Hidden” in the line item configs, should the Admin be able to define a Buyer Group based on that accounting object?  Except for the GL Codes, the answer would be yes. As these accounting objects can be configured in each requester’s user profile, even if the relevant fields are hidden on the UI at run-time.  3 Should the BuyerGroup definition apply any filtering logic when allowing an Admin to specify values in the fields?  Yes. But only if the BuyerGroup definition includes 1 or more Company Codes. If it does, then all child fields should present values filtered by the specified company codes. E.g. Each Cost Center in the list of options that the Admin can pick from, should be linked to at least 1 of the Company Codes that have been specified.  4 Should the BuyerGroup be updated on line items when a user updates the company info, or accounting info on that line item via the “Apply to All” function?  Yes. When the company info, or accounting info on a line item is updated via the “Apply to All” function, the system should evaluate whether the existing BuyerGroup assignment can work with the new information or not. If it can, then the existing assignment should be left as it is. If it can’t, then the system should fetch a new BuyerGroup based on the new information available on the line item.  5 Related to the question above, what should happen in the case of split-accounting being applied to the line item?  If the line item has split accounting applied to it, then the system should base the BuyerGroup assignment on the 1st split segment in the line item’s accounting info section.  6 What should happen if there are multiple BuyerGroups applicable to the line item?  Since the Buyer Group field is optional on the line item modal, we will leave that as it is. So …  - If the BE doesn’t return any Buyer Groups, leave this field empty - If the BE returns 1 Buyer Group, auto-select that value in this field - If the BE returns >1 Buyer Groups, auto-select the 1st value from that list in this field",
        "status": "Awaiting Business Validation",
        "assignee": "Javaid Sattar",
        "created": "2023-07-18T01:22:38.044-0700",
        "issue_type": "Story",
        "parent_id": "VZI-90000"
      }
    ]
  }
]